{"date": "2005-10-12", "author": "bencomic", "panels": [{"background": "images/backgrounds//curtain.jpg", "dialog": {"right": {"text": "to Heaven. Romans 12:2 For all have sinned and fall short of the glory of God. Isaiah ??:?? (I don't remember) For your works are as filthy rags before the throne of God (in terms of salvation). Know", "type": "dialog"}, "left": {"text": "Now, in case you missed it, to know Christ as your personaly savour, you must admit to Him that you're a sinner and need His grace; you need to realize that all have sinned and you can't work your way", "type": "dialog"}}, "characters": {"right": "images/props/mike2-2.gif", "left": "images/kaddar2/kid_ck_r.gif"}}, {"background": "images/backgrounds//curtain.jpg", "dialog": {"right": {"text": "to Heaven. I know I've sinned against you. I accept and believe that Jesus Christ of Nazareth is the Son of God, and I believe in Him, that He lived, died, and was ressurected. I accept your gift of", "type": "dialog"}, "left": {"text": "that He is not willing that ANY should perish, but that ALL should come to repentance. Are you ready to pray the prayer? Here it is: Dear God, I admit that I'm a sinner, and that I can't earn my way", "type": "dialog"}}, "characters": {"right": "images/props/mike2-2.gif", "left": "images/kaddar2/kid_ck_r.gif"}}, {"background": "images/backgrounds//curtain.jpg", "dialog": {"right": {"text": "spoke truely and meant what you said, you're a changed person, a born again person. God Bless you all. -Jazzy, who shall soon be called Eli. For more information, go to http://www.rapt ureready.com", "type": "dialog"}, "left": {"text": "forgiveness, and I now choose to serve you. Thank you for forgiving me and loving me enough to send Jesus. In Jesus's name I pray, Amen.That's it. Now you are guarenteed a place in Heaven. If you", "type": "dialog"}}, "characters": {"right": "images/props/mike2-2.gif", "left": "images/kaddar2/kid_ck_r.gif"}}], "sc_id": 315900, "title": "JAZZ ODYSSEY epilogue (we learned something today)"}