[{"id":"4","gamefile":"burglar!.zip","reviewer":"Commodore","email":"JDDGames@yahoo.com","review":"Burglar! is a game that is fun from the first board to the last. You play as Luke Steel, an aspiring burglar looking for a good time. Baglarr and Sons is the organisation that supports your criminal activities and they assign you places to rob and items to steal. Each robbery requires figuring out different ways of breaking in and avoiding detection. The amount of liberties you have in this game is what makes the gameplay really fun. First you must select three items from a collection of tools for use in the robbery. Some tools are required, some only allow you to steal more from the place you are robbing. Figuring out the best combination of items to maximise the amount of goods you can steal is a enjoyable test of perception. During the robbery you can basically grab anything of worth that isn't nailed down or too heavy. You also have to prepare for the unexpected, like noisy and restless children. There's plenty of tension as you sneak around and work against the forces that try to thwart you. Frantically running around and touching everything while a cleaning lady is slowly getting closer was something that actually got my heart racing. The varity of the missions is good ranging from your casual petty theft to breaking in to the city's own police station. Also part of the action is a pickpocket free for all where you try and pinch as many billfolds as possible within a period of time. <br><br>\r\n\r\nThe story starts off seeming secondary to the fun of going around robbing places, but later as you begin to get yourself in trouble you uncover the misdeeds of the company's very own leader. The character you play handles this in a very singular way, by breaking in to the Boss's office. Luke Steel himself as a character is an impulsive one. Picking the pockets of everyone, kneeing the guard in the crotch repeatedly, and generally being a bad-ass who doesn't care who he steps on to get to the top. He never doubts why he is stealing or stops to wonder where it will lead him. Getting caught or killed is always on his mind, but he knows that that will not, in the end, be the results of his deeds. On top of the good characterisation and story, the writing and humour is spot on. Numerous references to Drac0 and Knightt combined with humour that everyone can understand makes for a game that is both fresh and familiar. <br><br>\r\n\r\nThe graphics in Burglar! are entirely on par with the rest of the game. The street is shown at an impressive 2\/3 perspective and the cutscenes are well drawn with plenty of objects used for small details like cigars, cigarettes and drinks. The colours contrast very well and the backgrounds are bright and provide plenty of eyecandy. The mood set by dark scenes and drained expressions makes you feel for your character and makes you want him to succeed though the dark times of his experiences. <br><br>\r\n\r\nBurglar! stands out as one of the best games ZZT has to offer. It's fun, original, and addictive. The graphics are detailed and atmospheric. The music needs to be released on CD. The game needs to be downloaded and experienced. ","description":"You are Luke Steel, an experienced burglar, thief, pickpocket, and all-around badass. Burgle like a pro while avoiding alarms, cops, and conspiracy!"}, {"id":"1","gamefile":"ezanya.zip","reviewer":"Commodore","email":"JDDGames@yahoo.com","review":"Ezanya is a game that even after all the advances ZZT has made, still plays fun, fast, and challenging. The graphics, whilst dated, are obviously ahead of its time for 1991, incorporating primitive shading and chaotic blotches of colour that set the scene quite well. Unlike other games that came out during, or even long after, Ezanya is highly interactive. Almost every object on the board is interactive. It's done well too. There are menus to choose from, things that give different messages at different times, and even some good royal music that plays when you talk to the king. Another notable feature of the game is music that doesn't tax the ears. Every small detail seems to warm up the game. <br><br>With all of this the writing has to be good, and it is. Besides the fact that Daggert can use proper grammar, he also has the ability to give some very good descriptions of what is going on. The dialogue is done well and isn't tedious or boring. This makes for a game that focuses on trying to create an atmosphere rather than flat-out game play. Still Ezanya doesn't falter there either. Very little separates the first level of the caves from you typical dungeon crawl to-day. There are pre-programmed monsters, which is excusable, but there are also a supple amount of programmed dwarves and dragons for you to fight, especially as you progress, the monster\/object ratio seems to favour the objects more and more which allows the game to become more interesting by keeping things fresh. <br><br>The game, is not flawless however, the building of the levels seemed to lack proper testing as there were many times (Dwarven Outpost) where I had run out of ammo with very little health and had to hurry back to the pub to get some more. I suppose I did run a little haphazardly though a lot of it but only had to cheat only three times. Once for a slider puzzle(not a good one either) and twice for health. Overall this game is a step above the other games of 1991 and even now. If you're going to play only one 1991 game from ZZT, avoid Town and play Ezanya.","description":"The dwarves have stolen royal artifacts from the palace. Delve into their underground hideaways and take them back."}, {"id":"3","gamefile":"dwoods.zip","reviewer":"MadTom","email":"madtom@gmail.com","review":"Zenith's third game sees his skill developing with clarity from his earlier games <i>Blue Moon<\/i> and <i>The Kave<\/i>. An unpretentious fantasy RPG with typical nice Zenithian graphics, obscenely overused catchphrases, strong Discworld influences, and a variety of different puzzles and simple engines, <i>Dragon Woods<\/i> is yet another classic ZZT game to add to your daily-updated lists.<br><br>\r\n\r\nYou play Lindor MacWellianson, a wizard whose powers include shooting little circles and getting drunk on one pint of beer; a member of an underground society called CATS dedicated to the overthrow of the evil king Asphalt. Your quest is to find the Minfannon, a jewel which will enable your society to control the tyrant king's mind, and enable Princess Salmonella to ascend to her rightful place on the throne.<br><br>\r\n\r\nOf course, it's never that easy, is it? The Minfannon is located in a volcano beyond Dragon Woods, near your hometown of Coaster. So, off you go to buy some magic (ammo), torches, health, and other such like, and begin your quest. Along the way you will meet with such perils as a group of druids performing a sacrifice, a stubborn troll who won't allow you to pass his bridge, a vampire named Cracula inspired by Zenith's Geography teacher, and ultimately, a dragon guarding the Minfannon itself.<br><br>\r\n\r\nGameplay is based primarily on \"find objects or information, find out what they're for, and get new objects or information in the process,\" but there's also a little exploration to do, and a few well-programmed shootouts (not to mention a turn-based RPG battle at the end). Effort is put into tried-and-true tricks of the trade (try saying that ten times fast). The jokes in general are funny and the whole game has a very lighthearted atmosphere, in spite of the perils of Lindor's quest.<br><br>\r\n\r\nThe graphics are cute, as Zenith's style is wont to be, and in general are quite aesthetically pleasing. I am particularly impressed by his scenes in nature (which dominate the game) with trees and rivers, and such like. The programming is very sound, though I did encounter one or two small bugs, and the only really annoying ZZT clich? you'll find (apart from an entire board of cameos, which is actually really interesting from a historical perspective) is a small one of those darned invisomazes. Well, at \r\nleast it isn't a whole board.<br><br>\r\n\r\nThere's only a couple of noteworthy problems with the game; the music is nothing spectacular, and quite a few of the sound effects are shaky. There's also a little bit too much walking around to do, which can become tedious. The ending might leave you going, \"Uh, what?\" But aside from that, <i>Dragon Woods<\/i> has a lot going for it, and you should definitely play it, if you haven't done so already!","description":"Find a precious jewel and restore the rightful ruler in this classic Zenith Nadir game!"}, {"id":"2","gamefile":"v0mit.zip","reviewer":"MadTom","email":"madtom@gmail.com","review":"Freddy the ferret, a confirmed junkie living in a mushroom perched atop a cliff, is on a quest of great significance. His perception greatly altered by the effects of the spiked intravenous substance he has just taken, Freddy wanders in a dreamlike state through his own distorted and mis-shapen version of reality, on his quest for the perfect drug that will lead him to an unprecedented nirvana.<br><br>\r\n\r\nTold by his friend Skankk to visit a friend of his, Jimmy the Rat, Freddy begins his search which will lead him to the town of Angel, beyond the Burr-lynn wall; after solving puzzles in such trippy places as the Karma Caves, The Temple of L0ve, and the wishing well, which holds the greatest treasure \"this side of fucking Nashville.\"<br><br>\r\n\r\nMade in only a week by, at the time, a vehemently pro-drug drac0, <i>Edible Vomit<\/i> is a remarkable, frightening and hilarious ZZT game which not only has so much of that drac0nic charm that we all know and love, but sends an important and rather potent message into the bargain. <br><br>\r\n\r\nFreddy wanders in a superbly-drawn fantasy ZZT world of impossible colours in his quest for the ultimate high ... things such as the iridescent rainbow colours of the Temple of L0ve, and the strange rocks deep within the Karma Caves. The graphics are almost exclusively for playable boards; art boards are only used at the beginning and conclusion of the game, which gives it a very free-flowing feel.<br><br>\r\n\r\nSimple pick-up-an-object-and-find-a-use-for-it gameplay is used; many of the objects' uses are rather ... illogical, but hey, this is a drug trip we're talking about here. Can anyone think of a use for a spork? How about stabbing a giant floating eyeball into submission? Ahem.<br><br>\r\n\r\ndrac0 injects a great deal of personality into the game. This has the effect of making the writing not only very interesting, but also hilarious. It's nothing that JohnWWells might consider spectacular in terms of narrative technique ... but how can one not feel amused when faced with the message, \"you approach a decapitated man, his limbs strewn all over th'place, a vine tied securely around his neck. he has BLO0D\", or meeting Master Bates, who has suffered the grievous misfortune of \"pulling a boner\"?<br><br>\r\n\r\nBut beyond all the silly jokes,  and references to Harvey Danger and how much he \"rocks ass\", as the game draws to a close another side of the author himself is revealed; one of sadness and emptiness. In fact, the numerous spelling errors and very slack writing mechanics only enhance the realism and personality of the game.<br><br>\r\n\r\nIt is never clear at what point reality ends, and the way Freddy perceives it begins. I have my own ideas, but I'll leave that to you to decide. Until then, 100%, and it's the only game I'd ever give that score. You'll have to play it to really see why.","description":"Freddy the ferret searches for the perfect drug."}, {"id":"5","gamefile":"syndrome.zip","reviewer":"Nadir","email":"nadir427@hotmail.com","review":"First things first; this isn't a game as such. This is a tutorial outlining things any aspiring ZZT programmer should avoid. As the name implies, ZZT Syndromes is a parade of those horrible, horrible afflictions common to ZZT games at the, erm, \"less professional\" end of the spectrum. Barjesse obviously believes in the idea of learning through example, so he proceeds to put the player through that which must not be. <br><br>\r\n\r\nThe file itself, following the (literally) flashy introduction screen, is split into two parts, characterised by a fork in a path. One road leads the observer to bear witness to Syndromes deemed \"Fatal\" while the other leads to those pertaining to the label \"Goofy\". The difference between these two is a simple one- Fatal Syndromes are those that will, more often than not, cause a player to delete the game out of frustration, while Goofy Syndromes are that which renders a game, while not unplayable, rather annoying to progress through. Yes, you too can witness firsthand the horror of the \"Not Enough Health\" Syndrome! The annoyance of the \"Broken Board Link Syndrome\"! The tedium of the \"Ping-Pong Path Syndrome\" and the downright stupidity of the \"Poor Man With A Big Dog Syndrome\"! All and so much more are contained herein for your personal delection, you lucky kid. Lucky, lucky child. <br><br>\r\n\r\nIf the above seem similar to the stuff from Wong Chung Bang's \"ZZT Crime\", that's because ZZT Crime is basically Syndromes with a few bits added and changed. Play that as well, there's no reason why you shouldn't; but I recommend playing this first simply for chronological order (Syndromes was made in 1996 or thereabouts, while Crime is dated c. 2000.). <br><br>\r\n\r\nAll this, and it has a guy who just says \"Hi!\" <br><br>\r\n\r\nAlso recommended; <br><br>\r\n\r\nZZT Crime (Wong Chung Bang) <br>\r\nZZT Help (Matt Williams) <br>\r\nSemi-Cool Things You Can Do With ZZT (Dudeworks) <br>\r\nZZT Encyclopaedia (Chronos30)","description":"Want to make better ZZT games? This is a must-play, especially for first-time ZZT game makers."}, {"id":"6","gamefile":"merc.zip","reviewer":"Flaming O","email":"okcomputer135@aol.com","review":"ZZT has its limits, to be honest. Yet they games that are considered remarkable are the games that seem to know no limits. Wong Chung Bang's The Mercenary are one of these few elite. What sets this game apart from others it that it may be the most re-playable game in the lifespan of ZZT. You may find yourself playing this game a dozen times, each time with a different path. You start out your journey placed with a pivotal decision.  You must decide from three items are placed before you: a rope, a gauntlet, and a lockpick. Your choice on which of the three \"relics\", as they are called in the game, you take with you molds the quest ahead of you. To explore new areas, rocks must be crushed, crevasses must be crossed, and locked doors must be opened. All of those tasks require a certain item complete the action, yet it depends on which one you have that determines your continuing journey. But don't fret over this early decision; you will be able to acess the other two relics, along with a bonus one, after beating the game's unique and challenging bosses.   <br><br>\r\n\r\nYet there's much more to this quest than passing barriers. You confront a variety of enemies, such as statues, mummies, and fireballs, all of which are killed in a specific way. A system of upgrading weapons from touch attack swords to long range attack guns make this possible. These upgrades, along with the essential health, ammunition, and torches to light the way, can be puchaced with gems found throughout the game.<br><br>\r\n\r\nWong Chung's genius doesn't end there. He provides the player with a system of experience, which is obtained through killing enemies and discovering items. This system sets a limit on the number of heath, torches, and ammo you can hold, adding more challenge to the game and an rpg-ish feel.<br><br>\r\n\r\nThe game is one of few first-rate ZZT games that does without a developing plot. Yet it need not have one, for it is a game of exploration, not narration.  His bright colored graphics also set proper mood for the contrasting enviroments you will traverse through. With The Mercenary, Wong Chung Bang's creativity has produced, quite simply, quality, five-star ZZT-gaming.","description":"If you want a ZZT game that you can play over and over again, The Mercenary is the way to go!"}, {"id":"7","gamefile":"Esp.zip","reviewer":"Fishfood","email":"fullband@hotmail.com","review":"<u>Background and Story:<\/u><br>\r\nWhen ESP Demo was released back in the day, it was with little fanfare. Nobody really took any notice of it. It was a demo amongst hundereds of demos, and nobody really knew much about its author, Mr. J.W. Wells, other than that he liked to frequent the forums with random stuff about operas and sorcery that seemed more out of place to your average preteen ZZTer than craNKGod in a sperm bank. I did manage to find the time to play it though, and I'm glad I did. It didn't look all that special, but the gameplay and writing was far above my personal expectations of a modern ZZT game - which are already quite high - and two thoughts entered my head. The first was that the game had the potential to be brilliant, and the second that the game would never ever be finished. <br><br>\r\n\r\nWhen news came that Funk [<a href=\"http:\/\/zzt.the-underdogs.org\/?p=database&title=Indiana+Jones+and+the+Lost+Crusaders\">\"Indiana Jones and the Lost Crusaders\"<\/a>] was going to be doing the art for ESP, it only added to my pessimism. Not because Funk wasn't very good at art - far from it - but because the game now had a label that had doomed all previous games under it to failure. A genre that even IF couldn't pull off to any great effect back when it had some of the best ZZTers in the world in its name. It was now a 'joint' project. <br><br>\r\n\r\nWhen news came that the second disc had corrupted and that Funk had given up, I stopped following ESP. I thought it would have been futile to continue it. Wells hadn't given up, however; some time later, I heard that Nadir [<a href=\"http:\/\/zzt.the-underdogs.org\/?p=database&title=Dragon+Woods\">\"Dragon Woods\"<\/a>, <a href=\"http:\/\/zzt.the-underdogs.org\/?p=database&title=Dragon+Woods\">\"Code Red:SE\"<\/a>] and Rob_P [<a href=\"http:\/\/zzt.the-underdogs.org\/?p=database&title=\"Interstellar+Police:+Escape from Stal' Prison\">\"Interstellar Police: Escape from Stal' Prison\"<\/a>] were added as replacements, and the game was finally released at the end of March, 2003.[1] I deliberately stayed away from beta testing because I wanted to enjoy the game in its completeness, and write a fair and unbiased review. I had very high expectations of a game with such big names behind it, despite the actual game being structured and written by a relative newcomer.  Not only did ESP meet those expectations, but it surpassed them in almost every way. <br><br>\r\n\r\nESP is about a bunch of, well, Evil Sorcerers, who plan to take over government by using hypnosis to sway public opinion. It's a bit more deep than that, really, and it's not all boring political satire or geek RPG magic rubbish either. In fact, it's nothing like that at all. The plot is quite long and keeps the game interesting, and needs to be played to be fully experienced. \r\n\r\n<u>Gameplay:<\/u> <br>\r\nFirst things first.  Size.  Now some people might fool you into believing that size isn't everything, and in some cases that is true, but not in ZZT. I've rarely played a game over 300kb that was crap, and ESP is almost three times that size. Luckily the size is backed up by quality, as you can tell by the number of boards per file. To explain, the game is four files, but the number of boards in each file is pretty small, about the number you would expect in a one or two file game. That doesn't make the game short by any means; it took me three hours to play through the entire thing [2]. It just shows that so many flags were set and so much code written in such a small space that wells needed to make more worlds simply to avoid the dreaded runtime errors (Which you may still get if you run this game in windows on an old computer). If you're tired of 30kb ZZT games with no real meaning, this is the game for you. The \/text file\/ is bigger than a third of the ZZT games on this archive. This alone speaks volumes. <br><br>\r\n\r\nThe game itself is split into six chapters, though only five are playable in one game. The end chapter is chosen by the player (I'll get to that soon enough). One of the most delightful things about ESP is that Wells picks up on a fundamental thing a lot of people tend to miss when playing games of this size - there are many audiences to cater to. There are three types of people that will play ESP. Firstly, the people like me, who are pretty bad at action sequences and find them somewhat dull. We prefer puzzles over the shift key. Then there are people who like action and puzzles to clear their mind, and give him a bit of a distraction. Finally there are the people who will just play the game for action, and lay smackdown to the enter key whenever they even smell a dialogue box. Luckily, ESP caters for the first two examples. Granted, it does little to appease the last example, but this type of gamer would be better of playing mindless action games like Arena. <br><br>\r\n\r\nSo how do you cater for both action kids and adventure gamers? Simple! You ask them. When you get to the first action scene in the game (I won't ruin anything), you are given the option to cancel the time limit, kill the enemies, get more health, or go it alone. Unfortunately for people like me, you can't skip it completely, and you can still die, but action sequences do tend to become easier when the game kills all the bad guys for you. The game even becomes non-linear for a little while, a rarity for adventure games, when you choose between action and adventure for a whole chapter. The outcome of these chapters doesn't affect the #endgame though, which is mildly disappointing. There's no Code Red multiple endings here, despite the game being set up perfectly for it. <br><br>\r\n\r\nWhile this alone is reason enough for me to breathe a sigh of relief that I don't have to sit through the engines [3] (nice and original and bug free as they are, some of us just \/don't like them\/) it would have been nice if the game had been a little more subtle about gameplay choices. While help is welcome on single boards, the choice at the end of chapter 4 was a little to black and white for me. I think Wells could have approached it with a bit more style and avoided interrupting the flow of the game. Perhaps there could have been a choice driven conversation, and choices picked determined if they player wanted to fight or use puzzles. Or perhaps, like Lucasgames' \"Indiana Jones and the Fate of Atlantis\" point-and-click adventure, have boards where you can solve puzzles by smashing things up or thinking things through. A minor gripe, but still something that seems a little unprofessional compared to the rest of the game. At least this way you know for certain what path you'll take, though. <br><br>\r\n\r\nChoice and non-linearity aside, I haven't actually answered the question you all came hear to find out about. 'What's the bloody game like?' You could have downloaded it and been half way through the first chapter by now, but you're obviously either Wells or one of the artists looking at what I've said about your game. Or you value my opinion, misguided fools. Anyway, the game is mostly a mix of dialogue & cut scenes and inventory-based puzzle solving. Both are very enjoyable and reasonably well balanced. One more Gameplay chapter would have been nice, just to space out the game a little, as the ending seems to hit you like knightt on a catapult. You play two agents during the game, Cleatle, a 'concerned' scientist, and Burns, a member of the \r\nparty who happens to be a Sunday school teacher and a ex secret service agent. Cleatle's missions are geared towards puzzle solving. None of his missions contain engines or action sequences - Apart from a rather original and easy 'RPG' engine - and only a few time limits. Burns' missions are geared towards action, and choosing her chapter at the end will allow you to play the majority of action boards in ESP.  She also has more engines and time limits. <br><br>\r\n\r\nInventory gaming is simple, and those who have never played an inventory game before will know what to do straight away.  For those that haven't, Wells explains, reminding users to unset any flags they set, as the game uses quite a few of them each file. For this reason, editing probably isn't a good idea either. Inventory gaming basically involves picking things up and using them with other things\/people to achieve your goal. <br><br>\r\n\r\nThe difficulty of this section of the game is a little lacking.  I'm pretty bad at adventure games but I only had to look at the help file once - to solve a maths puzzle that I knew I wouldn't understand. The inclusion of a very detailed help file that will only give you the help you need was a very good idea, and it saved me from getting very annoyed with the game. Some games have links to websites or authors' emails, but this way as long as I have the game, I have the help file, too. It makes it easier to abuse, however, and that will ruin the game entirely. It's hardly Wells' fault if people can't control themselves, though. <br><br>\r\n\r\nThe games puzzles are logical and straightforward; there are no ridiculous scenarios like using a set of keys on parrots or anything insane like that - just normal puzzles that make sense. On a whole, this makes the game easier than more outlandish inventory games like p0p, but also more likeable and less frustrating as well. You CAN die in the inventory parts of the game, normally a fatal gameplay design for adventure games, but it's very hard to do.  You only die for doing very stupid things that will obviously kill you. It's advisable to save anytime you are going to try something you aren't certain will work. This is basic good advice for any ZZT game, and, luckily, whenever there is a higher-than-normal chance of you dying, Wells warns you beforehand to save. There are a few impromptu deaths here, and you'll normally have to at least press your way through dialogue you've read to get back to the point you died, even if you save when Wells tell you to. <br><br>\r\n\r\nThe action sequences are more difficult, even without resorting to 'real' RPG battles or super difficult bosses. The enemies fire fast and move fast and your health is never super high, so you have to be on your guard if you're going to play through all of Burns' missions without help from the game. I prefer her engines to the actual action sequences, which, while great, don't seem to keep up with the quality of the rest of the game. Her engines range from quite difficult to very easy. One of her engines isn't skippable, but it's so easy that you'll barely notice anyway.  I still would have liked the option, though. <br><br>\r\n\r\nThe only real problem I have with the gameplay itself is that there wasn't enough conversation. While there was plenty of dialogue in itself, there wasn't enough 'user lead' conversations. Many adventures use question asking interfaces on people to find clues or mainly just to add to the game and find out more about people. It would have been nice if I could have said more than what the game wanted me to say. Cleatle doesn't seem like the kind of person to get straight to the point about things, and it would have fleshed the game out so much more. <br><br>\r\n\r\n<u>Plot and Writing:<\/u><br>\r\nFor a game with so much of this, it's only fair to give it it's own section. There is a lot of dialogue in ESP, and many cut scenes, but they are well worth reading and viewing. The plot is at least half the enjoyment of the game. The plot itself is a little average, but the writing is brilliant. For the first time since Rhygar, I've felt that the characters are more than just smilies and that they actually have a reason to care about them.[4]. <br><br>\r\n\r\nThe annoying thing about writing reviews is that I can't really tell you much about the way the plot works except that it's 'very good.' It's varied, interesting, and funny in most parts. It's a good vehicle to carry the gameplay. You never feel like you are doing the same thing twice. It's all there if you want to read it, its accessible and straightforward - chapter, cut scene, chapter, cut scene. No suprises there, which is a little unfortunate; the structure of the game is a bit dull. I also get the feeling in parts that Wells tried to dumb himself down a little, adding in occasions notes that people should read everything, when he really shouldn't have bothered. If people don't read it, and they die, they should go play Town of ZZT or something that doesn't have so much effort and emphasis put into the writing. <br><br>\r\n\r\nThe only thing I didn't like about the game was the ending, which seemed a little immature for Wells, It felt like AKWARE had taken over Wells' mind. I much preferred the ending he never wrote into the game that's scripted in the text file. I may sound pretentious here, but I thought that this ending seemed to fit in more with the rest of the game. Again, I won't spoil things, and you'll have to make up your own mind about that. I'm aware that many people, me included, would be hesitant about the quality of a game made by someone who NEVER shuts up about Guilbert and that other guy, and opera, and thinks top hats are the height of fashion. So to warn you, the game does have some elements of that. Most, luckily are in the form of in jokes not crucial to the games comedy factor. There are a few things you wont understand or care about, if you aren't either clued up on G&S, understand Latin or English, the later I'm sure due to Funk adding random English in-jokes (Brass Eye, Eh?) into the games' files. <br><br>\r\n\r\nSome other things, such as the chair poems, seem a little out of place in ZZT and don't really fit the flow of the game. Of course, none of this stops the game from being one of the best games ever created; it just means you might have a few occasions where you think, 'What the..?'. Luckily, it seems Wells doesn't take himself too seriously, an obvious mistake when making a comic adventure game. The very end board is brilliant proof of this. Don't think you need to be cultured to like this game. Hell, I love it, and I'm listening to Avril Lavigne while I write this. <br><br>\r\n\r\nThe funniest moments in the game aren't usually in the actual big segments of dialogue, though; it's too set up and cardboard to be brilliant humor, but there are some real rimshot moments in there. The horse thing and some of the 'aside' moments when people are talking are just a little too corny for me. Thank God that Wells didn't give up and start the whole arguing with the narrator. Chickenwire, this is not. The laugh out loud (or at least snigger) bits in the game come in the form of being a fool. <br><br>\r\n\r\nBecause of the incredible attention to detail, it's great running around and trying stuff that you know won't work just to see what the game says about it. It's real Lucasarts humour, here. Most of them - but not all - can be found in the text file, but play around and try everything; you really can't rush around if you want to get the most out of this game. <br><br>\r\n\r\nAll the funniest humour isn't the humour that the dialogue boxes make you read. Overall, the writing is some of the best in ZZT. Though it can resort to being cheap and a little cringe-worthy, Wells has always tried a little to hard to be a Victorian Englishman in my book, and even in games comes off a little elitist, but this is only in very few cases that can easily be shrugged off compared to the writing as a whole. There's so much of it, though I think there should have been even more, especially in game. It all seems very formulaic. It would have been nice to go 'off the rails' a bit and talk to things and see things that don't have anything to do with the game. Red herrings not only make the game more fun, but make it harder as well. Flags permitting, of course. <br><br>\r\n\r\n<u>Graphics and Sound:<\/u>\r\nThe graphics are where Wells steps out of the arena, and Funk, Nadir, and Rob_P take his place. The first world, drawn by Funk, has some of the best 'People art', with the characters looking funny but realistic, well-shaded, and with good proportion - everything you would expect from Funk, had you played one of his ZZTV channels in the past, and everything you would expect from a game of this style. His game boards aren't quite as inspiring, a bit ugly in places with too little shading, though there are some really nice boards, such as the top-down view of the alleyway in Chapter One and the Scope view on Brickles in Chapter Two. He does tend to make the sorcerers looks a little overweight, though. <br><br>\r\n\r\nNadir does a much better job of game boards, though I was expecting more of a style change than what I saw. The cut scenes were obviously different, but the game boards generally stayed the same, though a little more detailed than Funk's. However, Nadir has the tendency to get a little overexcited, and he put a few too many objects and colors than most human eyes can cope with. The overhead screen on Chapter Four is a little hard to navigate round, though generally nice to look at, even if you can't always tell what it is. Having worked with Rob_P, his style for disc three was a little more apparent than the others. There's little empty space that isn't taken up by random blocks, and, unlike Funk's rooms, his rooms don't take up the whole board - they only use the space they need. His character art is nice, especially with the picture of Burn's and Octinar looking quite drac0-ish. It has a very 'classic-IF' flavour to it. <br><br>\r\n\r\nAnyone thinking that there will be huge style changes will be mistaken. The only really noticeable ones are from disc three to disc four, where Rob's dark style is replaced with Nadir's semi-trippy board stylings once again. Nadir's work is just brighter, and as he replaced Kracken to do the 4th file as well as the 2nd, the game seems to go from light to dark and then light again, which is more noticeable than the other changes. Still, most graphical changes are only noticeable if you are really looking, and if you already know the other artists quite well, or if you are being pedantic. Like me. <br><br>\r\n\r\nThe good thing about ESP is that you won't really be looking at the art because the game doesn't <i>need<\/i> eye candy to pull you in. It helps it a lot, and the game would have been far less fun without the help of the artists, but ESP is the kind of game where you only really notice the art when looking back at it. You're too busy focusing on the task at hand than taking in how pretty the shading is. All three artists have done an amazing job here though, both with graphics and with design. They really add another dimension to the game - one that should not be ignored. <br><br>\r\n\r\nSound is never something I consider very highly in a ZZT game; anything less than a MIDI file isn't enough to be immersive. I sat through it, though. It's used to a very original effect in Chapter Two, with the player having to get into a hall before the music ends (there is good reason for this). Wells went and wrote lyrics for the songs as well. Not really my thing, but a nice touch. I still would have preferred to keep the music off though. It adds very little to the game. <br><br>\r\n\r\n<u>Overall:<\/u>\r\nHad ESP been released in the late nineties, when many people were screaming about Teen Priest, Gem Hunter and, for some unknown reason, SPRG, it wouldn't have got the attention it has now. But now not only is it a brilliant game that I believe surpasses all of the games mentioned above, it also serves as a beacon to all ZZTers. It's as if Wells has stood looking over everyone who plays modern ZZT games and is shouting, 'Look what you can do with a little effort!' Though he'd probably more likely start blithering on about office chairs and hats, mind you. Nevertheless, I'd far prefer 4 or 5 ESP-quality games a year than 100 or 200 piles of crap that get submitted. I'd like to see Wells iron out the problems that I've mentioned here and take a few weeks to make a sort of 'Version 1.1.' If he added one more chapter, it would make the game seem a lot more balanced and perhaps make the ending seem a little less sudden. I'd love it to incorporate the ending in the text file as well, to make the game really non-linear with multiple endings, but we can't have everything. If we did, though, I'd certainly rate this game the joint best game I've ever played. <br><br>\r\n\r\nESP is a game that has been written from the heart, with everyone involved pouring everything they have into its creation. For Wells, it will be his only ZZT game, for Funk and the rest of the artists, probably the last non-ZZTV art they will ever draw (though don't hold me to that). You can see every board was planned, designed and drawn exactly the way it was intended, and the beta testing is simply amazing - Terryn's review mentioned only two typing errors in the entire game; I only found one. It's a very polished game that wasn't rushed or made to please anyone but the people that worked on it, and it's easily one of the best ZZT games ever made. Don't let this go unplayed; it's too good to be ignored. They just don't make them like this anymore. <br><br>\r\n\r\nESP is for:<br> \r\n+ Adventure gamers who enjoy any point-and click-adventures and games like <a href=\"http:\/\/zzt.the-underdogs.org\/?p=database&title=Kudzu\">\"Kudzu\"<\/a> and <a href=\"http:\/\/zzt.the-underdogs.org\/?p=database&title=p0p\">\"p0p.\"<\/a><br>\r\n+ People who like games to be varied, but also enjoy the choice of whether or not to do sequences they may find difficult. <br>\r\n+ Anyone with a good sense of humour. <br>\r\n+ People who like Inventory games but usually find them too difficult or aimless to play. <br><br>\r\n\r\nESP is not for: <br>\r\n+ People who don't want to spend at least 90 minutes playing a ZZT game. <br>\r\n+ People who can't stand having to read huge amounts of text and dialogue boxes. <br>\r\n+ Those who want non-stop action and RPG battles. <br><br>\r\n\r\n<b>96%<\/b> - The second highest score I've ever given a ZZT game! <br><br>\r\n\r\n[1] You can read the rest of the games story (And a LOT more) in the games text file. <br>\r\n[2] Though bear in mind that I'm Fishfood, and I am bad at everything, including inventory games. I also played the last two discs through again in order to try some of the optional things mentioned in the text file and to experience both chapters. <br>\r\n[3] I did, though. After all, I am trying to write a review. But the fact is you CAN get rid of them. <br>\r\n[4] Not that I actually care about ASCII of course, that would be lame. (cough)","description":"ESP is a massive four-file masterpiece that every ZZTer should play!"}, {"id":"8","gamefile":"burgerj.zip","reviewer":"Commodore","email":"jddgames@yahoo.com","review":"In Burger Joint, you play Johnny, a sixteen-year-old kid who finds a job in a fast food restaurant. But this is no ordinary restaurant; it's BJ's Fast Food Restaurant, the very first fast food ever. Set in the 50's, Burger Joint captures the atmosphere of the era without even leaving the restaurant. The music, some taken from Grease, some from 50's bands, is scattered all throughout the game and succeeds in signaling events, creating a mood, and by playing music for different characters; it further develops the characters and story. There's no lack of music, either. Madguy has been known for good music over his career. and this game may well be the capstone. <br><br>\r\n\r\nBurger Joint takes place entirely within the restaurant. Even the title screen is a picture of the restaurant. Gameplay varies, involving doing things asked of you, which is not that hard, or improvising ways of solving problems that occur either to the people or the machines of the restaurant. The problems themselves merely involve touching objects, but the relationship objects have to each other and patrons of the restaurant must be remembered in order to solve a particular puzzle. Actions must also be performed within a certain time limit, such as cleaning the place up before the first customer arrives. <br><br>\r\n\r\nGraphics are hard to judge with only one scene to work with, but for this game, all you need in terms of graphics are visuals that aren't ugly and objects that can easily be identified. The colours chosen work well, and nothing is visually distracting, which means you can concentrate on having fun. <br><br>\r\n\r\nThe writing is one of the game's strongest points. The characters are well developed and the humour draws not from random jokes, but character driven narrative. Interactions between strong figures in the story allow for jokes that don't seem \"out of the blue\". The actual story is secondary to the way the characters interact. Sure there is a beginning, a climax, and a conclusion, but what's more important is that your character survived the day. When you feel like you want a little smiling ASCII character to succeed in life you're either a loser, or you're playing a really good game. <br><br>\r\n\r\nWhilst your time while playing the game is sometimes spent frantically touching everything possible, the humour, story, and your curiosity to see what will happen next, will make you play this game from beginning to end. As far as replay value goes, the humour is the only thing that would make you come back to it; still, it's one of those games you download and add to your permanent collection.","description":"Set in the 50's, you play Johnny, a teenager looking to make some quick cash. What better place to do it than in the very first fast food restaurant ever? Just look out for the freezer bears... \r\n"}, {"id":"9","gamefile":"kudzu21.zip","reviewer":"Nadir","email":"nadir427@hotmail.com","review":"An odd one to review, this. As the observant among you may have noticed, there's two versions of Kudzu available on z2. Despite their terming as v1 and v2, they're not sequels- but the second offers more closure as to the plot behind what seems, at first, to be a bold but confusing mixture of images and often intriguing words. The first version was made by Cly5m shortly before a two-year long visit to Estonia in 1998 (missionary work, if I recall correctly), and the second was made shortly after his return; after which he wandered off somewhere or other. <br><br>\r\n\r\nBut what of the plot, I hear you cry! Well, it would be a disservice to give too much away as half the fun is finding out. After a parachute jump, you land off-course atop a mysterious red building. You don't know where you are, but you reason that there must be a telephone somewhere around, so you go in search of one, only to find the building and its environs inhabited by living water, possessed vases and battling holograms; and then there's the small matter of that rampart structure made out of multicoloured stone and what look to be intestines... <br><br>\r\n\r\nThe graphics in this game are, in my opinion, its selling point. Or it would be if this stuff were to be actually bought and sold with money. Cly5m uses the same bold, geometric graphic and colour technique used in his previous games (Crunchy and Turmoil), creating a world filled with angular, cuboidal buildings and deceptively simple shading that add to its dreamlike structure and general atmosphere. The gameplay is not that of your typical ZZT game (run, shoot, RPG battle, cinema, shoot, cinema etc.), instead placing emphasis almost entirely upon looking around- what action there is is over quickly, or involves the player torturing small animals (the game allows you to kill or break much of your surroundings). This type of 'touch and observe' gameplay went on to influence games such as *p0p*, Bizanloo, Edible Vomit and Winter, either directly or no- as did the idea of the imaginary world as a whole. The influence upon future games is important! <br><br>\r\n\r\nDo I recommend it? Most certainly, you lugubrious-eyed ragamuffin, so full of sorrow and innocence! But if you want the full feel to it, you should download both and play the first version through, wait a short while and then play the second one- this will go some way to recalling the sheer \"wtf\" factor of the first time around and its abrupt ending, followed by a full explanation the second time around. <br><br>\r\n\r\nGo forth and play Kudzu, you stupids =( <br><br>\r\n\r\n-- <br><br>\r\n\r\nthis reveiw was writed by nadar doant steal or els","description":"Atmosphere is this game's specialty.  Go forth and play Kudzu!"}, {"id":"11","gamefile":"run-on2.zip","reviewer":"Flaming O","email":"okcomputer135@aol.com","review":"With most games today, after playing it long enough, there will be nothing new to extract from it. You'll find all the secret items and characters, find the hidden levels, and know where everything is located at. Yet a noteworthy exception is Wil's Run-On. <br><br>\r\n\r\nIf you started the game as an embryo in the womb, you'd still be playing a different game at the Pearly Gates. Wil accomplishes this almost god-like feat by using complete randomness. And to skip doing an entire section on the beneficial (yet sometimes overrated) replay value, I'm going to give you number crunchers a little equation: Randomness = Infinite replay value. Terrain is randomly generated as you progress through levels, which means you have to clear forest, shoot breakables, and run to the other side of the screen. It's like putting your CD player on random; you know what you're going to get, but the order it will come in will play itself out through the progression of the game. <br><br>\r\n\r\nBut what's the running for? Well, the answer is this: evil. Your character, upon an abrupt revelation, is being pursued by evil and must constantly outrun it by running in specified directions, yet after a length of time, you will be \"pulled\" in the opposite direction, simulating the evil catching up with the player. You have to hustle, for the only alternative is death. Along with evil, you have an array of enemies, either pre-programmed or amusingly original, such as lions, tigers, bears, newbies, a drunk, cactuses, and an insane taxi driver. You have to be quick with your gun to ward off these adversities. <br><br>\r\n\r\nWil also puts the player through a string of contrasting lands and worlds. They range from a shoot-and-run, to a side-scroller, to a flag based board. Wil takes the random duengon concept, and builds on it further, with delightful results. You'll find your attempt to escape from pursuit will take you to a pub, the clouds, a multicolored realm, and more. The worlds are brightly portrayed in Wil's bold graphics. His use of the ZZT colors has the ability to evoke even the grittyness of an alleyway or the sun beating down on you in the desert. In fact, part of the fun in Run-On is seeing what strange location you will enter next and what you are expected to accomplish to exit it. The 15 different locations to pass through makes the entertainment value of the game top notch. <br><br>\r\n\r\nThe ending of the game is rather open ended, yet this is a benefit of the game. For it is not the destination that matters, but the journey. The ending is not as much of a conclusion to the plot as it is a revelation. The ending places a very familar image in relation to the game, and the comparison of the two subjects is very deep. It is much more powerful than a clear, ironed out resolution, it compells the player to sit there, staring at the screen, and think it over for a few seconds, for me a few minutes. And in a age of gaming where constant action is repititious and attention spans are at a low for some, these few moments are golden. <br><br>\r\n\r\nFor some icing on this ascii cake, the game also contains a mini game by Kkarios, DGN Ultimate, which is also randomly generated. But \"mini\" is hardly the word to describe it. With 100 levels total, expect this game to supply an additional hour of enjoyment. <br><br>\r\n\r\nYou'd be missing out on a lot of what makes a great ZZT game magnificent if you do not download Run-On. But I have some basic instructions for you to avoid that: download Run-On, press \"P\", play, repeat. You can thank youself later for it.","description":"A random, chaotic adventure in a random, chaotic world.  Delightfully evil fun!"}, {"id":"10","gamefile":"warlock.zip","reviewer":"Commodore","email":"jddgames@yahoo.com","review":"Imagine a game with epic scope contained within one castle. Imagine a game where your character's heroic qualities are undermined by other characters' single-minded determination. Add a plot with wonderful twists, and gameplay that never gets boring and you've got Warlock Domain. Alan Chan's first published game shows that he knows what's up in ZZT. Warlock Domain features all the aspects of a game made by a veteran ZZTer with a touch of rookie flavour. It's also a prequel of sorts to Alan's sadly unfinished Htrae saga, which is highlighted in a short but glorious demo: Htrae I : The Crimson Omen. <br><br>\r\n\r\nYou start the game with basic adventurer knowledge: Princess Daisy was kidnapped by the Warlock Daimon, all rescue attempts have failed. If Daimon marries the princess, he will take over the kingdom. You can't let this happen. With that you begin in front of Castle Shadow, Daimon's lair. Alan's subtle humour is apparent from the start as you try and talk your way past skeleton guard guarding the gate. This humour is what allows the game to flow so well. Jokes don't feel like they're jammed in to force a laugh, rather they are used purposely to develop the characters better. <br><br>\r\n\r\nAs soon as you enter the castle you've got loads to do. A lot of the castle is open for you to walk through and explore. Each room is vastly varied and there isn't any space wasted. Puzzles present themselves immediately but the answers are not available right away. In some cases it's a \"find the right item\" sort of puzzle, this doesn't mean you don't have to think though. The other puzzles are original, fun and never annoying. The security system that guards the chalice, and the stuck switch are good examples. You're always on your toes in this game. Never are you bogged down with the tedious adventure thought process of \"I need this so I can get that to go there and get that to save blah blah blah.\" Instead you've got mostly free reign over a majority of the castle. Can't go that way? That's okay. You've got plenty of other places to explore. <br><br>\r\n\r\nOf course as you explore the castle, you must fight its inhabitants. The game doesn't falter here at all. Almost every fight is varied. There are the skeletons that you shoot with your arrows, the enchanted lions you kill with your sword (rouge-style), one of the bosses you defeat using a magic staff, in the cave there are pre-fab monsters(!), and then of course RPG battles. The RPG battles happen at a quick pace and are intense sometimes. It's a very good system, comparable to the one in Rhygar, and is used very well in the game. Some of the story even develops in the battles. Alan does a good job of switching it up. Combat is never tedious or boring. It happens in brief spurts which keeps the adventure going at a brisk pace. <br><br>\r\n\r\nAlan Chan's artistic abilities are well highlighted in Warlock Domain. While simplistic it shows that a great deal of effort was put in to designing the castle. Still Alan shines through this simplistic facade with some great effects. Daimon's taunting visage at the entrance of the castle, four skeleton guards merging to form Skeletor, the battle with Molloch, and the animations of monsters in the RPG battles all showcase both great drawing combined with great programming. The cutscenes, which don't show up until the end of the game, are few but look great. One of them features great animation as well. <br><br>\r\n\r\nMusic is the game's only weakness. It's not terrible, it actually adds to the game, but you'll probably be running for the \"B\" key when the ending sequence starts up. We hear a few Final Fantasy tunes in there and they help to create a good feeling while also giving a nod to the series. Overall I'd rather have the music there rather than silence. The sound effects prove to be easier for Alan and there are a bunch of nice ones here. <br><br>\r\n\r\nWarlock Domain is my personal favourite ZZT game. It's fun and well written with strong characters and a great story. It's a shame the Haetre games never were completed. But we have Warlock Domain to satisfy our ZZT fantasy needs. If this game leaves you hungry for more sword and sorcery goodness, I suggest Legend of Brandonia.","description":"Pleana, a peaceful kingdom under a gentle ruler with three beautiful daughters. Nothing could possibly go wrong, right? "}, {"id":"12","gamefile":"sivion.zip","reviewer":"Zenith Nadir","email":"nadir427@hotmail.com","review":"Sivion is arguably one of the biggest (size and length wise) ZZT games around. It's an adventure RPG, nearly 360kb in one ZZT file. It has a plot, which is actually slightly superfluous but serves nicely anyway. You are Rook, a nobleman exiled from the town of Gwin; after the death of your father, the mayor, your mother attempted to take over but spent the town's money badly- leading to a revolution leaving her stoned to death and you without a place to call home. However, you soon find yourself in another town, Bespin, and under an assumed identity you settle in a house you share with a friend called Dulcis. All seems well, until one day Aprithian assassins begin to show up around town for reasons unknown, and while running an errand for Jara you discover that Dulcis is not all that he seems to be... <\/br><\/br>For 1995, the graphics in this game are well done- plain by today's standards, but quite sufficent. There isn't much music (apparently the author can write it but doesn't like PC speaker sound much, and who can blame him), but what there is is quite decent; for some reason I especially liked the little beat played at the start of the game during the Mission:Enigma ripoff sequence. To this day it rings true in my mind! Gameplay is a defining factor of the game, too- it actually plays in the classic ZZT game format (ie. pre-programmed enemies, the occasional big boss object shootout), but does it in a distinctly medieval fantasy way (ruffians are assassins, lions are trolls, tigers are demons), and not all the enemies are pre-programmed.<\/br><\/br>Like any true RPG, what makes Sivion interesting is how 90% of the game is made up of side-quests which somehow tie into the bigger picture (ie. do x to get to y, and be rewarded with z). On your travels you'll save a man's fortunes from a malevolent djinn, defeat an evil Chthulu-style cult and steal from a bank vault in order to pay back a loan shark. All good family fun! Pretty much the first third of the game involves trying to get a poisoned needle, for exchange for strawberries from trolls, during which time you traverse mines and magic mazes and solve riddles to achieve what you require. Even after confronting the biggest boss of the game, don't be fooled into thinking you've won; even after this, you must infiltrate a castle, journey across a desert and other such excitements. The sprawling nature of the quests you undertake does lead to a disjointed feel to the game, but it's mostly fun (not included; those goddamned darkened, invisible mazes)- and isn't that the point of a game?<\/br><\/br>The one major downer I have on this game are the regular plugs for the MegaZeux version, which is apparently way cooler than the ZZT version with a more involved plot, better developed characters, more game etc. Don't bother looking for it because it doesn't exist, past a tiny little five screen demo made in MZX v1. So forget that, just be content with what DOES exist. Bottom line; if you can run it, play it- if you can't, go get a new computer you stupid cheapskate.<\/br><\/br>\r\n(ps. for those of you who can't run Fred! 2 due to its being even huger than Sivion, the password is BARNEY. You'll see what I mean.)<\/br><\/br>","description":"Djinnis, chthonic cults, and other sidequests abound in this classic Adventure RPG game!"}, {"id":"13","gamefile":"lst.zip","reviewer":"Commodore","email":"jddgames@yahoo.com","review":"Taking the Boulder Xod idea to the next level and beyond, craNKGod has designed a game that will keep you staring at your monitor until you realise that it is beginning to get light outside. Little Square Things is a extremely in-depth puzzle game that has infinite possibilities so far untapped. In the game you (a demigod deciding their fate) must guide the little square things through perilous traps and sticky situations to their ultimate goal, standing atop a cyan fake. Only until all the fakes are covered at the same time may you continue. Each key press you make affects every little square thing on the board, but not all the square things are created equal. The colour of the square thing decides how it will react to your key stroke. A white one will follow your move precisely whilst a black one will go the opposite of your move. Blue ones don't move unless pushed by other square things, and green ones shift their orientation to the cursor keys randomly. There are plenty of other types as well and each will keep you guessing and trying and swearing.<br><br>Gameplay consists of avoiding having any of the square things destroyed and ultimately getting them all to their goal. In your way are bullets, lava pits, and viruses. Keeping track of all the little square things on the board and what the next move will do to them is a good way to start, but not always the answer. Sometimes you have to race the clock as a bullet slowly ricochets its way around the board towards a helpless little square thing. Cyan square things don't stop moving until they hit an object and can lead to some very panicked situations at times. The tension is always high, and even if after a few tries you've resolved to sit and think for a while, the tension will still be there when you attempt your new approach. It's almost like brain surgery.<br><br>Aside from the original gameplay, the way you progress through the levels is equally original and adds greatly to the amount of times that you can play the game. The levels are represented by a pyramid shaped map on the top left of the screen. Each time you beat a level, you progress further down pyramid. You get a choice of left or right and depending on which, the outcome of the game could be different. This means you only play through 7 of the 28 levels and easily (to lazy to figure out what math to use) over 50 different paths to take through them.<br><br>The game could have ended after the 7 levels and most people would be happy, but craNK adds yet another element, bosses. Here you try and race others demigod to prove that you are the supreme being. The two bosses are tseng and craNKGod himself. Beat them and you have beaten the game, but you still you've got a lot more to do if you want to prove you are the master. Go back and start again!<br><br>Little Square Things is one of the most addictive ZZT game I have played. It you enjoy the game as much as I did, you download the editor and try and create your own levels. You'll find it's not as easy as it might seem proving how much effort craNKGod must have put into this epic puzzle game.","description":"Far from our own reality, little square things strive to reach their only mission in their short life, to cover up the cyan fakes. Decide the fate of their race by guiding them to their goal."}, {"id":"14","gamefile":"winter.zip","reviewer":"Commodore","email":"jddgames@yahoo.com","review":"Myth had an idea, detailed thoroughly in the TXT file, to create a game based solely on atmosphere, with minimal text and no dialogue. The resulting game is like nothing before, or anything since.<br \/><br \/>From the TXT file: '...winter is a game based on atmosphere, instinct and intelligence. In some ways (whether good or bad), winter takes these tenets to an extreme...The result of this is that most puzzles must be figured out through other means -- through sight, sound, and intuition.'<br \/><br \/>Winter could technically be considered a 'trippy' game. However it surpasses the usual weird fare and instead concentrates on creating a complex world that makes sense in its own way. Indeed the world created seems intimidating, but I've yet to find a way to die, and many puzzles can be attempted multiple times without the need to restore and start over. Colours are used with great skill, defining each section of the game brilliantly. Interactions with objects are illustrated rather than described, and several times you need to use auditory clues to solve problems. The three sections that revolve around the Ice Palace can be played in any order, and the final puzzle at the end ties the entire game up wonderfully.<br \/><br \/>The story is minimal, and appropriately so. You're in school, you start to day dream, and you find yourself standing in front of a large palace. Your goal, as stated, is to 'delve deeper', however you soon find your task revolves around recovering three purple keys which you obtain after the completion of each area. Immediately the palace confuses you. Soon however, its inner working become clear and understandable. Understanding the palace soon gives you access to the different worlds, and the journey continues. The three worlds, as titled in the editor are: The Underground Forest, The Night Mesa, and The Mechanical Caverns.<br \/><br \/>Each section seems meticulously planned out, with a wide variety of puzzles that never makes you think the same way twice. The forest has a variety of key puzzles combined with a puzzle that utilises board linking. The caverns has a new twist on the standard teleporter puzzle and a need logic puzzle. The mesa has a well designed (and tough!) bomb puzzle. Also, in the palace, is a nice, albeit easy, slider puzzle that involves touching an object that shifts the orientation of the sliders.<br \/><br \/>Without much of a story, you could say that this is a puzzle game that keeps you playing though atmosphere rather than plot development. The rather ambiguous ending is expected and leaves you cringing for a sequel, however I don't think a sequel was ever planned. The idea that the main character has even more of this insanity left to figure out though, makes it seem like the world created is endless, rather than contained to the palace and its domains. Being thick in atmosphere is one thing, another is to keep it varied. Winter does this well. It's as thematically varied as A Dwarvish Mead Dream and keeps the same fresh pace without long sections of fighting. And of course the music is excellent, as it should be. A game like this with poor or no music would just not have the same effect.<br \/><br \/>Winter is a great game for puzzle fans of all types. Only a few puzzles are daunting and all of them are original in some way. There are small puzzles, and large, multiple board puzzles. Even with the amount of puzzles in the game, there is still a great feeling of exploration and discovery, something that lacks in a lot of puzzle oriented games. Overall a masterpiece of originality that should be played by anyone looking to see how atmosphere can be achieved in ZZT.<br \/><br \/>If you enjoy Winter, I suggest playing myth's 24hozzt game, Nightplanet.","description":"School's rather boring to-day. Drift off into a lucid dream world and explore the depths of your subconscious. "}, {"id":"15","gamefile":"knight.zip","reviewer":"Zenith Nadir","email":"nadir427@hotmail.com","review":"So you're looking for something a bit different? You found Chrono Wars too wordy, Rhygar too serious, Burger Joint too short, Gem Hunter SE too pedantic? If so, you're a moron because those games are all great. But even so, you could do worse than take a look at Ned the Knight. In this game, you play the titular Ned, who begins the game as a knight-in-training living in the year 1000AD. After receiving a message from the king, you learn that you must undertake three tasks in order to become a fully-fledged Knight- you must retrieve a lost royal ring from the castle sewers, find and unlock a hidden room, and slay a dragon. A simple enough premise, perhaps- but it's just the start to a whole lot of trouble, and an adventure filled with odd bipedal little reptiles called goobers.<br \/><br \/>Although the game is set with a definite level layout (ie. complete a certain task to move onto another, repeat as necessary), its geography is all interlinking and backwardly accessible- that is, the castle leads out to the town, outside the town is the forest, the forest leads to a cave through which there is a beach and arena, and so on. But I'm getting ahead of myself, and I'm giving away things you probably should discover on your own so I'll speak of specifics. The graphics in this game are a treat- they're simple but bold and atmospheric, and give a definite cartoony feel to the game, although the first few boards feel somewhat basic. Wherever you are, be it a town, a forest or mountains, you really do feel convinced by the graphics- they have a unique charm unmatched in any ZZT game before or since (except maybe *p0p*). Special mention must go to the big bosses you'll encounter- although ZZT's limitations stop them from moving around, they are all animated in such a way you feel they're somehow more than a couple of objects tied to solids and a few invisible walls throwing stars at you. Extra special mention goes to Zlabfrinz the Goober King, the last boss in the game and an amazing piece of programming.<br \/><br \/>Speaking of whom, the one negative point I have regarding this game is that final puzzle where you have to beat the goobers in a certain order. IT IS IMPOSSIBLE. Well, no, I managed it once, but that was a long, long time ago. And that board gives you a runtime error! Other than that mishap, the gameplay is diverse and engaging- mostly it involves shooting arrows or hitting stuff with your sword, or beating memory puzzles and finding secrets and items\/advice needed to continue onwards. All very simple, usual RPG kinda things, but again, done in an entertaining, well-humoured manner.<br \/><br \/>The music in this game is noteworthy, too. As well as incidental music, when each board is first visited a little bit of background music will play as way of introduction. This is probably the nearest ZZT will ever get to background music, and it's strangely effective. The actual music is pretty listenable, so I'd keep your speaker sound on for this one. Although the theme for the Snake family gets really, really annoying after the fifth time.<br \/><br \/>In conclusion; Ned the Knight is for super dudes, I can't really do it justice in words. And if you're interested, there's a sequel, Bernard the Bard, in MegaZeux! Which is worth playing if only for the inclusion of Ned flexing his muscles and looking all vikingy.","description":"Join Ned in his quest to become a royal knight and save the kingdom from goobers and ruffians."}, {"id":"16","gamefile":"brandon1.zip","reviewer":"Commodore","email":"jddgames@yahoo.com","review":"Few of the older ZZT games can compare to the detail and scope of more modern ones. Yet even without STK, Ryan Riegel's Legend of Brandonia is an excellent adventure game with a great story that takes you to all sorts of weird and excellent places.<br \/><br \/>You play Alex, a knight of Brandonia, serving under King Brandon. You start out just after escorting the king to the castle, returing from a mission. You get to wander the castle and talk to your wife, and it's not long before you learn about the contest.<br \/><br \/>Every forty years, the dragon lays its eggs. When this happens a race is held in Brandonia to be the first one back with an undamaged egg. Alex decides to join the race, but before the race begins, Alex learns about his father's death. He goes to investigate and discovers that a man named Acro stole Alex's father's teleportation device. Acro plans to use the device to win the race. Alex tries to tell the king, but the race begins and Acro is long gone. So the adventure begins...<br \/><br \/>Legend of Brandonia is a long game, 256k, that is actually the first part of a game that was never finished. The game play is typical, shooting at enemies, but rarely gets tedious. All of the enemies are objects, no prefab lions and tigers. There are puzzles, but nothing daunting. All around, Legend of Brandonia is a fairly easy game. There are a few difficult spots, like the cave and the fight on the dock, but in general the challenge is moderate. The programming is quite tight, with good use of zap\/restore, allowing characters to progress different parts of the story at different times, and some good effects including a ship coming into port.<br \/><br \/>The only music in the game is on the title, but it is excellent.<sup>1<\/sup> Throughout the game there are short chimes and sounds to mark when something has been done and some of the sounds come directly from ZZT, like the unlocking a door sound effect.<br \/><br \/>Legend of Brandonia is an epic game with a well written story that will keep you playing to the end. It's a shame Ryan Riegel never stayed around to do the second part, it would have been brilliant. Still this game stands well on its own, and should be played, along with Warlock Domain, by anyone even considering doing a fantasy game in ZZT. It's simply a classic piece of top notch ZZTing.<br \/><hr><br \/>\r\n<sup>1<\/sup> Taken from Gregory Janson's <i>Music Box<\/i>.<br \/>","description":"Help Sir Alex of Brandonia save the eggs of the dragon from the evil Acro."}, {"id":"17","gamefile":"lebensrm.zip","reviewer":"Homz","email":"sherlock_homz@hotmail.com","review":"It is likely that most of us have played or at least seen that historic and wonderously bloody game Wolfenstein 3D, in which you navigate around a Nazi castle trying to escape, but MOST IMPORTANTLY OF ALL, blasting the bloody living daylights out of those unfortunate officers who should chance to meet up with you. Inspired by this, Zenith Nadir went on to create the classic ZZT action game, Lebensraum.<br \/><br \/>Lebensraum is responsible for inspiring and influencing the next generation of ZZT action shooters, bringing us such classics as <a href=\"http:\/\/zzt.the-underdogs.org\/?p=database&search=i3.zip\">Infestation 3<\/a>, etc. In Lebensraum, you play Jim Cowvitz, a hard man of action who has been sent into the fortress of Lebensraum to discover the Nazis' plans, helping to speed up the end of World War II, which has dragged on for too long. Naturally, as with all hard men of action, you get captured shortly after getting to the bottom of it all, and take up residence in a POW camp. Naturally, as with all hard men of action, you manage to get your hands on a particularly sharp piece of rock, with which you take out the guard and steal his gun. Heh heh. Time to kick some Nazi butt.<br \/><br \/>What makes Lebensraum special is that when Zenith decided to make an action Wolfenstein style game, he didn't just make a bunch of crappy objects and paste it together with nice art. The work he has done on this game is very obvious, as it literally oozes with quality. Let's take a look at some of the features that Lesbensraum pioneered:<br \/><br \/>As you start the game, you are given a choice between four different difficulty levels. No, those were not put there just to look nice, there is a noticeable change in the ease of play. For instance, when you start the game on its easiest level, then open the door, you find two SA guards and some health. When playing on the hardest difficulty level, you will find no less than five guards waiting for you, and no first aid kits. Which brings us to another unique point. In a dose of realism, you cannot see the contents of a room, or what lies beyond a corner, until you go in, whereat you will find death, life, or an assortment of the two. The guards, captains, and officers are all sophisticated as necessary in their AI, ranging from dispatched with easily to mildly amusing to aggravatingly difficult. And the dogs will give you nightmares for the next few nights to come. Of course, you won't have limitless health and ammunition. The maximum amount of ammo is 99, health 100, so it is necessary to strategize. However, your health is easy to watch through the fact that on the bottom of every screen is a status bar displaying your condition, be it 100%, Good, or Poor.<br \/><br \/>All these innovative elements combine to form Lebensraum, the fun and definitive ZZT action game, with loads of replayability. This is a game that deserves to be played and studied before you attempt to make a game of this genre, and I highly recommend it to all aspiring game authors.","description":"Zenith Nadir's famous <i>Wolfenstein 3D<\/i> tribute, forerunner of several other ZZT action games."}, {"id":"18","gamefile":"bananaq.zip","reviewer":"Homz","email":"sherlock_homz@hotmail.com","review":"After two months of doubtless very hard work, WiL, a relatively unknown ZZTer at the time, released Banana Quest. He later became one of the most acclaimed game authors of all time, ranked highly in countless 24hozzts, ranked bottom-most in others, became known as the greatest musician ever to grace ZZT, and, during his best years, produced some of the finest games to be found, including Run-On, The Rose, and Largo Abraxis, among others. Among all these games, though, Banana Quest is my very favorite, and is, I think, my favorite ZZT game ever made.<BR \/><BR \/>\r\n\r\nPerhaps it's the rather whimsical insanity, perhaps the sheer fun and novelty value, perhaps the clever cheerfulness and hopelessly optimistic attitude which could only come from a time long passed over by the commune. Perhaps it's the theme song, or, even, the fact that, beside the original ZZT games and Code Red, it's one of the very first ZZT games I ever played, those few years ago when I first discovered ZZT and Z2.<BR \/><BR \/>\r\n\r\nBut that's quite enough sentimental meandering. What reason have _I_ to play this game, you ask, and so shall your question be answered!<BR \/><BR \/>\r\n\r\nBanana Quest concerns the adventures of our hero, Bov Boy (seriously, don't ask), who resides peacefully on a quiet, lush, tropical island, until the mysterious scalawag MR. SCRUTHERS kidnaps his girlfriend, Chelsea, and trundles off to The Hills. Obviously, he realizes, he must pursue them quickly, making chase with the motorboat conveniently located on the island. But, alas, things will not be so easy, for he discovers that the MAN WITH THE HAND HELD MONKEY IS BLOCKING HIS WAY, and will not pass until the monkey is appeased with a set number of bananas. So our hero gets to the task, fighting against the odds, sweeping the Mayor's kitchen, staring down potatoes, and diving deep into the reaches of the Bigg Mitt to retrieve the Mystical Red Banana before he finally meets up with Mr. Scruthers in the climatic ending.<BR \/><BR \/>\r\n\r\nThe game is considerably boosted by WiL's strong yet deceptively simple graphics style, which completely complements the game, remaining consistently fantastic, and providing suitably insane visuals for the Man With the Hand-Held Monkey and Banana Isle, while still leaving room for the menace seen in Mr. Scruther's eyes. The music of course, is classic WiL, and exudes charm and warmth, adding to the overall ambience of the game.<BR \/><BR \/>\r\n\r\nIn terms of gameplay, the game is fantastic, and bears certain traits of the item-hunting genre tseng invented with his Gem Hunter games without ever seeming unoriginal or copied. It is extremely varying and fresh, never seeming repetitive or tiring. Overall, I personally found the game pretty hard (particularly the avocado transmogrifier engine, which I was stuck at for something close to a year, but merely requires a bit of common sense and persistence to complete), and once you get into the second file, there are some sticky parts which can make the game unwinnable and force you to enter your password in again and start that section over, but, besides one other slight programming error in the password entry (which shouldn't affect you unless you end the first file with a yellow banana still in your possession) which, from ZZT's editor, is easily fixed anyways, the gameplay is nearly flawless fun. On top of this, there's a clever little Sierra-style score system which adds an extra challenge, providing one point each for touching objects, talking to people, or performing tasks that are unnecessary to complete the game.<BR \/><BR \/>\r\n\r\nBanana Quest is a fun, fantastic game that has rarely been rivaled in gameplay value and it leaves me with almost a sense of regret to have finally finished this charming gem. This is an often passed over, yet excellent ZZT game that you should definitely not miss the chance to play.<BR \/><BR \/>","description":"It all started with a banana.\r\nA banana, and a man with a hand-held monkey.\r\nAnd, arguably, the greatest ZZT soundtrack _EVER_."}, {"id":"19","gamefile":"dm-galry.zip","reviewer":"Commodore","email":"jddgames@yahoo.com","review":"Dungeon Master Gallery could easily be the benchmark for dungeon crawl games in ZZT. The story is purposely vague, and appropriately, the game is very linear, with each board comprising a floor of the level, and all the levels descending and increasing in difficulty.<BR \/><BR \/>\r\n\r\nThe game uses arrows(shooting) as your mode of dispatching foes, and being conservative with your shots is a must, especially if you plan on beating the last boss, who is difficult and well programmed, disappearing and ambushing you for different directions. Most enemies will only take a shot to kill, but some tougher, \"unique\" monsters will present themselves. Each level is dark, and requires torches, which are found around on the walls. All the items can be bought from the treasure you loot. Buying items is required, but in general, most of your ammo and torch needs will be met by scrounging the dungeon, provided you work quickly and conserve. There are some pre-programmed enemies, but only STK variations of ruffians, the smartest of the built-ins, so they will keep you on your toes.<BR \/><BR \/>\r\n\r\nThe levels are varied and there are a number of characters that will help you on your way, sell you things, and generally add colour to the game. Figuring out how these characters work might not happen your first time through, providing an ample excuse to replay the game. There are plenty of interactive objects and some side quests, and nearly everything that looks touchable is.<BR \/><BR \/>\r\n\r\nGraphically the game looks good, with a variety of styles not limited to the standard look of \"3D\" walls, and each new area is soaked in atmosphere, appropriate monsters, and interesting little bits of side story to keep things interesting. The final areas is where this is most apparent. The title screen is pretty as well.<BR \/><BR \/>\r\n\r\nDo you dare? Does the darkness call you? It'd better, especially to those with an interest in making any sort of dungeon game. The surface simplicity combined with hidden complexity makes this a game to slice apart and discover what makes it tick. If you enjoy slogging through blood, battling past evil monsters, and generally kicking ass as the all important, totally generic hero, this is the game for you.<BR \/><BR \/>\r\n\r\nWant more gore? More dungeon crawl action? Try one of Testa's other masterpieces, Asmodeus.\r\n","description":"Delve into darkness and pitch battle against fierce monsters and evil denizens to prove your worth as a hero."}, {"id":"20","gamefile":"Aura.zip","reviewer":"MadTom","email":"madtom@gmail.com","review":"<I>NOTE: In the absence of other exhaustive reviews of Aura, MadTom's review has here been substituted. An original review for this landmark game would be most welcome.<\/I><BR \/><BR \/>\r\n\r\nAura is the second major release of Dr. Dos', and depending on your perspective on community games like Mooseka Richtlinen mit einer Eisenfaust, may be remembered as his best. It is an action\/strategy game hybrid with influences from eastern philosophy, Ikaruga, and of course, ADOM.<BR \/><BR \/>\r\n\r\nIn an alternate plane where every being, except of course karmics such as yourself, has an aura of either blue, green, or red, imbalance has occurred and the aurae are struggling against one another. You're out to change all that, even if it means destroying everything in the universe. Dr. Dos refers to these as the 'extinction' endings, comprising three of seven possible conclusions to the game (not counting death), one of the games' most recommending features.<BR \/><BR \/>\r\n\r\nOr perhaps you'd just like to have one aura dominate, and then face the boss of that particular aura and lay down some good ol' fashioned karmic whoop-ass, using your unique ability to change aurae to meet that of your opponents. And you're going to be doing that a lot.<BR \/><BR \/>\r\n\r\nSo you run around changing your aura as you meet your opponents. It sounds simple enough, but the levels ascend in difficulty reasonably evenly, and there are one or two that took me four or five save\/die\/restore attempts to complete. Others are a cakewalk, however. The enemies vary in strength and intelligence, while each aura maintains its own distinct characteristics (red creatures won't even move toward you much if at all, but they hurt a lot if you do contact them - but the blue ones are the true nasties).<BR \/><BR \/>\r\n\r\nOne problem with the game is that at points it can get tedious. I would have been interested had Dos included some slightly less action-oriented puzzles - buttons that change the aura of opponents, or open gates, or using objects, or similar linear puzzles, in the vein of the development that craNKGod introduced into Little Square Things. That would have been neat. Some music or sound for the game would also have been nice (said MadTom, who was asked to do just that).<BR \/><BR \/>\r\n\r\nGraphics are one of Dos' self-confessed weaknesses, but what the game lacks in an aesthetic sense is made up for in reasonably in-depth level design and a somewhat addictive, though appropriately simple, premise. I can't, for reasons obvious, comment on the title screen and menu.<BR \/><BR \/>\r\n\r\nAura is not an easy game. You are not going to beat it, regardless of your choice of ending, without saving\/dying\/restoring at least a few times. There are several tricks and traps, some obvious and predictable, others quite nasty. You are likely to learn a few strategies ... which aura is best for the very first steps of each level?<BR \/><BR \/>\r\n\r\nThe Ultimate Karmic God ending in particular is reasonably (but not incredibly) difficult to get. The only advice I will offer you is to have a good stockpile of health. Actually, that applies to just about every level of the game ... good thing health bonuses are reasonably abundant.<BR \/><BR \/>\r\n\r\nAll in all, the game is one of the best uploads to the site this year, appropriately also being the very last one uploaded. Dr. Dos' skill as a ZZTer puts him easily within the range of Quantum P., Commodore, and other present-day whizkids of the ZZTing scene, and I'm very much looking forward to his next release.<BR \/><BR \/>\r\n\r\nGood job, Dos!","description":"A test of wits and speed, <I>Aura<\/I> is an instant classic of the modern ZZT scene."}, {"id":"21","gamefile":"frost1.zip","reviewer":"MadTom","email":"madtom@gmail.com","review":"This particular Featured Game will not come as much of a surprise to anyone active in the community. The game marking the return of ZZTing legend Zenith Nadir to full-game ZZTing after a hiatus of three years, <I>Frost 1; Power<\/I>, is an astonishing powerhouse of a cinema game that will be a lasting testament to his perhaps unequalled skill.<BR \/><BR \/>\r\n\r\nThe action of this first part of <I>Frost<\/I>, after a short and spooky teaser in the Xal Highlands, takes place on the planet Ilititoa. We join our heroine Penny Sha?well in a Gian highschool, reading <I>Speeduck<\/I> and about to begin her swordplay lessons; all is therefore well in the world of anthropomorphic bushy-tailed canids. Later that afternoon, however, an unfortunate mishap involving unintentionally blasting the living shit out of a school bully means she is forced to undergo the decidedly unpleasant punishment of exile from her homeland, so she makes her way South to Alsace, leaving her friends, parents, and younger brother Mist behind.<BR \/><BR \/>\r\n\r\nEquipped with her mother's sword, for which competence is now so necessary, and slaying such dreaded foes as polliwogs and bloodflies, Penny is forced to make a detour to a haunted swamp. There, she meets ... or rather gets her ass saved by ... the mysterious swamp witch Henna Sullrune, student of the late Silver Blood, with whom she continues her journey ...<BR \/><BR \/>\r\n\r\nAs the screenshots shown here imply, the main strength of this cinema game is its graphics, in my mind pretty much unprecedented in a full game. Zenith's graphical competence was always improving (compare, for example, subsequent versions of Chickenwire), but he's in his element, here. The characters and the setting (forest and swamp) are drawn with meticulous attention to details such as weather, with Zenith's trademark skylines permeating throughout. The mood of the game is well set by its graphics, and the whole thing is actually complete eye candy.<BR \/><BR \/>\r\n\r\nThe gameplay involved here is nothing fantastically original, but it works; there's a nice sword-practice engine at the start, and the rest of the game is either fight or flight from the numerous foes who seem rather hellbent on being a serious impediment to Penny's journey. The writing itself is detailed (and rather lengthy, but fortunately interesting enough to keep the player reading) and clever, with occasional authorial interjections such as \"I AM CONSUMED WITH MISPLACED GUILT\", which have received mixed reactions from reviewers; personally, I rather like them. They prevent the game from getting too melancholy, too soon, which is a risk it could otherwise have seriously run.<BR \/><BR \/>\r\n\r\nThe music, unfortunately, sucks.<BR \/><BR \/>\r\n\r\nThose of you interested in ancient history (see <A HREF=\"http:\/\/zzt.the-underdogs.org\/?p=database&search=ultraw.zip\">Ultra Whack<\/A>, for example) will be well aware that the development of the world and the characters in Frost has been going on for a long time, resulting in what seems a very cohesive and well-planned setting. Granted, that makes for a lot of \"exposition\" (word borrowed from John W. Wells), but with purdy art and dialogue and the occasional quip, that isn't really so bad.<BR \/><BR \/>\r\n\r\nFrost 1; Power is a new entry on my list of favourite ZZT games (yes, I do keep a written list), and I would definitely recommend it for download. The next few games in this series are to be looked forward to!<BR \/><BR \/>\r\n\r\n<I>This review is nominally adapted from MadTom's original MTP review, which can be found <\/I><A HREF=\"http:\/\/zzt.the-underdogs.org\/mtp\/awards\/august03.html\">here<\/A>.<BR \/><BR \/>","description":"Mmmmrrr...feeling really yiffy again. I had to paw-off so many times today it wasn't funny! I hate my icky human self. I want to be a real hermy little foxie, so I can be yiffed in my tailhole all day long..oooooh, mrrf."}, {"id":"22","gamefile":"mooserulz.zip","reviewer":"MadTom","email":"madtom@gmail.com","review":"The community has Z2 owner Dr. Dos to thank for the latest addition to the popular cameo-game stockpile, <A HREF=\"http:\/\/zzt.the-underdogs.org\/?p=database&search=mooserulz.zip\">Mooseka Richtlinien mit einer Eisenfaust<\/A> (or, <I>Mooseka Rules with an Iron Fist<\/I>). A cinematically-inclined comedy using Zaphod`, aka Deathwinter, the Mooseka Z2 administration, and the Weekend of ZZT as its bases, <I>MRWAIF<\/I> is a very well-written, lighthearted, well-drawn <strike>by Nadir<\/strike> comedy that has hooked some rave reviews on Z2 and given Dos his much-deserved place in the limelight.<BR \/><BR \/>\r\n\r\nAs Zaphod`, while chatting to Dr. Dos one day over AIM in a stained shirt, the shredded remains of your will to live are burnt to ashes as you are informed that your worst enemy, Mooseka, is now the unquestioned head administrator of Z2. The naturally following anxiety attack, marked by a conveniently transcribed panicky scream ... \"haaaaaaaaaaaaa\" ... causes you to black out. Thus begins a haze of suicidal activity with the expected GODEDRP clich?s of his daddy's shotgun and a family pack of aspirin, to the background music of <A HREF=\"http:\/\/www.nin.com\/\">Nine Inch Nails'<\/A> <i>Hurt<\/I>.<BR \/><BR \/>\r\n\r\nUpon awakening near the Wikkit gate in a platform detached from time and space, and exploring a bit, the discovery of a quarter on the ground prompts a bizarre discrepancy between the laws of Newton and Murphy, and you begin a gravitational tailspin into another area of the plane, whereupon you meet other banned members of Z2. Apparently, your having fallen from the sky fulfills a prophecy that they shall successfully overthrow Mooseka and have Z2 destroyed ... with your assistance, of course. Discovering your ability to turn invisible by grinning like a Cheshire cat lends some hope to the expedition, and after a brief meeting, and an unfortunate accident involving Boxtop and a bushy-tailed canid, you and your new friends set out for Z2 to stop the Weekend of ZZT in its tracks and expose Mooseka for the malevolent, destructive dictator he is.<BR \/><BR \/>\r\n\r\nThe thing that stands out most in <I>MRWAIF<\/I> is the strength of Dr. Dos' writing. Reliant as it may be on the derision of community members (most of whom, Zaphod` included, apparently played the game and loved it), it is in places very, very funny and creative. We're not talking just a set of quotes pasted around a banal adventure, though; Dos has made a reasonably elaborate plot for his characters to follow. Most of the humour is in one-liner or slapstick forms rather than in long, elaborate jokes, which engages the player's interest effectively. A community member not familiar with the various catchphrases and furry tendencies of some of the characters would not get as much out of the game as a long-standing community member, but the game is fortunately not <i>over<\/i>-reliant on inside jokes, and even newcomers should find it an entertaining cinema game. My favourite scene is probably a tie between the invasion of the Z2 building, and Knightt's death scene.<BR \/><BR \/>\r\n\r\nThe artwork is not Dr. Dos', but was commissioned from Zenith Nadir. Unfortunately, Zenith never got around to actually finishing the artwork, and as a result there are some glaring bare boards with Dos' text instructions as to what is supposed to be drawn. It is a shame that Dos didn't have a go at his own graphical work, but it turned out all right in the end; what Zenith has submitted is, as is to be expected, very good and fitting with the tenor of the game - I personally find the way he draws Zaphod`, with the understanded facial features, hilarious.<BR \/><BR \/>\r\n\r\nA cameo game like this one strikes me as much more creative than, for example, classic cameo romps like <I>Sim #darkdigital<\/I>, and I think it's a step in the right direction for an increasingly tight-knit community in which everyone seems to know everyone else. It would be easy to dismiss <I>MRWAIF<\/I> as just a flash in the pan exploiting catchphrases and references to make its point, or as a cruel and unprovoked cheapshot against community scapegoats, but it deserves more than that; it's very, very funny, and well-drawn (to a point). It's a real shame it's technically incomplete, and that Dos didn't try to do the graphics himself, but otherwise it's highly recommended; I've yet to speak with anyone in the community who claims they don't like it, and even Eurakarte disliked <I>Frost<\/I>.<BR \/><BR \/>\r\n\r\nGood work, Dr. Dos!<BR \/><BR \/>\r\n\r\n<I>This review is nominally adapted from MadTom's original MTP review, which can be found <\/I><A HREF=\"http:\/\/zzt.the-underdogs.org\/mtp\/awards\/june04.html\">here<\/A>.<BR \/><BR \/>","description":"\"I - er - I'll do something mean to you!\""}, {"id":"23","gamefile":"death.zip","reviewer":"Commodore","email":"JDDGames@yahoo.com","review":"A fine example of a ZZT shooter filled with atmosphere and depth, _Death_ combines the nonsensical and the grim with the grit of classic ZZT game play. The game puts you in the shoes of a soldier who has awoken in a strange land after being used for experimental drug testing in the enemy's prison camp. You quickly learn that the ruler of the realm, and the being that you are destined to battle, is called the Tatvatt. The game has you fight your way past demons and zombies through over thirty floors of the Tatvatt's castle before finally confronting the evil god himself.\r\n<br>&nbsp;<br>\r\nA large game, clocking in at 320k, _Death_ keeps the action fresh throughout. Each floor is a well designed level loaded with traps and treasure. The dark boards are especially effective using a cramped layout so that no matter where you stand there is always a point of reference. The enemies are almost exclusively programed objects with distinct behavior and they often jump you after picking up an object or opening a door. Durable zombies will tax your ammo supply and force you into corners. Demons come in two flavors and are the main shooting enemy. Rats are surprisingly resilient and devious. One enemy throws \"parts of its own body\" that become creatures unto themselves. In ZZT terms this means that it shoots bears. The final boss may annoy those that can not stand stars, but he doesn't take too many shots to kill. Saving often is a must. The places where enemies end up doing the most damage usually surprise you. The game never ceases to keep you on your toes. The puzzles (what few there are) are a nice distraction but aren't particularly special and by no means the main attraction.\r\n<br>&nbsp;<br>\r\nAesthetically this game holds its own, though you may tire of the abundance of dark grey and red. A lot of what holds the graphics together is how well each floor is designed. Line walls are used heavily in certain areas, but creatively. Small details help aid the graphics such as decaying trees with poisonous fruit and murky pools. The opening boards sets the mood perfectly and the minimalist title screen adds mystery. The end consists of\r\ntwo quality art boards. Though a far cry from a dynamic score, the sounds do a great deal in helping promote the atmosphere and almost everyone you talk to has a theme that plays when you first talk to them.\r\n<br>&nbsp;<br>\r\nDarren Hewer's previous full length game Dr. Zeebo's Mystical Quest is similar in many respects, especially in its layout, but _Death_ is far more refined and more devoted to the shooting concept where Dr Zeebo was more interested in mixing puzzles into the equation. The game serves as a solid example of quality game play and design, and the game has a good \"finished\" feel to it. It's virtually bug free save the exploding arrows. A must play for followers of shooting ZZT game play and those who wish to understand what good level and enemy design means.","description":"A dark, atmospheric, and well designed shooter, _Death_ is sure keep your trigger finger happy up to the very end."}, {"id":"24","gamefile":"merbotia.zip","reviewer":"Commodore","email":"JDDGames@yahoo.com","review":"Merbotia is an exemplary short ZZT game. Sonic256's only release, the game follows the ZZT staple \"wake up and save the world\" plot mixing plenty of humour and some clever programming tricks. The game opens with you waking up in a cave and getting a quest to kill a mean dude. You then roam around an open field area killing some pre-fab enemies and\r\ncollecting goods to prepare for your dive into a cave and fight with a boss. After you are teleported to a spaceship hovering over the world and from there on you can either prevent or cause the Earth's destruction. The ending is different depending on how much health and ammo you have.\r\n<br>&nbsp;<br>\r\nGame play is simple and uses ZZT's built in enemies as fodder, but this is a short game and it does not require much effort to progress the plot or make something interesting happen. Indeed the charm of this game (past its well structured design) is the humour and choices you can make. Do you bribe the computer? or kick it? Make a pass at the evil leader? Well\r\nwritten dialogue combined with a sharp wit makes this game very enjoyable. Though there are a few pop references, they are just as humourous if taken as non-sequitur. The boss in the middle of the game is a good fight as he spews enemies that change into gems and ammo after you hit him with a shot. The game's only puzzles, outside of making the correct menu choice, are good ones yet don't require a lot of effort.\r\n<br>&nbsp;<br>\r\nThe game looks its age, but the graphics are clean and there is a good number of musical pieces that really set the mood well. The title screen is a neat little animation and you can already tell what sort of game you are going to play just by looking at it. It does not succumb to any syndromes and from what I could tell the game is bug free if you don't count a door that doesn't #lock. (You shouldn't have touched it twice anyways.) The STK in the game is used well for the time, though a lot of areas in the field lack texture, in the end it doesn't matter. There is a simplistic looking city cut scene at the end that serves its purpose very well.\r\n<br>&nbsp;<br>\r\nThis game is a featured game because it does everything right. Its charm and humour lift it above its tired appearance and into legend, and it isn't long enough to get tedious. Merbotia is a quality game for all to play and enjoy. Learn well.","description":"Who knew so much could be accomplished in a lifetime? Original humour still rules in this classic."}, {"id":"25","gamefile":"BOLETTE(FIX-A-DENT).zip","reviewer":"Commodore","email":"JDDGames@yahoo.com","review":"A sublime, and hard, adventure game, Pepper Bolette SE is a great example of a ZZTer improving in talent. The environment is lush and varied, and the characters that inhabit the land are as colourful and interesting as the world itself. Innovative engines and graphical touches liven up this fine game while the atmosphere drips with feeling and draws you in.<br><br>\r\n\r\nThe adventure starts on top of a tree. Apparently you have just eaten a shroom known as a Pepper Bolette and now are in the land of the unconscious. Your quest is to wake up, and to do so you must find some purple keys. To complete your quest you must learn to use the backpack. Operating it is done using ?-m, which links you to the inventory board. Initially the backpack is confusing, but it's not difficult to navigate. From it you will select items that you need at appropriate times, and choose which weapon you want to use. Now familiarised with the system, you are thrust into a cave and begin your adventure.<br><br>\r\n\r\nSaving is something you should become used to in this difficult game. Since initially you must pay for health (which is too expensive), losing life in places is as good as dying. Sent unarmed into the world, your first job is to find a weapon. This is no easy task. As soon as you emerge from the cave there are a total of three different areas you can immediately access, though entering the wrong area without proper armament or item is usually suicide. Much of the game follows this mold. Poking around aimlessly is key to winning, but once you find out where to go, restore and try to get there as effectively as possible.<br><br>\r\n\r\nMonsters are nasty, and if you don't have a gun, melee combat is not always wise. Early on, and even later, a good strategy is to avoid enemies altogether, though this is not always possible. Once you get to a location where a character will fill your health and ammo for free, things get a lot smoother. Hunting out items is the key to the game. Some are useful, some are essential, but most all of them are hidden or require some fighting to obtain. Just remember, don't explore while you have a purple key; it's a waste to have to backtrack to a key especially if you dodged more enemies than you killed on the way there.<br><br>\r\n\r\nThe enemy designs are sinister, and clever. Frogs lick at you from a distance with their tongues, and rats circle around as you try and shoot them. On top of that, they are fast. The game instructs you to play at a higher speed, but should you find yourself swamped, don't hesitate to turn it down a notch. The graphics are quite unique and impressive in many places. Objects are used to animate pounding rain, water dripping off of trees and dead leaves falling from branches. Each area is colourful and diverse, with a distinct feel. Sprawling map locations complete the effect of detailed areas. The programming is top notch. Aside from graphical effects there are neat touches like the frogs actually spitting a tongue at you, or an actual centipede made of objects. The large frog is a highlight where you can get eaten by it or blow it up. The inventory system works well and is a welcome change from menu styled inventory systems of the past, though because duplicator noise is omnipresent, I advise playing with the sound off.<br><br>\r\n\r\nThe characters are rather crazy. Their facial expressions are drawn next to their dialogues, and every one, minor or otherwise, is distinct. There are several in-jokes and probably references only the author and his friends would get, but the zany atmosphere of locations like the hotel in the volcano and the mushroom village makes up for things you do not understand. After all you did eat a mushroom, you expect sense?<br><br>\r\n\r\nThe main drawback of the game is its severe difficulty level. Gems are in low supply and you should not expect to recoup your losses buying heath after traveling in an area. Health and ammo are expensive which is a pain when enemies are difficult to kill. It could easily be called unfair. A couple of cheats is nothing you should be ashamed about, especially to get to some of the more impressive parts of the game. Despite the early hangups and limited resources, Pepper Bolette is a hugely creative game.","description":"Eat a mushroom? Bug out? Collect some purple keys? It must be a ZZT game! An odd and challenging adventure through a world filled with vibrant characters and technically impressive graphical effects."}, {"id":"26","gamefile":"elis_h_1.1.zip","reviewer":"Commodore","email":"JDDGames@yahoo.com","review":"It's time to recognise some real new talent in ZZT. Gingermuffins has already done great things with contests and the Mel Gibson game Sugartits. Here it all comes together in this excellent game. A shortened version of a project originally entitled Vinegar Gulf, Eli's House does not feel like a game that has been pared down. It's absolutely huge and you are bound to miss plenty of things the first play though. The sense of exploration achieved is comparable to Warlock Domain and Kudzu. Each feature of the world is captivating from the story to the graphics and it makes exploring exciting and interesting.<br><br>\r\n\r\nYou start the game navigating a hedge maze in an attempt to gain access to a mansion. Your hero's origins are vague, as are his reasons for entering the house. Eventually you meet some other people who are trying to explore the house, and together you work to solve the mystery of the house and its elusive owner. The characters are well defined and mysterious, revealing more and more about who they are as the game progresses which rewards game play. Much of the house is open to exploration and figuring out how to open that next door is much of the charm. Eli's House will have you shooting things occasionally, but not much, and the game leans heavily into the adventure category. Puzzles involve remembering who wants what item, or getting clues as to secrets from people or objects. The game requires a bit of thought, but that's not to say it doesn't involve quick reflexes. Several of the obstacles to overcome require thinking on your toes, the sewer area being a fine example. Health is limited which means you must be careful, but the experience is not frustratingly difficult and actually makes the game more engaging and addictive.<br><br>\r\n\r\nGraphically, this is gin at his best. The design of the mansion is varied and colours are used well. There are lots of interesting rooms that all have their own feel and style, which when combined in the game leads to a very immersive experience. Objects are used well graphically. Subtle animations and the occasional cut scene rounds out a diversely illustrated game. The music is effective, and the pleasant, mood-setting tunes are short and sweet. All of the above considered, the polish of this game is one of its most impressive features.<br><br>\r\n\r\nThe open ended quality of the first file is underused in the second, but it is just as large and twice as difficult. Things also get a little more weird. Traps here are devious and it's important to save often here. The Virtual Reality room is spooky. Later there is a sort of RPG fight, then you climb the windmill and move on to beat the game. The final sequences are exciting and satisfyingly climactic.<br><br>\r\n\r\nThere are quite a few areas in this game, though you are not required to visit some of them to complete the game. Playing this game you get the great feeling that you will never see everything. Packed with fun puzzles that challenge you mind and your reflexes, Eli's House is one of the best games to come around in a long time. A must for fans of adventure games. For examples of a finely finished game, balancing game play, story, and graphics, the aspiring ZZTer will want to take this one to heart.","description":"A competent blend of interesting puzzles, varied action, and captivating storytelling makes for a game no ZZTer should miss. A highly polished game worthy of emulation."}, {"id":"27","gamefile":"zzttoxic.zip","reviewer":"qrleon","email":"","review":"Al Payne only released two ZZT games, but they are very good ones.\r\n<br><br>\r\n<b>Smiley Guy<\/b> was one of the six winners of the Epic's \"ZZT's Revenge\" contest (along with Ezanya). Unlike those other five, Smiley Guy employs a lot of object enemies and gives the player more support through health and hint kiosks. Although the writing and dialogue may occasionally come off as rigid, the quality and level of detail put into the game itself is very heartwarming. Not to mention the setting (a \"living lab\") is atypical of ZZT games and well illustrated with plenty of line and object tiles, as opposed to just being a bunch of square rooms with yellow borders. It contains a lot of maze puzzles, occasionally warranting a change in program speed, but hey, it's a game. (And it's better than the usual invis-o-maze crap.) One could say that this is the first ZZT game to not play exactly like Town of ZZT.\r\n<br><br>\r\n<b>Toxic Terminator<\/b>, Smiley Guy's followup, was made the following year, and it continues the same general design (weird locations, maze puzzles, hint system) over a longer adventure. Released two years before the STK colour set was made public, Payne drew up several interesting screens that still look pretty cool to this day. My only real gripe with it is a dark maze that you're told to navigate without any torches. There were descriptive clues as you bumped into certain walls ... maybe I'm just dumb, but it didn't make any sense to me.\r\n<br><br>\r\nBesides that one gripe, Smiley Guy & Toxic Terminator are good quality, upper-tier stuff somehwhat reminiscent of various computer adventure and puzzle games from the mid-to-late 80's. There's really not much else to say about them since they speak for themselves very well. Definitely try them if you haven't before!","description":"Help Smiley Guy thwart the antics of an evil mad scientist in these two classic ZZT adventures! (Spoiler: he gets laid at the end)"}]
