[{"gamefile":"burgerj.zip","shoturl":"","month":"7","year":"1998","review":"Burger Joint is, in my opinion, one of the most innovative games released for ZZT in rather a long time. Matt Dabrowski (Madguy) has thus far put out two really quite incredible games, the futuristic RPG epic War-Torn and now the undefinable Burger Joint.<br><br>\\\"But bongo,\\\" you stammer. \\\"What's so damn innovative about Burger Joint?\\\" For starters, the game takes place on one board, in one day. (Well, not exactly one board, but all the boards are alike, so for all intents and purposes one board.) Quite a change from today's modern overblown RPG epics spanning three ZZT worlds that eventually have to be cancelled due to runtime errors. (No, I'm not bitter.) Madguy's game manages to pack a hell of a lot into one board, and every single bit of it gets used during the game. To top it all off, it's all really, really funny. There's never a moment where you wince at a bad joke, or where you fantasize about beating Madguy over the head with a socket wrench. The jokes all work, and the gameplay is surprisingly pretty balanced, the puzzles escalating in difficulty as you go along. It's quite an enjoyable game to play.<br><br>The plot revolves around young Johnny, a kid going to work for the first fast-food restaurant in the 50's. (Not historically accurate, but cool nonetheless.) He basically has to survive one day. Seems easy, right? You're wrong. Really weird stuff happens during the day, including but not limited to the murder of a restaurant competitor, a jock intent on pulverizing you and a terrorist invasion. And there's even a romantic subplot happening in the wings. The characters all have defined personalities (especially Roy, who is heavily involved in probably the funniest scene of the game), and weird running jokes are hidden throughout all of the various objects of the restaurant.<br><br>The graphics are quite good, especially for a one-board game. But what really makes the game shine is the sound. 50's pop hits are cannibalized and turned into PC speaker tunes, various original themes help to add to the story, and there's even a Grease parody. If you play this game with the sound turned off, may God have mercy on your soul.<br><br>At any rate, get this game. It'll give you a good laugh, and also make you damned glad that you downloaded it.<br><br>-bongo","reviewer":"bongo","email":"","awardtype":"GOTM"}, {"gamefile":"cwars9.zip","shoturl":"","month":"8","year":"1998","review":"Some consider this game to be the pinnacle of the CW series, me among them. The earlier flaws of the series (come on, you all must have hated that damn get-through-the-shifting-maze-in-9-seconds-or-so part in CW 1 too) are pretty much done away with, and the challenge is quite well balanced. The game also has probably the longest playing time of the series and is also the first to feature player switching, allowing for a huge cast, each with their own special abilities - and making getting the right combination to solve the puzzles an exceptionally sticky wicket. \r\n\r\nThe plot doesn't figure in as heavily with this installment as in the others, aside from a few encounters as you climb the Alliance Tower. But this isn't much of a flaw; you'll be too damn busy trying to get up to the top to read about the time theorems and evil doings of Mr. C. \r\n\r\nThe puzzles are, of course, the main part of any CW game. CW9 doesn't skimp on them whatsoever, and the new twist of character selection is added. Although some of the characters really don't do too much (*cough* Asher 2 *cough*), the others have rather a nice variety of skills. And midway through the game, there's an RPG battle where your character selections become rather vital to winning the fight. I personally prefer this fight to the one in CW10 for some reason, I have no clue why. \r\n\r\nThe graphics don't skimp either. They're all quite amazingly well done, with lots of little blinking and flashing bits and details, and it really looks like a Tower of Technology. \r\n\r\nThe game's main flaw is that the character selection routine is really, really annoying, since you have to trudge all the way back to the foyer to switch out party members. Chronos fixes this annoyance in CW10, but here, it's still damned bothersome. And you'd better like saving a lot- a lot of the puzzles are amazingly tricky, or are set up so that you won't know it's a puzzle until you walk into it (here I am thinking of the security camera in the prison.) Still, the challenge is a lot more even here than the previous games. \r\n\r\nIn short, this is the shining gem of the CW series. Download it, or be forever sorrowful and shamed. \r\n\r\n-bongo ","reviewer":"bongo","email":"","awardtype":"GOTM"}, {"gamefile":"pop.zip","shoturl":"","month":"9","year":"1998","review":"My declaring this game as the Game of the Month for September basically secures the Bastard Award for me by making two of the three GOTM's thus far games released by my own company, damage inc. But I talked to Abbott about it, and he agreed that it deserved the honors, so here we are. \r\n\r\nWhat's so great about pop? tuc himself billed it as his kudzu-esque game, a title which it rather richly deserves. Pop is all about atmosphere, and it delivers in spades. The game feels like Alice in Wonderland on acid, with garish guava-groves, a delicious meal with uuros maluuros, brightly designed hallways and a stampeding statue. tuc's excellent sense of humor also shines through rather often... from the definition of parakeet in the dictionary to the guy who says 50 things to the brilliant ending, possibly the best ever to grace a ZZT game. The puzzles are also quite well-done... I was stumped for rather a long time for how to proceed past the statue. But the puzzle difficulty is in an inverse ration to how far into the game you are, so it's a lot harder to start than finish, which tucan may have intended as a metaphor or not. \r\n\r\nThe game does have a few flaws... the aforementioned easiness of the later puzzles, for one, and the bugs that were present in the version that I played (tho' I understand that he's fixed those.) The fun of playing, however, far eclipses my nitpicky gripes. \r\n\r\nAnd to those concerned with replay over all: even if you do manage to beat the game, however, the real meat of the thing only comes once you've found all 8 of the gems in the game, which are quite well hidden (and there are a thousand temptations taunting you to spend them, so you've got to be careful!) \r\n\r\nFlaws aside, pop is simply brilliant. It's quite rare that a game like this appears, and top honors are well deserved by tucan, one of the greatest ZZT miracle workers of all time. \r\n\r\n-bongo","reviewer":"bongo","email":"","awardtype":"GOTM"}, {"gamefile":"knight.zip","shoturl":"","month":"10","year":"1998","review":"This is one of those games that should be right up there with or past Mission: Enigma as the be-all end-all of ZZT games, but never really gets the attention it deserves. For shame! \r\n\r\nThe story of Ned the Knight is, quite simply, about a fellow named Ned who has to complete three tasks to become a knight. The plot isn't the major factor of this game, however... the nice graphics, fun gameplay and impressive programming are what really shine here. The humor is always fairly sharp in every situation, and the whole thing has the feel of an animated cartoon. \r\n\r\nThe graphics are excellent, with bright colors and lots of little details, a welcome change from the overblended graphics of today. The music is nicely done, with a trademark Snake Brother theme, and several well-done melodies. The programming is simply amazing, with lots of falling trees, axes, and a great sword-style combat engine. The boss fights are all impressively done, and not just simple 'shoot the insanely fast little smiley who shoots stars' types. I gaped when I first saw the crocodile with an animated tail, and was impressed with the timing and precision it required to take him down with a series of ricochets. \r\n\r\nAs it stands, I have still not finished this game. It is possibly my all-time favourite and worthy of the download of the month many times over. So get it. Now! \r\n\r\n-bongo ","reviewer":"bongo","email":"","awardtype":"GOTM"}, {"gamefile":"dracmon.zip","shoturl":"","month":"1","year":"1999","review":"The Draco Experience is a collection of Draco's finished projects, and even those that weren't finished. The collection includes Hollywood Hooker, Teen Priest, and Insanity, plus ASSMAN.zzt, which is a collection of boards and art from discontinued projects.<br><br>All in all, The Draco Experience is a very good example of what a coalition of games should be, and I suggest it to even the most jaded ZZTer.<br><br>- lemmer","reviewer":"lemmer","email":"","awardtype":"GOTM"}, {"gamefile":"buckver2.zip","shoturl":"","month":"2","year":"1999","review":"February, 1999. A brand new year with brand new possibilities and a brand new Game of the Month reviewer: Hercules. So before starting with my first Game of the Month review, I'd like to thank xabbott for 'hiring' me. Thanx. ^_^<br><br>The second zzt.archive Game of the Month of 1999 will be the Buck Russel Demo by Almighty Cow. Surprisingly this game has never before been the Game of the Month, so I chose it now. Buck Russel is, in case you don't know (which I doubt), about a cop from the 70s called... guess what... Buck Russel. He and his partner Stone are getting involved in drugs business and many more. So far for the very small plot summary.<br><br>Why did I choose this game? That's because, firstly, the graphics are brilliant, with everything worked out into detail. Of course, you can't judge a game on its graphics alone. What other features does the game have? The gameplay is the answer. While playing Buck Russel I really got involved with plot and the characters. The characters were worked out fine, too, which makes the game a lot more playable, too. Those guys reminded me of the characters from the PC game Interstate '76. A lot of action will get you involved with the game as well, I'm sure of that. However, there are some minor bugs in the game and one part in the dock may seem a little hard, but this just can't spoil the fun. I know the Cow hates PC speaker music himself (he once told me), so that explains the lack and quality of sound fx and music in the game. Hereby I'd like to call the Buck Russel Demo the zzt.archive Game of the Month, February 1999.<br><br>Oh, one thing, before I forget it. I'm pretty sure you guys (including myself) will never see the full version of this game, since the Cow quit ZZTing. He also wanted to quit MZXing, but he just can't leave it for now. Well, buh-bye! ^_^","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"fabdemo.zip","shoturl":"","month":"3","year":"1999","review":"","reviewer":"","email":"","awardtype":"GOTM"}, {"gamefile":"racerx.zip","shoturl":"","month":"4","year":"1999","review":"Speed Racer X is the second racing game for ZZT (ZZT Racing I by eJECTION13 was the first). EdC468 is the president of Team Smiley X, a company that ought to be more well-known than it is now.<br><br>This game features an original racing engine with multiple speed levels. There's no plot, you just have to waltz through many levels of racing-fun. After every four levels, there's a pit stop in which you will receive an upgrade (such as a speed booster or extra suspension). In every level you'll have to finish a certain amount of laps in a certain amount of time.<br><br>The gameplay factor is extremely high- it is addictive, thrilling and innovative at the same time. The programming is extravagant, almost as good as Koopo's, eJECTION's or Chronos' programming skills! The graphics aren't really important in this game, but of course every game needs decent graphics. And decent, that's the word for Speed Racer X's graphics: decent, basic STK-ed graphics style with normal fading techniques. Nothing special, but as I said, very decent.<br><br>I'm really looking forward to another game by Team Smiley X, 'cuz I'm sure it'll be kick-ass! ^_^","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"cwars11.zip","shoturl":"","month":"5","year":"1999","review":"","reviewer":"","email":"","awardtype":"GOTM"}, {"gamefile":"nextgame.zip","shoturl":"","month":"6","year":"1999","review":"This month's game of the month is NextGame 33, by Madguy of Madgames. Why is it called NextGame 33? Well, that's because the game originally had to contain 6 different storylines, but Madguy only finished two of them. 100 divided by 3 is 33%, so there you are.<br><br>You are Matt Ape, a 16-year old dude who got caught for stealing an olive loaf sandwich for his starved-to-death family. Now he's in high-security prison and he hears yells coming from below. Will this be his execution day?...<br><br>NextGame is an incredibly well-done game with outstanding graphics, which I kinda expected from Madguy (if you've seen Wartorn 2 Demo, you know what I'm talking about). What you do on the first affects the storyline for the rest of the game - and that's kewl! Too bad there are only two storylines finished and we'll probably never see the other ones.<br><br>What makes this game so special are the different storylines and what makes this game a must-have are the wonkeriffic graphics which add to the fun you have playing this game. I'm sure you all have this game, but if you haven't go get it now!","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"tp2.zip","shoturl":"","month":"7","year":"1999","review":"","reviewer":"","email":"","awardtype":"GOTM"}, {"gamefile":"november.zip","shoturl":"","month":"8","year":"1999","review":"November Eve was released at the end of June\/beginning of July. As of that moment it stayed my number one choice for this month's Game of the Month. This month's competition was hard, tho, with tons of good games being released (Winter, Infestation 2, Scribbit's Mini Game 2, ERA, Zem! 2 Level Pack, Kamek, Rush Demo, etcetera), but nonetheless November Eve made it through.<br><br>November Eve is a large ZZT game, spread out into three ZZT files. The story is nicely put together and the graphics are more than good. This game features the good old Da Hood characters, such as Dr Erd and Cubed Ice, Kim, Keno and Kudo, etcetera. It has a large amount of humor in it.<br><br>File Three includes a lot of funny mini-games, like rapping and some other nice puzzles. The game also includes cameos, but not of guys saying 'Play my new game, it's cool!'. The cameos are actually characters with an important role in the story (well, some of them, at least). The game also features nicely composed music and it is extremely funny to play.<br><br>If you haven't already, download it, play it and have hours of fun! ^_^","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"dizzy.zip","shoturl":"","month":"9","year":"1999","review":"This month was again full with cool released games. Out of the many I played, I chose Zenith's Fantasy World Dizzy for this month's GOTM.<br><br>Fantasy World Dizzy is a ZZT version of the PC game with the same name by CodeMasters (made in 1991). Zenith gave me the PC game as well, so I saw that the game is pretty much the same. It's really cool to compare the ZZT and PC version.<br><br>You are an egg with an adventurer's hat and boxing gloves and you need to free yourself from a dungeon and then you need to free your egg girlfriend Daisy. It sounds quite simple, but it's funny and again, Zenith got the plot from the PC platform game (and platform games usually don't have great plots).<br><br>The game is inventory-based, meaning that you have to figure out a lot by typing +i and trying out things. The graphics are, as we expect from Zenith, great. You will encounter huge monsters, egg friends and other cool things. This game is an absolute must-play and I recommend you to download it at the Eagle Rock Interactive page (the company under which it was released). ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"ripflesh.zip","shoturl":"","month":"10","year":"1999","review":"This month has been a month with only a few good ZZT releases. I could have made Magic Land Dizzy, Zenith's 2nd ZZT egg-game, game of the month. I didn't do so, because he already had a the last game of the month with his first ZZT egg-game, Fantasy World Dizzy. This month I've tested two cool ZZT games, Chrono Wars 12 (by Chronos) and Interstellar Police: Escape Stal' Prison (by Robert Pragt), but they still haven't been officially released. Due to these reasons Arun.S.Rajkumar (aka 2378TCDD) got the chance to become this month's Game of the Month with his game Rippled Flesh! <br><br>\r\n\r\nRippled Flesh is \"an Interactive Goosing\" by Rybread Celsius. The game was released in 1996. It has been ported to ZZT by 2378TCDD. This means that all prose, puzzles and object in the game have been originally created by Rybread Celsius. <br><br>\r\n\r\nYou wake in a desolate room, where you try to stand up. The only things you remember are the number forty, a seductive female, a drink and darkness. You open your eyes... - I am not going to reveal the rest of the exciting, thrilling game. <br><br>\r\n\r\nRippled Flesh is absolutely worth the download. Personally I think the author, Arun.S.Rajkumar, is one the greatest ZZT talents at the moment. He showed us Rippled Flesh (of course), some awesome graphics with his Interactive Fantasies 24 artistic hours of ZZT entry and a very good Fall 1999 24 hours of ZZT game. I am sure we will hear more of this ZZT talent in the future...","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"tidizzy.zip","shoturl":"","month":"11","year":"1999","review":"An Interactive Fantasies game as the Game of the Month... Normally Herc or me never do this, for obvious reasons (we're *in* IF ourselves :). This time, however, I decided to do so anyway, simply because the only other game I've played worth GOTM (Robert Pragt's \"Escape Stal' Prison\") still isn't released yet, more than a month after it was finished :( <br><br>\r\n\r\nMy choice fell on the third instalment of Zenith's \"Dizzy\" conversions. This one, as the title \"Treasure Island Dizzy\" already suggest is set on a tropical island. You and your friends plan to go to Ibiza! (No, they're not the Vengaboys :) Alas, Dizzy takes the wrong ship, and ends up being washed up on a beach on the treasure island... <br><br>\r\n\r\nLike in the other Dizzy games, the whole atmosphere is simply brilliant. Everything has this happy and cheerful ambiance about it. Of course this is mainly due to the wonderful graphics (Zenith's up there on the top of graphics-land...): Everything is well drawn, clear happy colors are used and there's plenty of shading and randomizing. There's also some cool inventory puzzles, although (especially compared to Magic Land Dizzy) they are a bit too easy, add to this too. All of this combined make this game a topper. I know the year hasn't ended yet, but I think I can already say that all three Dizzy games are probably the best ZZT games released in 1999! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"dragoneye.zip","shoturl":"","month":"12","year":"1999","review":"Well, like often lately, not very much extremely high quality games were released last month. This game is somewhat of an exception; though it's not \"best of the best\" it is a good RPG demo, by two unknown authors (as of yet). <br><br>\r\n\r\nThe game deals with a very powerful servant which is created by a group of wizards. Instead of serving, the servant attacks the wizards. A guy named Scolan senses the evil, and journeys to the wizards' tower. The demo ends at the place where you can choose the character you want to play the full game with. <br><br>\r\n\r\nAs said before, this is a good demo. Mini_Maul & QNDeb show they have great talent. The graphics are good, nothing really special, but just good. The plot is vague but cool. Only thing which is not so cool is the RPG battle, which kinda... well... sucks, but I believe it was the authors' first. ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"srpg-d2.zip","shoturl":"","month":"1","year":"2000","review":"Wow, a couple of high-quality games have actually been released this month: We've had BoulderXOD (Dexter), Stupid RPG 2 (Knightt), Yummy (DirrCo) and the Dwarfish Mead-Dream Demo (CoolZX). The last one would have probably gotten GOTM, yet it is a demo, and I think it's better to reward a complete game. My choice fell on Stupid RPG Disc 2. <br><br>\r\n\r\nThere's actually some story behind the game: Back when Knightt was still in IF, he finished the game, but didn't release it, because he thought the last boards sucked. Now, he has redone those boards, and released the game under SkulSoft. <br><br>\r\n\r\nStupid RPG Disc 2 picks up the story of Stupid RPG. The story is nonsensical and kinda Tseng-like, because Knightt has made its own gaming universe. <br><br>\r\n\r\nStupid RPG brings you some good graphics, and some cool jokes. This makes the game cool to play. You should get a copy! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"bdisc1.zip","shoturl":"","month":"2","year":"2000","review":"A new game by a relatively unknown ZZTer. A good thing that is, because instead of hanging around all day on IRC, this guy has actually made a cool game! <br><br>\r\n\r\nYou assume the role of Volador, one of the knights who has to defeat Vampires. One night, when you and your friend Malek are resting in the forest, you are bitten by a vampire. The next morning you awake and feel different... you have become a vampire yourself! What follows is a long epic RPG, in which you learn a lot of vampires, and of your friend Malek...<br><br>\r\n\r\nThis game is simple great! I already enjoyed the really short demo, and now there's the full first part! The graphics are lush, the story's thick, and the game's extremely playable. It reminded me very much of the old Nivek games of which I am a big fan, which were released during the DarkMage Software period. Download it! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"darksoul.zip","shoturl":"","month":"3","year":"2000","review":"I haven't seen many good games released this month, but among the games released this month was one absolute masterpiece: Dark Soul, by Fishfood of Eagle Rock Interactive. <br><br>\r\n\r\nDark Soul takes place in the year 2006, in Twilight City, a huge city, built from the remains of New York. It's twice as big and has a huge crime rate. It is believed that World War IV is about to erupt... This is where the series of games from Fishfood will be set. Yes, Dark Soul is the first part of a series of relatively small games. <br><br>\r\n\r\nYou play the role of Riley, a guy working for the Gene Inc Research Labs. Recently a weird event occurred on floor 17 and today you are about to be promoted to the research department of Gene Inc. This day is not going to be an ordinary day, as you might have guessed. Riley is about to witness something that will change his life, an experience he won't forgot - something odd and very interesting... <br><br>\r\n\r\nWhat I liked best about the first part of Dark Soul, is the eerie atmosphere the game has. It has been very well done and really got me into the game, which, of course, a good thing. This is actually the only ZZT game (with the exception of Blue Magus' Blind Remix and Madguy's Wartorn) that is actually thrilling, exciting and even scary in a way. And this is worth a compliment, if you ask me. The plot is very interesting as well and includes some sudden plot-twists. <br><br>\r\n\r\nDark Soul's graphics are quite good, though they aren't very special. Most of the graphics consist of the inside of the Gene Inc Research Labs. The inside-the-building graphics are simple, but still professionally done. There are a few cut scene graphics that look pretty good, too. Fishfood has used a lot of dark colors, which really add to the atmosphere of the game. Hmm, combining graphics with the atmosphere - very well done, again. <br><br>\r\n\r\nMost of the game's programming is simple. The only actual programming the game has is the RPG battle, which is nice, but nothing special. Still, it provides a good change of game play in this game that is mainly an interactive movie. <br><br>\r\n\r\nI kinda missed some good, scary music. Oh well. The sound effects were okay, though. =) The game had quite a lot of spelling errors, which might be a little disturbing. <br><br>\r\n\r\nOverall, Dark Soul is a very good game that you should definitely download. If the rest of the series is going to be as good as the first part this is certainly something you should look forward, too. I also was a beta-tester for this game and I guess I should hereby thank Fishfood for letting me test it. ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"scooter.zip","shoturl":"","month":"4","year":"2000","review":"This month the great sidescroller games Koopo the Lemming (by Koopo) and Scooter (by gerbil) were released. I decided not to make Koopo the Lemming Game of the Month, because it was released by Hydra (Koopo never released it for some reason). I didn't know what Koopo would think of that, so I decided to make the other great sidescroller of this month GotM: Scooter! <br><br>\r\n\r\nIn Scooter, you control a small female guinea pig. She has to climb, move, dig, (etc...) her way to various levels. Not much of a plot, but for some reason, sidescroller never really have a developed plot. Most of the time, this doesn't matter really, since you'll probably have fun enough anyway. <br><br>\r\n\r\nThe controls of Scooter may seem a little difficult when you first play the game, but you'll get used to them pretty soon. There are various buttons: switching directions, tunnelling, digging, producing a clump of dirt and jumping. Also, beware of the red exclamation mark button... the suicide button. =)<br><br>\r\n\r\nScooter is game that's rather doable, even though it still provides you with some good challenges. The game is similar to the ZZT hit Zem! (and Zem! 2, of course) and it also bears some minor resemblances to Koopo the Lemming. <br><br>\r\n\r\nThe graphics of Scooter are pretty good, but not all that special. The decent graphics make the game look rather professional, which is a good thing, of course. You will also find a few art boards of our guinea pig friend herself, which looks pretty cool and funny. Scooter, you rule! =) <br><br>\r\n\r\nI haven't heard many people talking about the release of Scooter yet, so I hope this Game of the Month review will draw the attention of this Lame Game production, brought to us by gerbil, which is most likely to provide you with some good side scrolling fun.","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"momentum.zip","shoturl":"","month":"5","year":"2000","review":"The year is 3955 and speedracing is the most popular form of entertainment on earth. NIL and WIRE are two companies who are both into the building of racing ships. You are Trent Carwell, son of a WIRE-employee. Adolfus Speede, 83-year old head of NIL, has now only goal left: to put WIRE out of business! He has challenged WIRE to a momemtum-speeder race. The pilot is to survive some of NIL's most dangerous tracks. And gues... that pilot is you. <br><br>\r\n\r\nThis game can be called a racing-game, I guess, but it is very different from games such as Speed Racer X (EdC) or Rush (Shyam Natarajan). The player controls a cart which can only move left or right. The goal is to avoid obstacles which move towards you. When the timer reaches zero, you have completed the track. Yet, you also have a \"momentum\" meter (score). This decreases automatically while racing, and when hit, it decreases even more! When it reaches zero, you'll die. <br><br>\r\n\r\nThe game is built up of different \"zones\": atmosphere, forest, volcano, and later on also cybercity. Each zone contains five tracks and an ending boss. As you progress along the tracks of a zone, they get more and more difficult; you'll encounter more obstacles, and it takes longer before the timer reaches zero. By winning money, you can also use bonuses to get extra momentum.<br><br>\r\n\r\nLast Momemtum is a pretty original game. I believe it's the first of its kind; though this \"avoid-by-moving-left-and-right\" engine has been used *many* times before, no full game was based on it yet. The difficulty of the game is between easy and hard; the first few levels of a zone are way easy, but the last level and the boss can take a couple tries. The graphics of the game itself are rather simple, but decent, and the graphics of the intros and cutscenes are really beautiful (Hey, we're talking about CoolZx here!). Overall I can only say that this game belongs in your collection! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"loap2.zip","shoturl":"","month":"6","year":"2000","review":"IMO only two quite cool ZZT games were released this month. The first one is Rolie, by a new ZZTer Lil' Peebrain. The second one is the sequel to Life of a Player by RingWorm and Oddjob. My choice for the Game of the Month fell on the latter. <br><br>\r\n\r\nLife of a Player 2 starts when Romeo, the \"hero\" of the game is invited to a millenium party in Mexico. After this a lot of things go wrong, as you would have probably expected :). Romeo will need all of his player skills to save himself from a lot of painful situations. This time, there's also some mini-games included in the game, of which my favorite is absolutely the barkeeper-game; in this game you'll need to mix a lot of drinks, and this is a nice test for your knowledge of alcoholic cocktails :). <br><br>\r\n\r\nThis game's strongest point is obviously the humor. Tons of little jokes and funny situations are tucked in. Some of them (those jokes about Mexico) I didn't really understand though, but you probably need to be an American to do understand them (But hey, a lot of the jokes in games by Hercules and me no-one understand and can understand either :). The player battles, a parody on the scot-battles in Life of a Scotter are really cool too, though it's a shame there are only two of them.<br><br>\r\n\r\nLife of a Player, originally meant as a parody on Life of a Scotter by Hercules and me has grown to be far more than just a rip-off as stated on the title screen. The really funny humor, nice graphics and player battles make this one a perfect Game of the Month! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"admd.zip","shoturl":"","month":"7","year":"2000","review":"A lot of people have probably played the demo of A Dwarvish Mead Dream, which did well in the IF Annual ZZT Excellence Awards and the Hoodian Awards in 1999. Finally, the game is complete and it's a big shiny gem, indeed. <br><br>\r\n\r\nThere were two worlds... the dreamworld and reality. One day, long ago, reality attacked dreamworld, slaughtering its peaceful inhabitants. One of the few survivors was Radux the Dwarf, the guardian of the dreamworld. He seeks for help in reality... <br><br>\r\n\r\nYou are Glenn, a young Dwarf. One day, you come upon a small tavern. A Dwarf clad in red beckons you. You sit and he offers you a goblet of mead. Then you drift away into a dream... you end up in the dreamworld. It appears that you are a dream, just like Radux. The difference between you and him is that he was born in the dreamworld and you were not. You can freely travel between reality and the dreamworld. This is where the action-packed adveture starts. <br><br>\r\n\r\nA Dwarvish Mead Dream is an RPG with several types of gameplay. A very important part of it, is the dungeon- exploring. Fans of dungeon-games are most likely to love this game, if only for that part. Other parts of the game include a spiffy battle-engine, other cool engines and normal RPG-ish parts. <br><br>\r\n\r\nADMD features very good graphics, as we pretty much have come to expect from coolzx, the winner of the Summer 2000 IF24AHOZ contest. It's the combination of kick-ass graphics and a wide variety in gameplay what makes this game a shining pearl and very, very fine experience. <br><br>\r\n\r\nIn my opinion, A Dwarvish Mead Dream is coolzx's best game released so far. And yes, he has released quite a lot of 'em (and good ones, too :D). I'd like to compliment coolzx on this great game. For those you who haven't tried it out yet, I recommend you to do so. ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"lome.zip","shoturl":"","month":"8","year":"2000","review":"RPG\/Adventures seem to be the most common game style. Ever since the success of bongo's masterpiece, Rhygar, many have tried to follow, and no one has yet made a game of the genre as great. L.O.M.E. doesn't quite match that classic, but it's a breath of fresh air to a suffocating ZZT community.<br> <br>\r\n\r\nL.O.M.E. starts out as a plot about a mysterious jewel of great power and a young adventurer, stranded on an island, seeking the father who he had never met. The storyline throws some info at the player as the quest begins and then seems to slow down a bit, as traveling the island becomes a major portion of the pie. The battle system is somewhat flawed, yes, because the player can run away from enemies without the fight meter restarting (a countdown using the \"gems\" label), but to buy things in the game, score must be obtained from defeated enemies, so there's basically no choice but to have a few battles. Not too much fanciness; pre-programmed enemies will leap out at the player at the count of 0, but not too many, nor too little. The gameplay is all about exploration; roaming the land for secrets, or just the freedom of journeying (while some areas in the game do require the player to finish certain tasks before accessing). Therefore, L.O.M.E. also gives non-textual reasons to venture the game through. <br><br>\r\n\r\nOkay, okay, the graphics aren't GREAT. The visuals are fine, yeah, but not exactly beautiful. Still, it's not tedious to tell what things are, and no parts of the game are worse than average, art-wise. <br><br>\r\n\r\nHe did everything himself. The music (which isn't bad), the graphics, the story-telling, hell, the ENTIRE ZZT WORLD, minus the STK toolkits used. Just two bits of advice; try to understand the plot from the start to the surprising and amazingly-done finish, and don't let Leamas's lack of good English harm the enjoyment. Thanks for helping the community, Sejr. ","reviewer":"Knightt","email":"zztknightt@home.com","awardtype":"GOTM"}, {"gamefile":"rp2000.zip","shoturl":"","month":"9","year":"2000","review":"Only few good games have been released this month. In my opinion, the only good ones were Tut's Tombs Legends Disc 2 (by Ringworm), Possessed (by Jojoisjo) and Rup Pig (by Mrs Claus). My choice fell on Rup Pig, a strangely compelling story of a half human, half pig, called Rup. <br><br>\r\n\r\nRup was born in a big hospital in Boston, where he surprised both the doctors and his mother. What the heck was *that*? Rup Pig's mother died the day after. At the age of 9, Rup Pig moved to a small town in Maine, called Unity. His only friend was a girl named Sally Dort. When Sally and Rup Pig escaped from school and went onto a train, Sally accidentally fell out of the train. From this moment, Rup Pig's weird adventures start... <br><br>\r\n\r\nMrs Claus did extremely well in the IF 24 artistic hours of ZZT and his graphical talent is shown in this game. The entire game features lush graphics and artwork, with the exception of one intentionally newbie-ish-made board (which he should have left out, in my opinion). Some of the colouring is pretty amazing, too. <br><br>\r\n\r\nAs for gameplay, Rup Pig offers some enemy-battling, one little mini-game and some item-hunting. The sound effects and music of the game are alright, but nothing really special. The length of the game is a definite plus - it's quite a lot of boards and it's 214k. <br><br>\r\n\r\nRup Pig focuses on a strange sense of humor, a sense of humor that I'd almost call \"DirrCo humor\". It features some dirty jokes and just random funny stuff. You may not find everything amusing, but I'm pretty sure you'll find at least some parts amusing. The game itself makes little sense, which only adds to the humor part, but it makes enough sense to be understood. <br><br>\r\n\r\nOveral, Rup Pig is a nifty game that has a few shortcomings, but a lot of good points, too. It's certainly worth the download. ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"neo1.zip","shoturl":"","month":"10","year":"2000","review":"This month's Game of the Month goes out to the Chase Bramlage; a guy who has not been in the ZZT scene for that long, but has been ZZTing for a really long time. This year, he surprised us with good games like Bloodlines, Operation: Obrian, and now disc one of New Earth Operations. Other candidates for this month's GOTM were Gems and Pipes by Jojoisjo and Psyche by Zenith. Before I explain why my choise fell on NEO, I'll give you a short summary of the plot of this game... <br><br>\r\n\r\nIn the beginning of the 21th century, more and more research goes in the manipulating of genes. The USA founds the GRD (Genetic Research and Development). Other countries founded similar organisations. Among them was China, of which their organisation found a cure for AIDS... This quickly made China the most powerful country in the world. The USA fell into a long recession. To enlarge to market in the hope of fixing this, they combined several cities into one large Macropolis; the New Earth Operations (N.E.O.) bill. The USA became the genetic capitol of the world again. A special forced unit called the G.E.C. was created to prevent the USA from the rebelling forces in Russia. Later on, the E.R.G. was formed by an Asian company. This company could equal the strength of the G.E.C... This game tells the two different stories of two diffent people; a G.E.C. soldier called Ace, and a man who is captive of the E.R.G. called Blade. To be honest, I don't really get the plot of he part with Blade, but that's probably since this is only disc 1 of the game... <br><br>\r\n\r\nAN.E.O. Disc 1 is actually a relatively short game; both the storylines have only 5 playable boards in it. Both they have a different way of playing; Blade's part is a side-scroller, while Ace's part centers around action (shooting soldiers).<br><br>\r\n\r\nWhat makes N.E.O. a really awesome game is it's atmosphere. Chase has managed to make a richly detailed setting for this game, with which he proves to be a great plot-writer. The graphics are also good, they fit perfectly with the game. The only thing which is a shame about the entire game is that it is a little easy (except for the 3D shoot-out board in Ace's part), and can be completed in a quite short time. Other than that, this is a kicking game, and a recommendation for anybody to download. ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"chknwire.zip","shoturl":"","month":"11","year":"2000","review":"Whereas Zenith lost last Game of the Month with his game psyche to New Earth Operations Disc 1 by Chase Bramlage, he won this month - ChickenWire v1.5 is this month's GOTM. Only few games were released this month (most of the recently uploaded games have been finished in September) and ChickenWire v1.5 was in my opinion the best of this month's few releases. <br><br>\r\n\r\nChickenWire v1.5 is, as you could have guessed from the game's title, an update of the original released quite a long time ago. I already enjoyed the original, but the update has several neat improvements. <br><br>\r\n\r\nZenith himself describes this game as the Rangest of ZZT (Rangest being a MegaZeux game by Darren Hewer). The game also resembles Darkness (another MegaZeux game by Darren Hewer). If you haven't played any of the mentioned MZX titles; this game is a seemingly incoherent bunch of very odd, yet intriguing boards linked together. <br><br>\r\n\r\nIf it's incoherent, then why is it a good game? Well, this game wasn't meant to be coherent in any way. Coherence is of no importance in this piece of silly Zenith humor. The game is full of references (a lot of them being ZZT community references) and several of them require some involvement in the scene to understand them. If you aren't really involved in the scene, the jokes are probably not as funny to you, but if you get what is being said, this game can be damned hilarious at some points. <br><br>\r\n\r\nChickenWire doesn't feature much graphics, but what's there looks really good. It also has a few nifty tunes by Viovis. As for programming: ChickenWire features some tricks used in all sorts of random ways. The main part of this game is, of course, the silly humor and random things spread around the small ZZT world. <br><br>\r\n\r\nIf you are up for some good laughter and enjoy a good bit of weird humor, then download this game. If, however, you are looking for a serious and coherent game, you got the wrong thing here. Anyway, thumbs up for this cool update of ChickenWire, released under Lame Game. ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"vo4.zip","shoturl":"","month":"12","year":"2000","review":"This month, a couple of really good ZZT games have actually been released. Chronos presented the 13th chapter of the Chrono Wars saga, Eurakarte made the small puzzle game \"Mr Shapiro cares not for Snakes\", MeBo and I finished the sequel to King's Quest ZZT and WiL finished his interactive movie\/RPG Voyage of Four. My choice for the GOTM fell on the last game. <br><br>\r\n\r\nThe Voyage of Four deals with the actions of four characters and the worlds they inhabit. I will not give away more about it; the storyline in this game is awesome, and you should play the game yourself to see it. In the user reviews of this game, it was said (most noticeably by Lemmer) that this game's storyline was ripped off Final Fantasy. Well, I don't agree with that. Maybe some elements in the beginning resemble FF; but the rest of the game certainly doesn't. Instead, WiL has made a really thrilling plot, filled with subplots, and the characters in his game actually are actually profound; my personal attempts at doing such a thing have always been in vain (Sacrifice, Forbidden Tolerance). <br><br>\r\n\r\nLike said before Voyage of Four is an interactive movie. And that's precisely the fact which leaves me musing about how truly perfect the game could have been... Now the whole game is over in 1.5 ZZT files... Imagine a long epic RPG spreading multiple chapters with this game's storyline... What I'm saying is this; if this game would have been a normal ZZT game (in which the player actually can do things) instead of a movie, it could have been the next Rhygar! Oh well, guess I've never been a real interactive movie-lover like some other ZZTers :). <br><br>\r\n\r\nSome RPG battles were also tucked in; they are nice, even though sometimes they can be a little bit tedious (djinn battle). Last, but certainly not least, Voyage of Four has some awesome music (which I've come to expect from the creator of #play) and ditto graphics\/visual effects. Overall, I think WiL's first serious ZZT game is a damn great one, and I'm looking forward to his future games. Keep up the good work! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"new.zip","shoturl":"","month":"3","year":"2001","review":"Quite a lot of games have been released this month, but most of them were mediocre. However, there have been a few good releases among them. Most noticeably \"Driving\" (by Slamice), \"Donny's Little Feast\" (by Tony C), \"Who Wants to be on a Gameshow Demo\" (by BroKen) and of course, \"New Demo\" (by Bucket) which won the contest this month.<br><br>\r\n\r\n\"Who Wants to be on a Gameshow Demo\" is a neat little game, but I feel it wasn't that special to win GOTM and \"Driving\" is definitely a fun game, but it's not that original as you might think it is and I personally got bored of it after a few boards. \"Donny's Little Feast\" is an enjoyable oldskool ZZT game with classic action and adventure. <br><br>\r\n\r\n\"New Demo\" closely resembles Draco's ZZT style, both in art as in the dialogues. Bucket has obviously been inspired by the author of the Teen Priest series, and I can't say it turned out bad.<br><br>\r\n\r\nBucket has apparent artistical talents and is especially good at drawing people in ZZT, as this game shows. The in-game graphics are good, although nothing too special.<br><br>\r\n\r\nAs for the story, it's rather random and somewhat crazy. You'll notice as you play along. Maybe it's the randomness that makes it enjoyable. Okay, this concept has been done before, but it proves to at least somewhat humorous.<br><br>\r\n\r\nAlas, this game has its down-sides as well. It's a demo and has not been beta-tested well. It's still rather buggy and has some annoying passage-linking errors.<br><br>\r\n\r\nOverall, I do suggest checking this game out, if you liked games like the Teen Priest series, Edible Vomit, and Rup Pig. Don't expect anything truly amazing, though, since this game may be promising, but it's not as great as it could have been.<br><br>\r\n\r\nWe've seen some good games this month, but nothing oustanding, so let's hope next month will have some great releases.<br><br>\r\n\r\nAs for \"New Demo\", I have two more things to say. \"SNAGGIT!\" and watch out for bucket, as he showed he has promising ZZT skills.","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"within19.zip","shoturl":"","month":"2","year":"2001","review":"Well, even though lots of nice ZZT games have been released this month (Stupid RPG Disc 2 SSCE, Spork Man 2 Demo, Regeneer Caverns, Within v1.9, Stupid RPG Third Flavor Demo, just to name a few), they were all either demos or remakes, which means no actually new and cool full games have been released... The only exception were a couple of random dungeon games, but to be honest, I'm getting a bit tired of those games (as long as they don't bring something new, like Run-on did last month). I was doubting for quite some time which game had to become GOTM; should it be the Stupid RPG Third Flavor Demo or Within v1.9? My choice fell on the latter, even though I normally never make remakes GOTM...<br><br>\r\n\r\nWithin, made by Wayward, is a game which was originally made during the Fall 24 hours of ZZT of 1999 (of which the topic was fantasy). Personally I think that neither I, nor the judges back then, gave this game the score that it deserved. Now, a completely spiffed up version has been released... <br><br>\r\n\r\nThe plot\/storyline is what really matters in this game. The story deals with Thomas, a typical day-dreamer, and his friends Alicia and Thomas. The storyline gives you the 'Matrix-feeling'; while playing you're constantly doubting if what you're seeing is 'real' or not. I'm not giving away more details about the storyline here, because that would really ruin the fun. You should just play it for yourself, believe me, you'll like it! The only thing I don't like, and would have done otherwise if I had made the game, is the ending... I can't explain why, because that would mean giving away too much of the plot, but anybody who wants to know, feel free to mail me (click on my name below to send mail).<br><br>\r\n\r\nThis game has (not counting the simply horrible-looking title screen) some really great graphics, which was what the original 24HoZ game lacked... As said before the storyline is awesome, and overall it's just a generally cool game to play. It is, however, a game that the die-hard action fans probably won't like, since playing mostly comes down to reading long dialogs... Overall, I can only recommend you to check this one out! <br><br>","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"run-on.zip","shoturl":"","month":"1","year":"2001","review":"For the second time in a row the game of the month goes out to WiL; the ZZTer who is probably going to proclaim the title 'ZZTer of the year 2000'. Not too many good games were released this month. The only really high qualty ones were, in my opinion, Robert Pragt's \"Interstellar Police\" and the game we are talking about here: \"Run-on\". Let's hope 2001 will bring us more good ZZT games!<br><br>\r\n\r\nThe storyline behind Run-on is actually kind of trivial: You assume the role of a guy who is hanging around in his yard, when suddenly he is filled with fear. A great darkness has overtaken this world, and is now chasing you. When it'll reach you, you are dead meat, so you only know one thing to do: to run, and to keep running on. Darkness is simulated in the game by the left wall of the screen. At the right wall of the screen, terrain is generated, so that you get the feeling that the screen 'scrolls' towards the right. <br><br>\r\n\r\nRun-on is a game in the genre that has its origin in this year: randomly generated games. It all started when LowerVP released the first episode of the game 'Dungeon Guru Nostalgia', somewhere during the first months of the year I believe. LowerVP and various others like CoolZx have been releasing randomly generated dungeon-games since then. Personally, I think WiL's contribution to the genre is a damn great one, possibly even the best. What makes Run-on so great is that it actually takes a really long time before it starts to get boring. Other random games tend to bore relatively quickly. (A good example, sorry CoolZx, is the 24HoZ game 'The Pits of Pythor - this one takes you through 30(!) more or less identical levels). Run-on, on the other hand, offers variation to the player. It offers four types of worlds, each with their own type of play: regular run-to-the-right, dark boards, boards scrolling in 4 directions and even a randomly generated side-scroller are challenges you will be offered... This all shows that next to being a damn good musician, WiL is a damn good programmer too. <br><br>\r\n\r\nEven though it is fun to play, Run-on is not a game to play in one afternoon. It's just way too long for that. The thing which is best to do is to play this game for a while, then save it, and continue later on... This way you actually have a game which is enjoyable for a couple of days!<br><br>\r\n\r\nLast, and in this case probably least too; the graphics of this game are pretty nice. Graphics are an issue that most random games greatly lack in and of course the randomly generated terrain itself cannot be made really beatiful, but the rest of the screen is often forgotten... not in WiL's game luckily. Overall, I really think that you should take a look at this masterpiece of programming. ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"lr9.zip","shoturl":"","month":"4","year":"2001","review":"March 2001 was mainly dominated by three big ZZT releasals, those being \"Deceiving Guidance\" (by me and Hydra), \"Purposedly Produced Dynamic Visualties II\" (by Viovis) and \"Los Refritos 9\" (by Chuck). Easy enough -- I cannot make my own game GOTM. =) However, the race between PPDVII and Los Refritos 9 was a close one and my choice fell on LR9, by Chuck. Before starting the real review on LR9, I'd like to congratulate Viovis on his piece of ZZT art, PPDVII. Well, let's proceed to the review.<br><br>\r\n\r\nLos Refritos is Chuck's well-known ZZT series about the ZZT scene and that's mainly the IRC (Internet Relay Chat -- see www.mirc.com for info) ZZT scene. Chuck released part 1-8 a while ago and they never were a big success, although they were still decent. Los Refritos 9, however, is different. And different means better, here. LR9 turned out to be a game that was well-received by the community. <br><br>\r\n\r\nWhile part 1-8 were mainly cinemas about arguements and events in the IRC ZZT scene, part 9 offers a coherent plot along with it. This makes it more worthwhile and playable for ZZTers who do not know much about the scene itself, unlike the previous parts in the series.<br><br>\r\n\r\nI won't reveal much of the plot here, as it'd spoil the fun (mainly because the game consists of cinemas for a large part). What you can expect is an appearance of people like Blazer, Tseng, Lemmer, FishFood, Chuck, Zamros, Master Walnut and more. They're all back. You'll venture into the worlds of the IRC servers Austnet and Espernet, with channels like #darkdigital, #sledgehammer, #loungeact and #asd.<br><br>\r\n\r\nPeople who know the ZZT scene well and have met most of (or all of) the people in LR9 are most likely to find this game much more enjoyable than others. I'm not saying you won't like it if you're not involved in the scene, but if you understand what some things are about, the game is most likely to appeal a lot more to you.<br><br>\r\n\r\nAs for graphics, LR9 offers you decent visuals done by Chuck and Blazer. The game is using a font (which, by the way, I was never too fond of, but that doesn't really matter), too. You won't find outstanding graphics, but they are definitely not bad.<br><br>\r\n\r\nAs far as gameplay goes, the game offers quite some variation, which the previous LR episodes lacked. The variation includes cinemas, playable boards, action boards, battles and puzzles. An enjoyable mix, though the action boards where you have to shoot enemies are a bit tedious.<br><br>\r\n\r\nOverall, LR9 is longer than the older episodes, offers a wider variety in gameplay, has less pointless newbie-bashing, has a neat plot and is defintely the shining gem of the series so far. Some of the scene-references are funny, deep and sugar- sweet and the 3rd file (the aftermath) is excellent. A game that will appeal most to ZZTers involved in the commune, but still a must-add-to-your-ZZT-collection for every ZZTer! ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"four.zip","shoturl":"","month":"5","year":"2001","review":"Well, the battle for GOTM this month was majorly between two games: Knightt's final remake of Stupid RPG (entitled Stupid RPG Disc One Complete), and Jojoisjo's Four. My choice fell on the latter. Stupid RPG, even though it is a remake (and people must know my attitude to remakes by now :), is a really good game which really \"adds\" something to the original game, and therefore deserves a honorable mention here before I start with the actual review of Four.<br><br>\r\n\r\nFour, made by Jojoisjo - who I consider one of the most talented members of Lame Game - is a game I've never seen before in ZZT. The storyline of the whole game is wrapped in mist - In the beginning you get the feeling that there isn't a story at all, but gradually you begin to disover what's happening, the entire thing stays unclear till the end, though.<br><br>\r\n\r\nLike I said before I've never seen this type of game done in ZZT. Then, what kind of game is this? Well, this is an adventure game, only totally different from most adventure games; This is a first person game. Not like the (mostly not too-good) 3D games we've seen - but more like old PC games like Sierra's \"Rise of the Dragon\". Every screen is a different location where several things can be done - looking at things, using items, etc... This is all controlled by a cursor, moved around by using the keyboard as usual, but (and that's also something new!) after some practice it works even better when using the mouse (and the speed set a bit faster). The entire game is very much item-based - that means a lot of picking up\/using items. All items which the player has in position are shown in the right half of the screen, a handy feature because the \"?+i\"-typing in the usual adventure to see your inventory can get really annoying. <br><br>\r\n\r\nThe graphics of the scenes in the game are a bit on the mediocre side, I must say. I'm personally not too happy with the fact that the screen looks so dark too. Some improvements of the graphics wouldn't be uncoming in this game's planned sequel. There's also not too much music, which is too bad because Jojo is really good at composing. Aside from these two flaws, Four makes a really great game. The originality and gameplay have made this one a competor for game of the year. So everybody, download it if you haven't already! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"GOTM"}, {"gamefile":"7monday7.zip","shoturl":"","month":"6","year":"2001","review":"This month was mainly a race between three games; voighdt's \"Today is Monday\", WiL's \"largoABRAXIS\" and aestch's \"Scorched Earth ZZT\". The biggest game of the three, \"Today is Monday\" won.<br><br>\r\n\r\nThis game has a big history, as voighdt explains in the accompanying text file. It all started back in 1998 and voighdt was thinking on an amusing joke concept that he called \"Today is Monday\" -- a small, weird game to be released on let's say, thursday. However, voighdt figured it would be a better idea to not let it be another Red Aureole joke game (Bomb ZZT, anyone?) and make this into a big, real game.<br><br>\r\n\r\n4 was supposed to be part of a trilogy, which also included \"k.r.l.f.n.t.e.\" and \"Around the World in Seven Days\". voighdt now indeed this game to be a mix of adventure, humor and mystery. A lot more happened in this game's history and at some point, it was supposed to be a joint-project with Viovis. However, this never really worked out and work was abandoned. In the year 2000, voighdt thought that he needed to release some of the stuff he worked on for the past few years and started working on this game again, this time only focussing on the first day, monday. Having done some research on the origins of the week-days, monday had to do something with \"moon\". \"Today is Monday\" now contained spiced up parts from the original \"Today is Monday\" (which was abandoned), \"k.r.l.f.n.t.e.\" and \"SiK 2\" (abandoned project by voighdt and Viovis). In May 2001, it first saw daylight.<br><br>\r\n\r\nThe game starts out with amazingly intriguing piece of text. I quote some of it: \"today was your 1st day alive and your last day to die. monday was the day i never knew you.\" and \"dead like a monday. dead like today\". The full text definitely sets the mood.<br><br>\r\n\r\nThis game is mainly based on interesting, mysterious writing and artistical concepts. Viovis' influence in voighdt is clearly noticeable, especially in the art-only boards. The game has a mysterious, moody tone, but comic relief there is a plenty.<br><br>\r\n\r\nThe graphics of this game are quite okay and sometimes rather trippy in a Viovis-kind of way. voighdt shows he has definite talent and the only thing that bugged me here were the board linking errors.<br><br>\r\n\r\nThis game is interesting enough and even if you're not a fan of this style, you might want to check it out just for the heck of it. ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"GOTM"}, {"gamefile":"no.zip","shoturl":"","month":"7","year":"2001","review":"Voting Results:<br><br>\r\n\r\nNO! - 12 Resident Evil - 9 The Motivational Speaker - 4<br><br>\r\n\r\nAhhh... June 2001. Many have viewed this month as thin and disappointing (especially since some popular releases were due this month, such as a new game by Wayward, one by the old and current IF groups, and something by myself), but 25 people cared enough to vote on what became the Top 3 candidates for GotM in June 2001... in third place was Viovis's \"The Motivational Speaker\", a fun, storytelling game (like usual Viovis style) about... well... a motivational speaker. Somewhat short, but fun enough. Second was bucket's (March 2001 GotM winner, with \"New Demo\") \"Resident Evil\", a game that would've made a fantastic demo, but served as a decent complete game. RE takes the virus\/zombie aspects of the popular game series and transfers it to ZZT, with great graphics and fairly good gameplay, but was annoying at times (ammo reloading, zombies taking away too much health).<br><br>\r\n\r\nAlso, I'd like to point out \"The Kane Project 2\", which got 2 votes... of course, Master Raze (the author) isn't the most popular of programmers, and there was little hype from anywhere about the game from himself, so he has something to be proud of. A little too much cursing there, m' friend, but it got the votes it deserved anyway... once again proving that if a game is truly good, it will prevail. <br><br>\r\n\r\n... But, hey, enough with that. Let's get on to this month's winner (which I would've picked myself, just like last month's; rock on, community!)... _God_'s \"NO!\"!<br><br>\r\n\r\n_God_ has had several releases in the past, but the most impressive one was \"RPG Demo\", which got him into Random Inc. I was pretty happy with what I got, there, but then he sent me a copy of \"NO!\", with the first few levels done... and I knew I was getting a programmer with the potential of being one of the top 15 around. \"NO!\" blends traditional ZZT arena fighting, RPG battling (and this engine's actually GOOD, folks... plenty of magic attacks, as well as a sword technique and a bomb move), Atari's Breakout (much like pong, with the major difference being that instead of going against an opponent, the player has to hit differently colored blocks), and the random dungeon scheme... and somehow manages to make it all fun. Eight levels of fun, plus a boss at the end which won't fall by touching him (... or it) many times or trying to shoot his brains out (... Well, he'll tell you how to defeat him, but it's still somewhat challenging and fun anyway). The only real downfalls are that it's a bit short (which is forgiven, since it's fun enough to be replayed a decent number of times), plus it has some bugs that sometimes appear, though the most I had to do about that was try \"?+dark\" to find a passage. Don't worry about it, folks, the small errors don't really harm the game.<br><br>\r\n\r\nAre there some bugs? Yeah. Should you care? No, dammit, just use \"+zap\". This is one of the better games of the year, and the best action game released so far this year (okay, there's little choice for that second one... but this game's good, anyway!). Let's remember why people play ZZT; to have fun. Simple as that. And this game, while being as simple as that, also does pack that fun. ","reviewer":"Knightt","email":"zztknightt@home.com","awardtype":"GOTM"}, {"gamefile":"srpgtf.zip","shoturl":"","month":"8","year":"2001","review":"July is almost always the month where zzters finally get in gear and release some really good games. This month was no exception. That being said, some notable releases include the very surreal Red Isle by Oof, the widely popular ZZT Sports by Fishfood, and two long awaited titles by two very well established zzters, Operation: Obrian 2 by Chase Bramlage and Stupid RPG: Third Flavor by Knightt.<br><br>\r\n\r\nWhile all of these games were good in their own right, be it through humor or graphics or music or whatnot, none of the games released this month can touch Stupid RPG: Third Flavor. This is due to the fact that the game has all of these qualities, and delivers them in an incredibly well-wrapped package. <br><br>\r\n\r\nThough the story of the game isn't as well written as other games in the series, Knightt sets out to entertain the reader, and he does a very fine job of this. I found myself laughing from the very beginning, as the little Metroid spoof really had nothing to do with the game, but set the mood incredibly well. The comedy contines to spew from almost everything you touch, and it is everything you expect to hear from knightt. Yes, the misadventures of Jed, Razor, and Fagnuts may use many of the same jokes that we have heard from other Stupid RPG games and from the ZZT community in general, but it is still very funny.<br><br>\r\n\r\nOutside of one or two boards that made me wince and made my eyes want to vomit, the graphics in this game are solid, and give a nice complimentary atmosphere for the comedic tone of the game.<br><br>\r\n\r\nThe music, written by JacobH, is beautiful. It is truly one of my favorite zzt musical scores of all time, right up there with Freedom and Business Bob Update in my book. Knightt does a very good job of putting the right piece of music in the right place, though the music played after killing enemies makes me want to destroy my PC Speaker, but that's just me :)<br><br>\r\n\r\nAll in all, this is definitely one of the best games this year. It combines many little elements that are much harder to get right than one might think to make an outstanding zzt experience. This game will not please everyone; no game ever will, but it is certainly well worth the download. ","reviewer":"Wayward","email":"waywardzzt@yahoo.com","awardtype":"GOTM"}, {"gamefile":"anth.zip","shoturl":"","month":"9","year":"2001","review":"Ah... August usually isn't a kind month for ZZT, and, as usual, there were some decent games released, but for the most part there was little to talk about. Having just returned from vacation and unconvinced that a game this month deserved a GotM, Hercules approved to let me decide this month's honors. We did, however, seem to agree that this month's best games were Nuero's \"Anthropoid\" and Dsone's \"Lemming Hunter\" Demo.<br><br>\r\n\r\nI was rather impressed with \"Lemming Hunter\", but since I feel it's better to reward a complete game than a demo, and because they both had roughly the same level of quality (however, Nuero's game offered more of it), my choice was with \"Anthropoid\". \"Lemming Hunter\" continues the trend of lemmings-esque (C'mon, you know those cute lil' guys that remind me of the Kennedy family) ZZT efforts, and does it quite well... while some may say it's \"no-frills\", the programming is done well in my view, and will entertain some (as I was). <br><br>\r\n\r\nNow, we go to \"Anthropoid\". A three file game of the Adventure\/RPG genre, Anthro mixes good, easy humor with enemy types similiar in name to Pokemon's (\"Rainer\", \"Lava Flamer\", \"Thunderator\")... and the journeying of the game feels somewhat like Pokemon, as well. Of course, the difference between Anthro and Pokemon is that Pokemon's way overrated and it sucks (... we already knew that, right?); Anthro's good, though it may not be a classic (thanks to varying game environments and a storyline that gradually picks up). <br><br>\r\n\r\nThe problem with this game is that the third file is way repetitive and is filled with bugs; however, at the same time, it has an amusing enough plot to keep it enjoyable. Not everyone will be impressed (though I was), but it's the best option August has brought us. ","reviewer":"Knightt","email":"zztknightt@home.com","awardtype":"GOTM"}, {"gamefile":"megajob.zip","shoturl":"","month":"10","year":"2001","review":"It has been a fiercely competitive month in the GotM stakes, as Herc would've probably told you had he not been busy with things of grave import! So I, Kracken, am here instead as his cheap replacement for this month's dealings.<br><br>\r\n\r\nTwo muchly worthy mentions this month would have to be Infestation 3 by the illustrious Coolzx and Mazi-Oog by the beauteous WiL; two games of high standard that would have, with little doubt, probably won the award in lesser GotM'ing months. I3 features 20+ rounds of gun-toting action with some of the most adorably drawn bloodthirsty monsters I've ever seen; Coolzx's graphical ability is awesome. Mazi-Oog is a intriguing game belonging to a hybridized genre of action, puzzle and strategy; and while being one of the most user-friendly ZZT'ing games I've seen to date (the helpfile is most shiny), also successfully shows off WiL's formidable abilities in programming and in making an entertaining game.<br><br>\r\n\r\nBut enough of that.\r\nWhat I am reviewing today folks, is GotM and Tseng's (possibly) final ZZT game, The Misadventures of Mega Job: The Epic Tag Team, which I shall henceforth refer to as 'Mega-job' for simplicity's sake. Mega-job, which I also had the fortune of beta-testing, could be called a game about the finer things in life; but is mostly a tale about 2 oddball part time wrestler crime-fighters residing in the corruption-filled pandemonium of Beefville. The plotline entails the? well, the Misadventures of El Janito: The Mexican Stereotype, who is quite small and Beef the slightly annoyed, who is slightly annoyed. El Janito has powers of summon, and can call upon many illegal immigrants to hurt stuff on his behalf in dire circumstance, whilst Beef wields the formidable powers of instant Spam fabrication. Yellow\/Red and Blue spandex respectively, of course. <br><br>\r\n\r\nEnlisted to the scene by the effervescent pyrotechnical goddess of wrestling, they start out their careers in the decrepit warehouse that is the Job Cave, an area that serves as a figurative pit stop for the rest of the game. You play the game as Beef and soon find out that all major gangs in the vicinity have erupted into violence and that the mayor's daughter, Libby the helpless gal, has also been kidnapped. With this, the mismatched heroes spring into the fray, and from here you must deal with the SSKKKM, Muslim Mafia, Average Pink Band and the Dark Order of Earls before you can rescue Beef's stalkee- erm, beloved.<br><br>\r\n\r\nThe game is mainly action-based, but also has boss mini-games and elements of 'lock and key' puzzles woven throughout it. Between scenarios, Mega Job makes use of a cunning City Map engine to navigate. Aside from its above average graphics (come now, they aren't THAT bad, Tseng), what stands out about Mega Job is its stunning game play. Not only are the mini-games and general action within the game entertaining, but the game is also quite amusing, as its intention and perhaps most of all, notably fulfills its quota of hysterical people running around. In other words, Mega Job succeeds because it's not only a fun game, but also because Tseng is quite an amusing bastard.<br><br>\r\n\r\nAs aforementioned, this is also possibly Tseng's last ZZT game <i>(yeah, but he's been saying that for the past four games - Funk)<\/i>; which gives you even more reason to play it, for you may never see a game of this uniqueness and quality ever again. It's more than a worthy download, and I think I speak for many of us when I say that I am saddened if it is indeed his final game.<br><br>\r\n\r\nIt is my advice that you download and play it, or teeth shall be gnashed at my end. Yes, that is a threat! ","reviewer":"Kracken","email":"karenlai@froggy.com.au","awardtype":"GOTM"}, {"gamefile":"thief3.zip","shoturl":"","month":"11","year":"2001","review":"Sadly, this review has been corrupted. We are looking for another copy of the original. If one cannot be found, a replacement review will be written. ","reviewer":"Funk","email":"wilko_3000@Yahoo.com","awardtype":"GOTM"}, {"gamefile":"nothing.zip","shoturl":"","month":"12","year":"2001","review":"November saw the release of many nifty games. The completed version of WiL's final game, Pipeline 99, was probably a better reason out of many poorer excuses for why I took my sweet time writing GOTM - (must-play-one-more-level) - I mean; in taking the simple idea of getting a ball into a cup, WiL makes use of an innovative point-and-click engine interface to create a unique puzzle game, which was as challenging as it was inescapably addictive.<br><br>\r\n\r\nWarriors of Seven, a Random Incorporated release, is yet another to receive praises this month. As the first in a series of serious-minded RPGs by Knightt, it sets the atmosphere of the game quite well, weaving a suspenseful plot in the introduction of memorable characters, and whetting an anticipation for what is to come in the next game. <br><br>\r\n\r\nOf course, there can only be one winner. Through the conductance of various needless tests on animals in a cold, dank and smelly laboratory, scientists found that the results invariably correlated with Zanno's sci-fi adventure 'Nothing Constructive'. Generally speaking, I don't really like Sci-Fi games; but Nothing Constructive effectively tossed most of my preconceptions from the 3032nd floor window and onto the superfluously rich citizens below. Serves them right, really.<br><br>\r\n\r\nOne of the more remarkable features of the game is the storyline; budding authors take note, it's definitely one of the most exceptionally written ZZT games I've played. Permission to lapse into an English essay here. The storyline is non- linear and used to great effect in creating suspense and atmosphere, as narrative within the game generally forebodes ensuing events. Upon starting the game, the player is greeted with an introduction that is actually an epilogue in disguise, depicting the consequences of the adventure that is to follow. The characterisation is second-to-none; from Doctor Steve, a somewhat matrix-inspired persona, to Doom the enigmatic Chinese communist to Zanno himself, the characters are unique and oddly multi-faceted, escaping the narrow one-dimension 'clich?' character plane that many ZZT game characters seem to become entrapped in. Zanno's creation of believable, yet still entertaining and at times amusing, worlds (such as a crime-tainted and decadent Earth) provide a story-realistic backdrop; you could almost be there, if you sat close enough to the monitor. Mind you, I have dibs on the starting the next nuclear war if they declare Ebonics to be the universal language of Earth.<br><br>\r\n\r\nZanno makes an unorthodox decision to star in his own game; hence, his life is in your grimy talons as you weave him through streams of bullets and allow him to consume profuse amounts of hard liquor. The game starts Zanno in what looks like a painful situation. Punnily surrounded by Feds and Doom with violent weaponry, he recounts the tale leading up to his dire circumstance; this is where the game starts, with Zanno working menial tasks at the Intergalactic Postal service. Soon after taking out Morris the senselessly happy \"diligent assbolt :D\" with his shiny phase gun, a package arrives delivered by a Fed. The story spirals from this single event; in killing Morris, Zanno inadvertently causes a chain of unfortunate events that is touted as 'Nothing Constructive'.<br><br>\r\n\r\nThe difficulty level of 'Nothing Constructive' is relatively high, in my dubious opinion. I found that one of the final boss duels proved nigh near impossible to win. Arguably, this only makes the game more satisfying to complete. The graphics in the game are pleasing to the eye and appropriate to setting, the usage of grids and metallic colour schemes adds a futuristic edge to the game. Zanno's attention to detail is fairly evident; being utterly anal, I liked various small touches to the game like the occasional sparkling star in the background and the flashing broken 'r' on Ant's bar sign.<br><br>\r\n\r\nBut pretentious drivel aside, it would be more than nothing constructive if you miss out on playing this excellent game. Indeed, Chronos has a worthy contender to his throne of Sci-fi delights. <br><br>","reviewer":"Kracken","email":"karenlai@froggy.com.au","awardtype":"GOTM"}, {"gamefile":"lst.zip","shoturl":"","month":"1","year":"2002","review":"[Sadly, this review was corrupted... -And it still is, for it tainted by Nadir's wretchedness! Uhh, I mean enjoy. - Kracken] <br><br>\r\n\r\nDecember, understandably, is a notoriously slow month for games, while our protagonists molest their turkeys and put little flashing lights into trees to frighten animals and small children. As well as craNKGod's Little Square Thingies, the selected GOTM, honourable mentions should go out to Wayward for Apud Le Medius Res, both a community game and a tribute to a friend of his, and Parallel by Boonob and MadTom, which was released in November but got nudged to be elligible for GOTM nomination in December- a novel idea in which the two authors alternate making boards for the game in a random plot fashion with no continuity, but which still came together in a big ball of love juice. <br><br>\r\n\r\nBut I digress from the main feature of this sordid piece of writing! Now, I know the more cynical among you will correlate the release of Little Square Thingies, the creation of Z2 and the fact that craNKGod has had a major part to play in its creation. That, of course, is crap. FRANKLY CRANK WOULDNT HAVE GOT GOTM IF WE HADNT HAD SUCH A POOR MONTH FOR GAMES =(((( (yes, I am kidding.). The basic premise of LST is that of a puzzle game; sure, there's a plot involving you being in another dimension where you're a demi-god guiding the titular square thingies onto cyan tiles, which is superfluous but does actually add to the experience and gives the game a little purpose (TO BASH CRANKGOD'S SKULL UNTIL HE BLEEDS) which it would otherwise be lacking. Different squares move in different ways; as well as normal squares that move when you tell them to, other types of square rudely move once every two steps, or move in the opposite direction that you tell them to, or even (and at this I AM INDIGNANT) in the direction an arrow states! It is in this world of barbarous non-conformist square that you must cause the <b>DEVOURING OF CYAN TILES FOR THE GOOD OF THE UNIVERSE<\/b> without having your squares shot, trapped or burnt by lava! <br><br>\r\n\r\nAlthough the graphics of this game are mostly ZZTAE random blending, that is not the point of the exercise. craNK has obviously sat down for a fair few hours and plotted out some of these puzzles. Also good is the old (but mostly unused in ZZT games) non-linear method the game is set out in; although one must only play seven levels to complete the game, the set is such that at the end of every level you are given a choice as to which level to go to next. This ensures a copious volume of the ethereal quantity known to the proletariat as \"replay value\" and is something we all must aspire to in our lives! ALSO SATIATING WAS BEATING THE PISS OUT OF TSENG AND CRANK <br><br>\r\n\r\nFor some reason, I really liked the \"perfect circle\" animation at the end, but this is but personal opinion! Nonetheless, it's CLEAVER <br><br>\r\n\r\nSo download this game, it shall enrich your life. ","reviewer":"Nadir","email":"nadir427@hotmail.com","awardtype":"GOTM"}, {"gamefile":"comxmas.zip","shoturl":"","month":"2","year":"2002","review":"Merry RUAHH~! to all, everyone. This is Tseng, and I'm here to review YOUR Game of the Month, this month. <br><br>\r\n\r\nThis was a slow month for ZZT games, with only three main contenders for our monthly award. The first was Lynx's Trapper, a neat idea where you had to encase enemies in boulders to win. A good idea, and not typically something you'd see. The second was Dsone's Lemming Hunter, where you had to run around and trap lemmings in a little cage and hope that they don't bounce out thanks to some of the game's bugs (er, I mean, \"features\"). <br><br>\r\n\r\nBut alas, the third one took it, a cameo-based seasonal romp called \"A Community X-Mas\", programmed collectively by Leamas and Hercules. <br><br>\r\n\r\nThe game features you, the Player, as you visit a big cabin filled to the brim with enough ZZT cameos to make people just a little bit happy. And.. uh, it goes from there, I guess. I mean, it's a seasonal cameo game, do you expect some sort of decent plot? Probably not. <br><br>\r\n\r\nActually, enough bashing, more praising. The graphics in this game are incredibly good. You can't really go wrong in graphics when you've got Leamas and Herc working on it, I'll say that. The ovehead view of the cabin is sweet, and the picture of the butler is also sweet. Then again, I had the sinking feeling that I was going to find JohnWWells slumped over on his chair, a knife in his back, and we all blame the butler, but eh, no such luck. <br><br>\r\n\r\nThe game's play is generally just you running around, talking to the various ZZTers, and solving puzzles. In other words, typical Hercules gameplay, really. Well, if there's anything about this game, it's the fact that it can be humorous. Some of the banter that goes on in this game is sort of odd, though, especially given the fact that many of the cameos are rather inaccurate (LEAMAS, I WILL *KILL* YOU). <br><br>\r\n\r\nDo I have any idle complaints about this game? Absolutely. <br><br>\r\n\r\n<b>THE CAMEOS ARE INACCURATE!!!!!!!!!!!!!!!!!<\/b> ( <i>I don't even LIKE snowmen, let alone build sentient ones. - MadTom<\/i> )<br><br>\r\n\r\nOh, and the game can be a bit plodding, but this is coming from the guy who made November Eve, so I'll just kind of skip that subject... Yeah...<br><br>\r\n\r\nSo, uh, all in all, A Community X-Mas is a nice little game that you should play. Yeah. <br><br>\r\n\r\nCan I go to the Bahamas, now, like you promised, Funk? <i>(Sure, I need a servant to bring me my drinks - Funk)<\/i>","reviewer":"Tseng","email":"renner@iwo-online.com","awardtype":"GOTM"}, {"gamefile":"zemx.zip","shoturl":"","month":"3","year":"2002","review":"Hello, everyone. This is Tseng, once again, and it's time to fill out my monthly duty on Z2 before I go back to whatever I was in the middle of. <br><br>\r\n\r\nNewt had previously made other Zem games, and before I touch on this, I want to touch on those two games. Zem! and Zem! 2 were actually Lemmings-style games. The problem was that some people felt that they were similar to Kuo Yen's Koopo the Lemming, which was in production at roughly the same timeframe. After releasing the Zem! Level Pack, it seemed that Newt disappeared off the face of the Earth. <br><br>\r\n\r\nThen came Zem! X. <br><br>\r\n\r\nZem! X did away with the Lemmings format and instead came up with an interesting setup where you hunt down the lemming and capture him by shooting him. It's different, simpler, and quite a bit more fun than the original format of the game.<br><br> \r\n\r\nYes, this is is an engine game, but a fun one. <br><br>\r\n\r\nThe game has virtually no bugs and runs very smoothly. The game has a sense of urgency at many points and requires some quick movements, or you or your lemming are dead. If there's one thing I *could* be miffed about, it's the fact that you have to move off of the directional controls so you can fire, though I guess that's good, since running and shooting at the same time is like drinking and driving, or running with scissors <i>(Or running with drinks. Have you ever tried that? Goes everywhere - Funk)<\/i>. <br><br>\r\n\r\nOr something. <br><br>\r\n\r\nIt's true that the graphics are nothing to write home about(except the last level, I thought they were good there), but that's to be expected from an engine game. <br><br>\r\n\r\nOh, and don't expect a plot. <br><br>\r\n\r\nYou should expect some kickass gameplay and an interesting action\/puzzle game. Download it now, you'll enjoy it as much as I did. ","reviewer":"Tseng","email":"renner@iwo-online.com","awardtype":"GOTM"}, {"gamefile":"slimeline.ZIP","shoturl":"","month":"4","year":"2002","review":"Well although Struggle for Balance and Soda came top of the polls for this month, the committee's votes mostly swung towards Kaddar's reaction-tester Slime Line.<br><br>\r\n\r\nA version of the Snake game you lot have no doubt seen on someone's mobile phone, Slime Line's strengths certainly don't lie in its plot. You're a slug, right? And there's this island, and you leave a slime trail and... uh...<br><br>\r\n\r\nNope, Slime Line's appeal comes from its gameplay which swings between exhilerating and exasperating. Basically, you have to last for a set number of seconds on a level, all the time leaving a - who'd of thunk it? - slime line behind you. If you crash into the walls, you die. If you crash into your slime trail you die. If you blink, you die. Because this is a difficult game.<br><br>\r\n\r\nOh yes, the difficulty: Slime Line is quite simply the toughest ZZT game I've ever played, and the biggest challenge comes from mastering the engine, which is sadly a little unresponsive. However, from beta-ing the game I know that it's as responsive as it could possibly get, and once you get used to the rhythm of the key presses the game becomes a hell of a lot easier. Even then it's reallly hard though, because through the 7 acts (each comprising a series of sub- and bonus levels) Kaddar adds a series of extra obstacles; trigger switches, boulders; even enemy slugs to confront. Add to this colourful graphics and a RIDICULOUS amount of levels, and we have a definite Game Of The Month!","reviewer":"Funk","email":"Wilko_3000@Yahoo.com","awardtype":"GOTM"}, {"gamefile":"burglar!.zip","shoturl":"","month":"5","year":"2002","review":"MadTom's \"Burglar!\" is not only the best ZZT game released this month - by a substantial margin - it is, in my opinion, the best game released so far this year. In terms of plotting and gameplay, \"Burglar!\" is one of the most polished ZZT games I have seen in a long time. <br><br>\r\n\r\nThe plotline, which begins simply enough, is proof positive of the first law of ZZT writing: originality isn't half as important as execution. The skeleton of the plot is certainly familiar (\"You are a thief. You perpetrate a series of burglaries and discover a conspiracy.\"), but the personality that MadTom injects into the story keeps it clever and fresh. Some games have you attempt to clear your name of a crime you didn't commit; this one has you pick the pockets of 40+ people in a matter of minutes to PROVE that you're a Fun Lovin'\/Smooth Criminal. There's no artifact-repairing, space station- destroying, newbie-bashing tripe here. <br><br>\r\n\r\nThe gameplay is largely inventory-engine based, and implemented very well. The puzzles make logical sense, fit into the story, and are in character (you CAN take everything that isn't nailed down - it's your job). Building in difficulty and intensity, the problems you face work up to a satisfying tenseness in the final mission. <br><br>\r\n\r\nIs there anything wrong with \"Burglar!\"? Well, there is some \"learning by dying,\" and there ARE a lot of instant deaths - but that's all part of the job description. The only other problems of note are some weak spots in the writing, and two unnecessary and downright sadistic safecracking puzzles, which require sharp hearing, a working PC speaker, and a lot of patience. Or the editor. The editor is good, here. Use the editor. Oh, and one puzzle in the final mission is a just a bit picky as to where you should be standing to use a certain object. <br><br>\r\n\r\nBut these relatively minor problems shouldn't keep you from playing this excellent game - \"Burglar!\", the GOTM for May. <br><br>\r\n\r\n(Good boy, MadTom! Have a biscuit.) ","reviewer":"John Wellington Wells","email":"kokolhe1@yahoo.com","awardtype":"GOTM"}, {"gamefile":"merc.zip","shoturl":"","month":"6","year":"2002","review":"Most of the time ZZT RPGs are nothing like 'proper' RPG games; they may have the usual fantasy settings, the odd turn- based battle and perhaps a castle or two, but that's usually where the comparisons end. In The Mercenary, however, WCB (for it is he) has managed to include the kind of complex RPG bells and whistles in The Mercenary that most people would think impossible to create in ZZT. <br><br>\r\n\r\nThe gameplay is the usual dungeon-crawler fare - slay monsters, get gems etc. - but WCB has made things a little more complex by including a 'level' system. Each time the you kill a monster, you'll get a little more experience. Getting enough experience allows the player to move up a level, just like in traditional RPGs. The higher the level, the stronger the player's character becomes. This allows you to carry more ammo and torches, and increase your maximum health. Further innovation comes from the choice of a \"relic\" at the start of the game. This is a special item that gives the player certain abilities, thus changing the course of the game. The lockpick allows you to enter, um, locked doors, the Gauntlet provides superhuman strength so that you can smash boulders, and the rope allows access to otherwise unattainable areas. Depending on which you pick, the game will proceed in a different direction, thereby adding to the replay value that I hear is so popular with the kids these days. <br><br>\r\n\r\nStructurally, it's very similar to Diablo - the player begins in a small town, before proceeding to kill monsters in a series of nearby caves an catacombs, eventually destroying the evil at the heart of the dungeon. This, however, is its biggest flaw; Whilst Diablo's simplicity and lack of plot was made compelling by the various weapons and armour that could be found, The Mercenary has no such options, so the player has no real drive to complete the game, except to build up the statistics. That's not to say you won't find it fun to play, just that the lack of a plot sometimes drags a little. <br><br>\r\n\r\nAside from this, The Mercenary is a well-crafted, excellently programmed and cleverly designed game and certainly worthy of this month's GOTM. \r\n","reviewer":"Funk","email":"wilko_3000@yahoo.com","awardtype":"GOTM"}, {"gamefile":"oprgv1.zip","shoturl":"","month":"7","year":"2002","review":"For a review of this game, go to <a href=\"http:\/\/zzt.the-underdogs.org\/mtp\/awards\/june02.html\">MadTom's Pick - June 2002<\/a>.","reviewer":"MadTom","email":"madtom@comic.com","awardtype":"MadTom's Pick"}, {"gamefile":"magicflamingo.zip","shoturl":"","month":"8","year":"2002","review":"For a review of this game, go to <a href=\"http:\/\/zzt.the-underdogs.org\/mtp\/awards\/july02.html<\/a>MadTom's Pick - July 2002<\/a>.","reviewer":"MadTom","email":"madtom@comic.com","awardtype":"MadTom's Pick"}, {"gamefile":"livedead.zip","shoturl":"","month":"9","year":"2002","review":"For a review of this game, go to <a href=\"http:\/\/zzt.the-underdogs.org\/mtp\/awards\/august02.html\">MadTom's Pick - August 2002<\/a>.","reviewer":"MadTom","email":"madtom@comic.com","awardtype":"MadTom's Pick"}, {"gamefile":"sids.zip","shoturl":"","month":"10","year":"2002","review":"For a review of this game, go to <a href=\"http:\/\/zzt.the-underdogs.org\/mtp\/awards\/september02.html\">MadTom's Pick - September 2002<\/a>.","reviewer":"MadTom","email":"madtom@comic.com","awardtype":"MadTom's Pick"}, {"gamefile":"defender.zip","shoturl":"","month":"3","year":"1999","review":"","reviewer":"","email":"","awardtype":"cGOTM"}, {"gamefile":"ffxtreme.zip","shoturl":"","month":"4","year":"1999","review":"I decided to make Final Fantasy Extreme the classic of the month, because I've thougth for a long time that it was the best ZZT game out there. Sadly enough, this game never was all that popular as it needed to be, but I hope this review will draw its attention once again.<br><br>Final Fantasy Extreme is a remake of MKintaro2's Final Fantasy ZZT. Luke Drelick improved the graphics to one of the highest levels. Some of the boards look utterly wonderful, even better than the best of Buck Russel's graphics.<br><br>The game is really FF-ish, with lots of towns and characters and a funny, neato plot. You'll visit places like OrchestChoir (the starting village), weird caves, Versailles (yes, that's French) and even the Everglades National Park.<br><br>Just be sure to play this ZZT master-piece by Luke Drelick! ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"ghuntrse.zip","shoturl":"","month":"5","year":"1999","review":"","reviewer":"","email":"","awardtype":"cGOTM"}, {"gamefile":"death.zip","shoturl":"","month":"6","year":"1999","review":"I've picked _Death_ by Darren Hewer as the Classic of the Month. This game is probably the only Autumn Dreams ZZT release. IMO, this game never got the attention it should have had.<br><br>_Death_ is a mystic action game. You wake up in a dark and odd world... there's a path leading to a castle in the distance. Is the a delusion or is this world real? Might this be caused by the drugs given to you by your enemies when you were captured? All you remember is that you were in a war that went on like forever... you were placed in a concentration camp. What will happen now... play to find out.<br><br>This game resembles Blue Magus' games like Asmodeus and Dungeon Master's Gallery, so if you liked those games, you certainly will enjoy this one. It has got good graphics, but that's not the most important point in this game - that's probably the atmosphere, which is really threatening.<br><br>Anyway, I think you should play this action game, because it is really good.","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"driff.zip","shoturl":"","month":"7","year":"1999","review":"","reviewer":"","email":"","awardtype":"cGOTM"}, {"gamefile":"fury.zip","shoturl":"","month":"8","year":"1999","review":"Fury Spell is a very well done RPG by eJECTION13. I never heard anybody saying it was good, so I decided to make it Classic Game of the Month, since it *is* very good.<br><br>Fury Spell is about an apprentice (you), who's trying to become a White Wizard. One day you smell evil around. When you go down the stairs, you see Makan the Wizard dying and Jaren (other apprentice) dead on the floor. The adventure starts...<br><br>This game has well-done graphics (in the style of Warlord's Temple) and the plot is good as well. The game features a nice eperience points system and good RPG battles with a lot of nifty spells.<br><br>Too bad eJECTION13 isn't really around anymore (I guess he silented slipped away from the scene), because he made very good games. Go play Fury Spell, for it deserves the praise.","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"wartorn.zip","shoturl":"","month":"9","year":"1999","review":"This month, Wartorn is the classic game of the month. Recently I played it again and I thought it deserved being classic game of the month.<br><br>Wartorn's plot is really strong and cool. A country being threatened, a country at war... and then 5 years later... You are Kyle, a young guy who lives in a fort (where all people were brought to by the government for safety). Since you are old enough you need to enlist and then the adventure starts...<br><br>I will keep the rest of the plot a secret, since it's really great and full of twists. Wartorn has, except for a great plot, good graphics (especially for that time - they are a little outdated today) and a very good soundtrack. I was surprised to hear some many good songs by Madguy - I didn't know he was such a good composer.<br><br>If you haven't played this classic game already, you should do that soon. It's a very good game (it was the reason that Madguy got into Damage Inc).","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"compound.zip","shoturl":"","month":"10","year":"1999","review":"Blue Magus returned to the ZZT scene on October 25 in 1998. This day has been named Bluelloween by him. Formerly he used to be known as ZZTurbo, a name which all oldbies among us will certainly remember. Compound was released in Blue's Canid Productions time, shortly after he returned to the scene. It never got the attention it deserves, so that's why I made it Classic Game of the Month.\r\n<br><br>\r\nThe Third World War raged on planet Earth. An entire generation has been eradicated. The generation of today, one of peace-loving young adults, has built up a new society. Their city, Renessiance, is situated in the rainforests of South America. It is dedicated to science, art, poetry, peace and learning. They live in harmony with nature.\r\n<br><br>\r\nYou are a messenger and collected data on weird lights in the sky, which were observed with the big telescope of the observatory. Now you need to deliver this data to an underwater lab. This is where your adventure starts...\r\n<br><br>\r\nCompound has a very unique graphics style, which looks very good in most boards (there are a few exceptions, but it's nothing big). The story is well-written and quite original. The game also features some good programming, like a groovin' submersible engine.\r\n<br><br>\r\nIf you didn't give Compound a try yet, I do recommend that you download and play this classic by Blue Magus.","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"kamek.zip","shoturl":"","month":"11","year":"1999","review":"Kamek is a game, which is maybe a bit too new to be a classic, but I chose it anyway, because I think it deserves the extra bit of attention. It's made by CoolZx, who's best known for his series of \"Infestation\" games and add-ons. It's been released under both the Infinity Incorporated and Reptile House banner.\r\n<br><br>\r\nThe game is a classic example of a \"temple\" game. What I mean with that, is that this is a game in which you have the explore a temple filled with tons of traps and dangers. The game lacks a real introduction or something: You just start in the temple and start exploring! \r\n<br><br>\r\nI mainly like this game for its great gameplay. I've always loved games filled with traps like this one. The puzzles are a bit difficult, but that's always better than too easy. Added are some above-decent graphics too. This all makes this a game a classic, I think.\r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"pheonix.zip","shoturl":"","month":"12","year":"1999","review":"A game which was released in 1997. The Phoeix Reich is the second chapter in a trilogy of games dealing with happenings after World War 2.\r\n<br><br>\r\nThis game deals with the happenings after the second World War. You are to stop Hitler who once again tries to take over the world with his reich. Halogen obviously knows a lot about history, as the story seems \"real\" in some strange way. \r\n<br><br>\r\nThe thick plot is the best part of the game. Halogen has managed to write an extremely professional story, which really \"sucks\" you into the game (something otherwise only Rhygar and Chrono Wars can do). The graphics are great too, and Halogen uses a lot of original ways of fading\/shading which adds a special atmosphere. The only thing which is a shame is that the third part of the trilogy has never been released, and probably won't ever either. This way, we'll never know how this fantastic story ends... \r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"overflow.zip","shoturl":"","month":"1","year":"2000","review":"This month's classic is Luke Drelick's first released Duky Inc. ZZT game: Overflow. Overflow is the remake of the second chapter in which was going to be a 10 chapter Chrono Trigger series.\r\nOverflow centers around a boy named Charlie. He has to stop Acholon, a beast which controls time by either killing it, or finding a time machine and stop the evil.\r\nOverflow (released at the same date as Matt Williams' Warlords Temple) is a typical \"Luke Drelick\" type of ZZT game. That means: Lots of action (pre-fab enemies, don't let this scare you away though :), an RPG-ish storyline and sparkling graphics. This game has two different paths of playing, resulting in two endings.\r\n<br><br>\r\nOverall, I think the game is really good. If you are a fan of Luke Drelick, like me, of course you already have it, and otherwise I really recommend you to get a copy.\r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"burgerj.zip","shoturl":"","month":"2","year":"2000","review":"Burger Joint. It's already almost two years ago that this masterpiece made by Madguy was released. Time flies when you're having fun, I guess :). This game was released during the glory days of Damage Incorporated, when a lot of cool ZZTers like Bongo and darkmage were still around.\r\n<br><br>\r\nThe game concept itself is amazingly simple: You (Johny) are hired as an employee in a fast food restaurant, and you'll have to do all kinds of jobs to make sure the restaurant keeps running, and the customers stay happy! The entire game is played on basically one board (in fact there are more boards, because else the board size would become way to big).br> \r\nThe game plays really neato, and the moment you start, you'll keep playing until you've finished it. Conclusion: Great gameplay :) The graphics are nice, nothing amazing, but they are not too important in this game. This game is a true classic every ZZTer, newbie or oldbie should have played. \r\n","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"BLDOATH.zip","shoturl":"","month":"3","year":"2000","review":"In 1998, Nivek seperated from the then superior ZZT company Damage Inc and formed his own company FFF Interactive. The company had a lot of members and Nivek made this Classic Game of the Month, Blood Oath, together with some of the other FFF Interactive members. However, when Nivek quit ZZT, he announced that all the other members of FFF Interactive were fake. Nivek was actually the only member. A weird story, but now for the review.\r\n<br><br>\r\nA powerful archmage once longed for more power - he wanted to become a god. In order to do so, he had to travel to the labyrinths of Lede and face the anicent Wyrm Dauyath. He failed in his attempt for power and perished. Now, many years later, you (Laeraf the Dark), the archmage's apprentice, are going to try to slay the Wyrm Dauyath to gain its ultimate powers. Before Laeraf's master left to face Dauyath, drew a drop of each other's blood and swore an oath - the Blood Oath. If Laeraf's master didn't survive, Laeraf had to face Dauyath himself later. And Laeraf's master did die - now's time for you to face Dauyath yourself... \r\n<br><br>\r\nBlood Oath is a dungeon-exploring game and a good one too. The graphics of the dungeon itself are simple, but the cut-scene graphics are awesome. The story may seem a little weird, but it turns out to be pretty good. The ending of the game came as a complete surprise to me (you'll see what I mean if you play the game). \r\n<br><br>\r\nBlood Oath is one of the games that deserves a little more attention. If I didn't read a review of this game by Zenith, I wouldn't even have known of its existence. If you haven't seen this classic piece by Nivek, download it today. \r\n","reviewer":"Nivek","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"xod.zip","shoturl":"","month":"4","year":"2000","review":"Dexter released the puzzle game Xod quite a while ago (April 1999). Decent ZZT puzzlers are hard to find... Xod is one of them. It was released under the Reptile House banner. \r\n<br><br>\r\nXod is the big daddy of Dexter's BoulderXod game(s), which were released later on. The game consists of three puzzle mini-games: BoulderXod, TuneXod and QuizXod. \r\n<br><br>\r\nBoulderXod is a Sokoban-like game for ZZT, which means you have to push boulders onto templates in order to finish the levels. If you've ever played Sokoban (or a game similar to it) and liked it, you can be pretty sure you'll find this enjoyable, too. \r\n<br><br>\r\nTuneXod is the music puzzler of the game. You'll hear an object pumping out some tunes and you have to guess what notes they are. Of course, a lil' tutorial is recommended. \r\n<br><br>\r\nThe last mini-game is QuizXod, which exists of a bunch of multiple choice questions. It's not really puzzling, but it's quite fun to do, really. \r\nOverall, Xod is an enjoyable puzzle game with some good graphics and funky music. \r\n","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"warlock.zip","shoturl":"","month":"5","year":"2000","review":"The Kingdom of Pleana was a very peaceful place until an the evil warlock Daimon came. He captured one of the king's daughters, princess Daisy, and took her to his dark castle. Princess Rose and princess Lily tried to rescue here, but never returned. The king offered a reward for whoever rescues his daughters. Two adventures embarked on the journey, but did not return either. Then... you tried to be more succesful, by entering Castle Shadow yourself, the Warlock Domain...\r\n<br><br>\r\nThe style of this game can be called \"olschool-puzzle-adventure\". You'll have to explore a really big castle, and solve tons of puzzles along the way. They are not the type of puzzles of games like Nightmare or Xod, but more the \"pick things up, and doing things which changes things elsewhere\" :) style. Quite enjoyable, and really challenging, I must say.\r\n<br><br>\r\nAlong the way, there's also some action, like a couple of RPG battles. The RPG battles aren't that special, they are the normal turn-based style, but they're not that bad either. The graphics are not that fantastic, they are STK, but all rather simple, kind of like the first episodes of Chrono Wars. Cool things: You can kill most people in the game, even the good guys :), and there's a couple of endings! \r\n<br><br>\r\nThis game is a side-story to Htrae, Alan's \"larger\" project. I do hope he is ever going to finish that. A demo was released some time ago, but after that I never heard from Alan anymore... If you like some old-fashioned adventure\/inventory-style puzzles, you should really give Warlock Domain a try. \r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"merbotia.zip","shoturl":"","month":"6","year":"2000","review":"Merbotia is a game released somewhere in 1995 by Sonic256, a dude who was in ZZTurbo\/ZPower Productions, but mysteriously disappeared some years ago.\r\n<br><br>\r\nMerbotia tells the story of a boy named Player. One day when he wakes up, he isn't on Earth anymore, but on the planet of Merbotia. The king here tells him that Earth was created by the Merbotians just to produce him, so he could kill a beast called Quatsh, which is a threat for the Merbotians. After you kill the beast, the storyline gets pretty trippy, but you'll have to see that for yourself.\r\n<br><br>\r\nThe graphics are pretty bad for nowadays standards, but back when this game was released they were pretty keen, I think (judging from review scores for graphics in old ZZT and MZX magazines). The storyline is pretty trippy. Yet what makes this game worth Classic Game of the Month is something called nostalgia. Playing this game is like listening to the first Thunderdome CD :). \r\n<br><br>\r\nThose of you that don't get nostalgic feelings just by looking at this game's funky title screen probably won't agree with me :). \r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"endofwor.zip","shoturl":"","month":"7","year":"2000","review":"\"It's the End of the World\" it's a true classic, made looong ago, back in the old days of Helios Entertainment. This probably won't say much to relatively new people out there, but for some oldbies, it may be very nostalgic. As for me, it was one of the first few games I loved. \r\n<br><br>\r\nThis game doesn't have a that great plot, but for some reason it's still fun. Maybe the basic plot about the world being threatened by a huge coment adds to the classic feeling of the game. \r\n<br><br>\r\nThe game starts off with a really nutty title screen. I'll never forget the joke about Independence Day. Overall, the game's pretty funny, too. \r\n<br><br>\r\nThe graphics would be called mediocre these days, but try to imagine what is was back then, in 1996. For that period, it looks quite nice. Fading wasn't that commonly used back then and this game does have fading. \r\n<br><br>\r\nIf you were around in 1996, you've probably played this game. I suggest you just play it again for nostalgia's sake. If you haven't been around for that long, you could still give the game a try. It's a true classic and deserves to be played. \r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"ghunter.zip","shoturl":"","month":"8","year":"2000","review":"Interactive Fantasies is probably the best ZZT company ever, or at least since Software Visions. Herc, the usual GOTM\/CGOTM reviewer, decided never to let anything out of his company be honored as a GOTM, most likely to avoid arguments, and Gem Hunter 3 went by unmentioned. Now that Herc is away on vacation, I decided it was time to be nice and give my old buddy, tseng, the GOTM he never received, but deserved. \r\n<br><br>\r\n... I'm not going to bother getting into great detail, because it's obvious that this game would be cooler than you (\"By default, I am cooler than you.\" - tseng), due to the success of the GH series and tseng name. GH3 has the usual classic Gem Hunter gameplay, except with a level-select system, Mega Man style. Pick a foe, kick some ass. Each bastard has his own world of gems and fun, and after you beat them all, you get to chase down the disguised final enemy (Which isn't me. ... But at least I was a boss!), in the next game file. Bah. GH3 has a decent plot, which is unusual for most tseng games, and tseng made the music himself. \r\n<br><br>\r\nMy only complaint is the lack of the classic Gem Hunter: SE tune, which would've been awesome for nostalgia. But, hey, this game kicks ass, and is the best damned tseng game to date (unless you're a rabid November Eve fan). Take a look, morons and maniacs. \r\n","reviewer":"Knightt","email":"zztknightt@home.com","awardtype":"cGOTM"}, {"gamefile":"zztris.zip","shoturl":"","month":"9","year":"2000","review":"This month's choice fell on a small mini-game that should not be overlooked: ZZTris, by Masamune\/Mwasson.\r\n<br><br>\r\nZZTris is a Tetris engine for ZZT, something what only a few programmers have tried to create and sadly, they all failed. Masamune, however, managed to do it, which is awesome. Needless to say, this is a programming masterpiece. \r\n<br><br>\r\nZZTris is just like Tetris: you get blocks (in different shapes) which start falling down. On their way down, you can rotate them. Your goal is create \"lines\", get score and keep your field clean. Well, you probably all know the story... ZZTris features three difficulty levels: easy, medium and hard. \r\n<br><br>\r\nThe engine gets stuck sometimes and sometimes it also causes ZZT to get a run-time error. There's nothing much to do about the run-time errors. It's very hard to put such a complex engine into one ZZT board with a limit of 20k. \r\n<br><br>\r\nThe graphics are very poor, but it doesn't really matter. It's all about programming here. Smiley14 (who was still Smiley13 back then) made better graphics for the engine, but they got lost due to another run-time error. \r\n<br><br>\r\nOverall, this mini-game is a great achievement and should definetely be in every ZZTer's collection!\r\n","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"lostmonk.zip","shoturl":"","month":"10","year":"2000","review":"Lost Monkeys is a very old ZZT game made by Chris Jong. Those who have studied their ZZT history lessons well, probably remember that Chris was a member of the ZZT Club part 2 on Prodigy; the very first ZZT \"company\" (well, sort of). Chris' The Long Voyage series for SuperZZT belong to the first few ZZT\/SuperZZT games not made by a real-life friend that I ever played... Lost Monkeys is, in my opinion, Chris' best game for ZZT.\r\n<br><br>\r\nIn Lost Monkeys you must find the two monkeys, Adam and Daisy, of professor Dave back. They fled when the professor wanted to give them a strength injection. The genre of this game is the typical \"classic action\/adventure\", a genre that isn't made much any more nowadays. In these games there usually isn't a really strong storyline; you simply have to visit a lot of places, find items and kill enemies along the way. \r\n<br><br>\r\nThe cool thing about this game is that, even though they are pre-STK, the graphics aren't that bad. There's even some basic fading in it, and that for a game made in 1992-1993! The enemies you'll encounter are all object-enemies, and there's a nice attack-stats bar below in the screen while fighting.\r\n<br><br>\r\nOverall, this game will probably not appeal to all people. But if you like the classic type of ZZT game, then this is one you ought to have played...\r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"v0mit.zip","shoturl":"","month":"11","year":"2000","review":"\"you tighten the leather strap around your forearm, anxiously pulling off the needle cap. without any hesitation whatsoever, you slam the needle into your wrist--the old familiar sting. ahh, yes, 'tis good shit, indeed...you feel mellow. mellow. ohh, the mellowness. you feel yourself tripping.\" \r\n<br><br>\r\nRemember these lines? Yes, this month's CGOTM is Edible Vomit, the ultimate trippy ZZT game by Draco. \r\n<br><br>\r\nYou play the role of Freddy the Ferret, a funny lil' animal in search for the perfect drug. As mentioned in the quote above, you inject drugs into your arm with a needle. You vomit and want to get outside for some fresh air, but then you start seeing all kinds of weird visions. This trip has only started. Freddy's in a different world now... \r\n<br><br>\r\nEdible Vomit is game in the genre of Kudzu (by clysm) and POP (by tucan) and it's a good one, too. On Freddy's \"adventures\", you'll see mushroom-shaped houses, the Bur-Lynn wall, the happy meadows and a few other really weird places. \r\n<br><br>\r\nThe graphics of this game are really cool and definitely add to the game's trippiness. They have this trippy, happy and lush touch to them. Also, Draco put together a good soundtrack. What also intrigued me is the interesting title screen (I think I even nominated it for \"Best title screen\" in the Hoodian Awards 1999). \r\n<br><br>\r\nOverall, this is a classic (though not as \"classic\" as a game like kudzu) that you should really have played. \r\n","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"voyage1.zip","shoturl":"","month":"12","year":"2000","review":"This month's cGOTM wasn't made for zzt, but SuperZZT. \"A SuperZZT game?\", you might think. Yes. Many people forget that z2 is a site about SuperZZT too, and personally I think that SuperZZT should get more attention than it currently has. The Long Voyage was, apart from the standard SuperZZT game Monster Zoo, the first SuperZZT game that I ever played. It's made by Chris Jong, and was released in 1992 during Prodigy' ZZT club period (for more information about this club check out the feature on the IF page). \r\n<br><br>\r\nThe player of this game, Dave Exmeno, was taking an ocean boat ride together with his girlfriend Penny. Then, someone took you and threw you off the boat! The goal of the game, of course, is to get back to the boat and save your girlfriend. \r\n<br><br>\r\nThe thing that makes this game the classic that it is, is pure gameplay. From the moment you strand on the first isle, after you have been thrown from the boat, a flow of small puzzles, shooting parts, exploring and other things often present in the classic type ZZT games, will flood the player. For some reason, this makes the game extremely playable. Furthermore The Long Voyage is also a pretty long game, so it can occupy you for quite some time. The graphics of this game are nice, not fantastic, but certainly better than mediocre... Tossed in are also some cool bits of music and sound effects. \r\n<br><br>\r\nAll in all, I think The Long Voyage is the most fun SuperZZT game I ever played. Chris has created the type of game that suits SuperZZT best. Anyone who likes SuperZZT should definitely play this one, for it is a true classic. \r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"Sombrero.zip","shoturl":"","month":"1","year":"2000","review":"This month's classic game of the month goes out to Sombrero. Sombrero was Dark FLR's first game, which was released in late 1998. After Sombrero Dark FLR made another game (Seranade), the first few issues of the magazine ZZTV (now continued by Zenith) and the really neato tool ZZT Piano. After this, he disappeared from the ZZT scene again. Sombrero is probably the best of the two games he made. \r\n<br><br>\r\nIn Sombrero you assume the role of a young boy, who's living in a small town in the desert. When you were only six yours old, your father was murdered. Your grandfather took over your custody, and since that moment he has raised you. But alas, he gets murdered, too. You swear revenge, and start a journey to find the killer... This turns out to be quite a nice story, with a couple of plot twists along the way too. \r\n<br><br>\r\nThe thing that's special about this adventure are the battles. Instead of RPG battles like most adventures have, this battles uses \"sombrero battles\". Whenever a conflict between you and somebody else arises, the two of you go throw sombreros at each other to decide who is right. Quite innovative. However, the controls tend to be a bit irresponsive, which makes the fights are really hard (maybe too hard).\r\n<br><br>\r\nThe graphics of this game are really nice too, especially considering this game was released in 1998. A little downpoint of the game is that there's no sound and music, but hey, in 1998 there weren't any WiLs or Jacob Hammonds around to make great music :). Overall, this is a really cool game which definately deserves the download if you don't already have it, or the dust-off if it has been two years since you played it. \r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"c-world.zip","shoturl":"","month":"2","year":"2001","review":"This month's choice for the classic game of the month fell on Cyber World. Cyber World is a pretty old game, it dates from 1996, made by James Wong. James was known as Multi and Raptor when he made this game, later on he changed that nick to Cygnus, and under that name he has been in a couple of cool companies; the legendary Software Visions, Dynamic Games and Interactive Fantasies. Cyber World was his first released game, and (besides a demo of his MegaZeux game Azeroth), he didn't finish any other games after this. \r\n<br><br>\r\nIn this game you assume the role of a kid named Josh Swiz. Throughout the game you find out the boss of your father (who works at a company which produces glue) is planning some not-so-nice stuff. You, of course, have to prevent that, together with your friends Chris and Gary. The storyline and other parts of the game bear great resamblence to Code Red, which must have been an inspiration for James Wong (and for many other ZZT authors back in that time). \r\n<br><br>\r\nThe graphics of this game are nice, especially considering that it is already 5 years old; Cygnus has uses lots of Super Tool Kit and fading. Some nice tunes are tucked in too, which is cool. The gameplay is nice too, and overall, the game just gives me a nostalgic feeling. If you haven't played it, you should really check it out once; it's cool! \r\n","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"sombrero.zip","shoturl":"","month":"1","year":"2001","review":"This month's classic game of the month goes out to Sombrero. Sombrero was Dark FLR's first game, which was released in late 1998. After Sombrero Dark FLR made another game (Seranade), the first few issues of the magazine ZZTV (now continued by Zenith) and the really neato tool ZZT Piano. After this, he disappeared from the ZZT scene again. Sombrero is probably the best of the two games he made. <br><br>\r\n\r\nIn Sombrero you assume the role of a young boy, who's living in a small town in the desert. When you were only six yours old, your father was murdered. Your grandfather took over your custody, and since that moment he has raised you. But alas, he gets murdered, too. You swear revenge, and start a journey to find the killer... This turns out to be quite a nice story, with a couple of plot twists along the way too. <br><br>\r\n\r\nThe thing that's special about this adventure are the battles. Instead of RPG battles like most adventures have, this battles uses \"sombrero battles\". Whenever a conflict between you and somebody else arises, the two of you go throw sombreros at each other to decide who is right. Quite innovative. However, the controls tend to be a bit irresponsive, which makes the fights are really hard (maybe too hard).<br><br>\r\n\r\nThe graphics of this game are really nice too, especially considering this game was released in 1998. A little downpoint of the game is that there's no sound and music, but hey, in 1998 there weren't any WiLs or Jacob Hammonds around to make great music :). Overall, this is a really cool game which definately deserves the download if you don't already have it, or the dust-off if it has been two years since you played it.","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"freedom.zip","shoturl":"","month":"3","year":"2001","review":"Freedom SE, the graphical remake of the original Freedom is a great piece of art and music, which got all recognisition during the 1999 Interactive Fantasies Annual ZZT Excellence Awards and Hoodian Awards. We all knew kev-san was a great musician, but this was definitely his breakthrough. It is a shame kev-san is only rarely seen around these days.<br><br>\r\n\r\n\"Those who are about to rock salute you.\"<br><br>\r\n\r\nI won't easily forget this quote, which is the opening sentence of the game. This leads you to the introduction, of a young man falling down, accompanied by a beautiful text about freedom.<br><br>\r\n\r\nkev-san himself described Freedom as a rock opera, which suits the game well. It's full of deep thoughts and beautiful ZZT music (as far as ZZT music can be beautiful).<br><br>\r\n\r\nThe graphical remake is also a good improvement over the original, since Blue Magus has provided the extremely original game with amazing artwork, that is true Anthony Testa style.<br><br>\r\n\r\nFreedom gives you something to think about and something to listen to while thinking about it. In my opinion, it's definitely one of the best artistical ZZT games. And by saying that, I don't mean to say it has the best graphics remember that art isn't all about graphics. The dialogue is as important as the accompannying art and music.<br><br> \r\n\r\nIf you haven't given this game a try yet, it may be a good idea to do so once, unless you don't like to watch instead of play.","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"ppdv.zip","shoturl":"","month":"4","year":"2001","review":"This month, we finally got to see Viovis' absolute masterpiece, Purposedly Protected (or Produced) Dynamic Visualties II, after a good 2.5 years. In my opinion, it's a piece of art by Viovis himself, whom I prefer to refer to as an poetic artist, instead of a programmer. It just lost the GOTM race to Chuck's Los Refritos 9, but in celebration of the fact that we finally got to see PPDVII, I have made its predecessor, PPDV, Classic Game of the Month.<br><br>\r\n\r\nPPDV, also known as Purposedly Produced\/Protected Dynamic Visualties, was released a few years. Back then, he already released some artistical games that defined a new genre, but PPDV was his biggest work to date. With PPDV, Viovis showed he is a true artist and a master of trippiness. And it's the trippiness that made Viovis' style unique. <br><br>\r\n\r\nWhat is PPDV like? It's mainly a weird, but intersting story told by using art boards and pieces of text. There is no real gameplay -- it's looking, and being amazed or tripping or even being confused.<br><br> \r\n\r\nPPDV's art is weird and highly trippy. Some of the art boards may not be good-looking, but towards the end Viovis shows some mighty fine examples of his style. <br><br>\r\n\r\nInstead of drinking a cup of coffee in the morning, try playing PPDV for once. It has about the same effect and as Vork once said about PPDVII, PPDV's sequel, \"It's a good cup of coffee\". <br><br>\r\n\r\nPPDV may not mean as much to new ZZTers as it does to me and some older ZZTers, but it was a marker in Viovis' history and Viovis has always been one of ZZT's most unique authors and one of the very few who defined his own style and had awards named after him. <br><br>\r\n\r\nIt's classic, that's for sure. However, it is not sure whether or not you'll like it. Some people will love it, others might find it too strange for comfort. It's still something that needs to be in a complete ZZT collection and I recommend you to try it out. ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"troope~1.zip","shoturl":"","month":"5","year":"2001","review":"The choice for this month's Classic Game of the Month fell on Star Troopers. Star Troopers is a game made by Spock, who was one of the two main members of the company Starfield Software back in 1997\/1998 (The other one was eJECTION13), which was a really great company back then. Star Troopers is probably the best of the two games he created (Star Troopers and Wizard's Apprentice).<br><br>\r\n\r\nIn Star Troopers, you assume the role of a young trooper for the Interstellar Union for Senient Races (IUSR). This union, consisting of a couple of races, has recently gone into war with the race of Truk'l. Your task is to investigate what to Truk'l are up too, and to unmask the Truk'l spies that are said to be in the council of the IUSR. This provides a nice search through a couple of planets, during which you get to learn more of the customs, history and the people of these worlds. <br><br>\r\n\r\nStar Troopers is game which was released in a time when the science fiction ZZT game genre was at its peak - back then the famous Chrono Wars saga was also started! Being made by a ZZTer who is not really remembered anymore by most ZZTers (And that's a shame), it proves to be a quite enjoyable adventure game. Nice graphics, nice gameplay, just a cool game which will occupy you for some time! ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"mout.zip","shoturl":"","month":"6","year":"2001","review":"Mined Out, in my opinion, is one of ZZT's most addictive puzzle games. This version (released in 1999) when Igsel was still in his company Spiritual Tempest, was based on a game created by Salamander Software (in 1984) for a UK-only system called Dragon32. <br><br>\r\n\r\nHow does it work? Well, it's rather simple -- you start on one side of a hidden minefield and have to get to the other side. When you take a step, it will say how many mines are surrounding you (sort of like how Minesweeper for Windows works, though you don't click on the minefield, but you walk across it). Work your way through all levels, et voila! <br><br>\r\n\r\nThe graphics may be simple, but they're effective enough. As I said, this game can be rather addictive. If something turns out to be addictive, you know you've created something good. <br><br>\r\n\r\nMined Out was nominated for a few awards in both the IF Annual ZZT Excellence Awards and the Hoodian Awards (like Best Puzzle Game in both of these awards) by the end of 1999, but didn't win any. I suggest giving this fun and enjoyable game a go, if you haven't played it yet. ","reviewer":"Hercules","email":"s_pieterse@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"mbladep.zip","shoturl":"","month":"7","year":"2001","review":"\"Mystic Blade\", an unfinished adventure\/rpg by \"Chrono Wars\" God Chronos, features the usual medieval RPG aspects... light magic, dark magic, knights, wizards, etc., but mixes it in with gameplay that I found somewhat similar to the Zelda series, in that there's land to roam, there's one town nearby, a castle does show up, and there's shops and houses to enter, as well. \"Mystic Blade\" does all of this superbly, keeping the most important factor much alive; fun. Chronos knows how to lay out space, keep secrets secret enough, and make visuals truly support the game and help supply atmosphere, instead of take any away. <br><br>\r\n\r\nHonestly, I enjoy this game as much, if not more, than any entrant of the Chrono Wars series... since this one hasn't been talked about much, however, I get the feeling that it's been forgotten, which is a huge shame... this game definitely deserves an ending (actually, a few more files before one would be better), even if I have to open it up in the editor and make one myself. Meh. <br><br>\r\n\r\nFor those who miss the days when high quality medieval RPGs were common in the ZZT community (one of those people being myself), this one's for you. It's been out since 1998, but I played it for the first time yesterday... damn, do I regret waiting so long. ","reviewer":"Knightt","email":"zztknightt@home.com","awardtype":"cGOTM"}, {"gamefile":"kudzu21.zip","shoturl":"","month":"8","year":"2001","review":"Many years ago the zzt scene wasn't plagued with politics and people being stressed out because they were trying to impress an elite few. Rather, it was a time of experimentation, where people were still searching for the limits of zzt, and trying to see exactly what one could do in an already outdated game creation system. <br><br>\r\n\r\nOut of this era sprang one of the most influential ZZT games of all time, Kudzu. This game truly combines atmosphere, the situation at hand, and its puzzles to perfection. <br><br>\r\n\r\nWith the opening sequence, the player immediately learns that he knows nothing of his situation. All you know is that there is a parachute beside you and that you want to call home. <br><br>\r\n\r\nFrom there, Cly5m doesn't miss a beat, immediately giving the player many things to do. Walking around a strange complex, you do anything from defacing statues to shooting squishy things to breaking urns that clearly state not to break them. The atmosphere of the game is truly wonderful, as cly5m truly sucks the player in. The entire complex is really a joy to walk through (unless you're getting shot at by some mean looking guard type people.) <br><br>\r\n\r\nAt the same time, this game requires thinking, but you will be able to figure it out if you keep seaching. There isn't anything very innovative puzzle-wise, but the layout is marvelous. <br><br>\r\n\r\nWhat I truly like about this game is that it is so rooted in reality, something that is hardly seen in ZZT nowadays. Yet, while everything is very real, it feels as if everything is very unreal at the same time. <br><br>\r\n\r\nAll in all, you can truly thank this game for ZZT being what it is today. Without this masterpiece there would be no P0P, there would be no Winter... well, at least, not how we know them today. Do not let the graphics fool you, this is definitely one of the best ZZT games ever made.  ","reviewer":"wayward","email":"waywardzzt@yahoo.com","awardtype":"cGOTM"}, {"gamefile":"quest-im.zip","shoturl":"","month":"9","year":"2001","review":"Ah, the grande ol' year of 1998. Many people know that this was the \"golden era\" of ZZT... some have heard about it so much that it sickens them. However, there's no denying it; many great games came out that year, such as \"Burger Joint\", \"Teen Priest\", \"Gem Hunter: SE\", \"_Death_\", \"p0p\", and \"Mystic Blade\". This baby's one of them. <br><br>\r\n\r\n\"You're Jackson Tough, the king's royal knight. You carry a gun with 10 ammo. Your best friend is Zarbedos, the royal Skycaptain. He's the leader of an army of Skyknights, who fly on Giant Eagles. You have a talk with him almost every day. He lives in the village. But first of all, you must talk to the king.\" The english of Young Herc wasn't quite what it is today, but the plot is good enough... and still better than many. What truly makes \"Quest for the Immortals\" so great, however, are the high-quality visuals and, most importantly, its simple-yet-addictive gameplay. <br><br>\r\n\r\nFirstly, the graphics. Herc's STK abilities weren't as good as they are today, but the colors and blends provide a fine atmosphere, and are pleasant to the eye. Secondly, the way the game plays is somewhat like the action genre, mixing easy interaction amongst characters with, of course, early ZZT shooting and item collecting. Herc manages to put the style together without commiting any \"ZZT Syndromes\" (as the famous help utility shows)<br><br>. \r\n\r\n...okay, I've said enough. Play it. ","reviewer":"Hydra","email":"niels_velp@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"bluemoon.zip","shoturl":"","month":"10","year":"2001","review":"It is the month of Zenith's Blue moon, a title that is showily reflective of how rarely classic games of this niftiness chance upon before leaving a pawprint on the ZZT gaming world. <br><br>\r\n\r\nThe storyline is not a difficult one to grasp, but its simplicity works for itself. In a nutshell, you play the game as Simon Groves; a prepubescent lad who, with his friend Fred, unwittingly shoulders the hefty task of saving the world from the Sigmas. The Sigmas are somewhat self-explanatory, being a horde of megalomaniac aliens shaped like the Grecian Symbols of the same name.<br><br>\r\n\r\nThe game begins in Simon's room and a dialog reveals to the player the enigma of the 'Blue Moon' (the plot crux around which the rest of the game moves about), an odd entity that had appeared in the earth's stratosphere approximately 6 weeks ago. After a bit of wandering around his house and some abusing of small furr'd animals, Simon realises that his immediate family, as well as the other of the Coaster residents, are acting quite out character. He takes the obvious action of finding Fred, the only other individual that seems unaffected, and together they decide to get to the bottom of the mystery. From here on in, the scenery changes and plotline advances occur quite rapidly, with even The Kave making a radioactively trippy appearance. <br><br>\r\n\r\nAlthough Blue Moon is of the action genre, it makes use of simple mini-puzzles on each board to advance the player. Later on, it also features a segment of rather neat mini-games which do well in adding variety to game play. The graphics and music within the game are of decent quality (view it within its timeframe, people), and give some insight into Zenith's evolution as a programmer and artist. The humour within the game also has his name scrawled all over it in bright crayon marks; Nadir's psychopathic wackiness alone proves entertaining enough to keep any cynics at bay. <br><br>\r\n\r\nThough somewhat quaintly endearing (\"HI MOM!\") in parts, I guarantee Blue Moon to be a satisfyingly solid play with a good deal of replaying value. Indeed, it is definitely a worthy CGotM awardee and a rather cute example of one of Nadir's classical era games. There is no more to say. Go play it, fools; and be amused! ","reviewer":"Kracken","email":"karenlai@froggy.com.au","awardtype":"cGOTM"}, {"gamefile":"v2red.zip","shoturl":"","month":"11","year":"2001","review":"","reviewer":"","email":"","awardtype":"cGOTM"}, {"gamefile":"lebensrm.zip","shoturl":"","month":"12","year":"2001","review":"Hi, everyone. It's time that I stuck my proverbial nose where it doesn't belong. I am Mike Renner, known to a great lot of you as Tseng, and a select few of you as \"that fucking asshole, Tseng\". I'm taking Kracken's place for writing Classic Game of the Month, since she's ill, and I happened to be online at the time. Insomnia works wonders, I always say. I'll STRESS that I am not Kracken. She uses much bigger words than I. <br><br>\r\n\r\nNow, choosing Classic Game of the Month is an easy process for me. I just look at what's chosen, then choose something else. Something that deserves it. Most people who will see this game on CGotM will think that it's Kracken's call, and she's giving this to Nadir because they're all loveydovey. In truth, she just gave me the reigns to pick what I wanted. It's a game that's been constantly emulated (I know I've tried it), but never duplicated. <br><br>\r\n\r\nLebensraum was it. <br><br>\r\n\r\nNadir's always had a handle on fun ZZT games. I go on record in saying that Dragon Woods was awesome, as was Blue Moon, the Fucking Egg Games (the one thing Testa ever left me with that I still use to this day is that name), and Untitled. Lebensraum is the epitome of the ZZT action game, essentially a game that allows you to run around and shoot without abandon. You are Jim Cowvitz, and you are a prisoner in a Nazi camp. Obviously, you greatly annoyed someone up there and now you're in the physical equivilant of listening to Hanson on full blast with about fifty Hanson-hating spectators around you, armed with rotten eggs. <br><br>\r\n\r\nThe game drops you right in the middle of a Nazi camp, and obviously, unless you have some sort of deathwish, you have to go escapies. It's similar to going to the bathroom, except that you're going to make the Nazis wet their pants. So you take what I can only assume to be a machine gun and you begin turning your enemies into a bloody form of swiss cheese. This game would be banned by animal's rights activists, since you also get to shoot dogs. Isn't this a lovely game? <br><br>\r\n\r\nThe AI of the enemies involved is rather simple and effective, as the enemies often move *just* before your bullet strikes them, which will annoy the hell out of you. There's a sufficent ammount of ammunition around to get the job done, and it's one hell of a job to get done. <br><br>\r\n\r\nBut if all I were to talk about are the intricates of the game's fighting, itself, it would get boring. In the game, you don't know what's behind a door until you actually open it. Once you open it, the details of the room show up. Maybe a rug, a Nazi flag, suits of armor, and, of course, the enemies. This also works for around the corner, and Zenith took a ludicrous amount of detail to do this. <br><br>\r\n\r\nBut if you think THAT'S the gist of the game, you're sadly mistakened. Zenith has also taken the time to add secret rooms in all of the levels in the game, hidden from view of the player. It allows more playability of the game, allowing you to play to your heart's content, especially with the four different difficulty levels. <br><br>\r\n\r\nIf there's one problem with the game, it's the fact that Zenith began to run out of memory after finishing the third level, and thus, he had to attach the ending. With a rivet gun. To make it up for everyone, he *laughs evilly* included a little bonus game where I, Tseng, got to kill everyone in #darkdigital. <br><br>\r\n\r\nOkay, so I have a soft spot for the fact that I get to shoot Vampy\/Jawatrader. SUE ME.<br><br>\r\n\r\nBut all in all, Lebensraum is one of the BEST action games you'll ever play, filled with secrets and shooting action, and with four difficulty levels, a novice or an expert can play Lebensraum. It's a game that will kick nine hundred different kinds of ass and still have a line of asses around the corner to kick.","reviewer":"Tseng","email":"","awardtype":"cGOTM"}, {"gamefile":"wtemple.zip","shoturl":"","month":"1","year":"2002","review":"Warlord's Temple, by Matt Williams, is an old game which, whether you realise it or not, has influenced your lives in such phantasmagorical ways your small human minds cannot possibly hope to comprehend! In it, you are Marcus, a young adventurer who wanders (as all good adventurers do) into a mysterious land with an mysterious red sky and a mysterious castle with a mysterious amount of BLOOD AND SKELLINGTONS. Mysteriously, you come upon all manner of mysteriousness! <br><br>\r\n\r\nWhich explains NOTHING to the poor reader. I apologise. It transpires as you progress through the plot via an interface with an old diary and other such devices that a dark serpent, Dreadfire, has beamed into the castle and levelled the kingdom that the land once housed, causing most of the people to leave, for reasons unknown. As such, the castle is full of evil demons and all manner of things with sharp point mandibles that want you suck your soul out and sodomise it repeatedly. And pre-fabricated enemies, naturally. <br><br>\r\n\r\nWhat makes this game such a classic is that, while if it were released today it would be seen as a \"pretty good game\", at its time it tries out all manner of conventions used more commonly today than in 1996 (when it was released). The title screen, for one, is deceptively simple but involves a HELL of a lot of #change and #put command utilisation. As well as this is the spell\/mana engine, a precursor for future games in the same way Chrono Wars 10 was a precursor for the inventory engine I so wantonly raped in the Dizzy games. <br><br>\r\n\r\nIn short, Warlord's Temple owns you. Go get.","reviewer":"Zenith","email":"Nadir427@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"corrupt.zip","shoturl":"","month":"2","year":"2002","review":"Bit of a short review this month, but with all the PUHHDICAMENTS that have arisen, I'd like to think you'll forgive me. You will won't you? Hmm? Remember, I know where you live.<br><br>\r\n\r\n...<br><br>\r\n\r\nGOOD. On with the review!<br><br>\r\n\r\nGiven the overall high quality of the games made by the now defunct AKWare, it's surprising that none of them have ever been chosen for Game or classic Game of the Month. Well I'm changing that this month with a look back at their great (but sadly forgotten) Corrupt Mind.<br><br>\r\n\r\nThe plot is simple but pleasingly bonkers; AKNeutron's brain is on the fritz. Being a helpful (read: stupid) sort of chap, you hook his brain up to ZZT, turn his mind into a ZZT game and enter it to put things in order. Right.<br><br>\r\n\r\nStill, the game itself is a little more satisfying. Like most AKWare games it's fairly nonliner, being split up into five different areas of which you must complete four before entering the final area. Each section varies in difficulty, from the fairly easy restaurant (!) to the far harder \"Right hemisphere\". The game's wonderfully imaginative, featuring a logic factory, a crrazy imaginative world and - heh - a literal 'train of thought' amongst other curious things. All are represented by colourful, well shaded graphics (particularly in the RPG battles).<br><br>\r\n\r\nThe gameplay is varied and switches between regular bullet-fests, puzzles and RPG battles. It's not perfect; it occasionally relies on pre-programmed enemies or (hnngh) boulder-pushing puzzles, and the appearance of the AKWare quiz machine is a wee bit annoying (especially since most of the answers only really made sense at the time, if at all).<br><br>\r\n\r\nDespite these flaws, however, it remains a solidly entertaining little game. Colourful, clever and cute - Corrupt Mind is classic Game Of The Month!","reviewer":"Funk","email":"wilko_3000@yahoo.com","awardtype":"cGOTM"}, {"gamefile":"sivion.zip","shoturl":"","month":"3","year":"2002","review":"Well, I guess I'm either a moron, or just... a moron, because I've been ZZTing since April 1998, and despite hearing its name MANY times before, I never bothered to touch the funky Monthigos Adventure\/RPG known as Sivion... well, now that I have, you can slap my ass and call me \"Spanky\", because after all those years of ignorance, I've discovered something that's as old as Dole and plays like Clinton... <br><br>\r\n\r\nNow, before you start judging the game, let me restate the magic number on Sivion's title screen; 1995. Back then, dinosaurs ruled, Gutenberg had just invented the Bible, and being a terrorist meant threatening to steal your neighbor's donkey's genitals. Graphics weren't exactly Dutchy-keen, and WiLLy VaniLLi was yet to come around to attempt to program paradise... don't even bother mentioning the car, all the ZZT world had was the wheel. Despite all that, Sivion manages to use Ms. Ja(ck,n)son's colors extremely well; boulders background rooms similar to many-an-IF\/Knightt-game, simple-yet-purdy shades show off caves, fields, and humorless desert, and it's pretty easy to tell what's a house and what's a shark (no worries, drac0, you can see 'em just as well stoned and\/or drunk!)... while enemies (other than the pre-programmed ones, of course) carry out code smoothly and almost bug-free... throw a few degree symbols at 'em, n' they'll vanish sooner than you can say \"I can't believe I actually downloaded a GOOD game, for once...\"! Monthigos also set flags without fault, as well as \"\/i\"s in character dialogue. <br><br>\r\n\r\nKeep your eyes peeled, kids, it's time to cover storyline! Sivion's text is cliched, full of bad jokes (I'm sure you don't mind them, though, since you've read this far), and it annoyingly scrolls at the bottom of the player screen... however, at the same time, it's enough to hold interest and attention. Genies, kings, wizards, libraries... nice, but a few owls and crystals that secretly keep the world alive would help. <br><br>\r\n\r\nAnd, now, the recommendations... if you're a Leamas fan (LOME, Thief 3... especially LOME) like me, take a look. The old man's just as good as the little boy, babe.","reviewer":"Knightt","email":"mysticknightt@hotmail.com","awardtype":"cGOTM"}, {"gamefile":"foolqst.zip","shoturl":"","month":"5","year":"2002","review":"This month's CGotM is \"The Fool's Quest\", definitely the least well-known game from the lot of the INFAMOUS Gregory Janson; and a well deserved win it is too, in my opinion. Some may criticise this game as not being as complex as Code Red or Mission enigma, but I believe it's still much fun to play and well worth the time to do so. <br><br>\r\n\r\nBoasting some of the best non-STK graphics ever made, The Fool's quest provides a hearty adventure that should be part of every ZZT'ers' diet. The plot is simple and again effective - as The Fool, you are sent on a mission to rid the realm of an impending darkness. Sound familiar? It should be, by now. =) <br><br>\r\n\r\nAdditionally, The Fool's Quest is open to replay, having 2 endings up its jestered sleeve. I can surely say that it is one of the best pre-STK games ever, and more than enough of a game to satiate any \"Fool\"! <br><br>\r\n\r\nA decently solid play, once you've given it a sporting chance to sink in. ","reviewer":"Kracken","email":"karenlai@froggy.com.au","awardtype":"cGOTM"}, {"gamefile":"coolness.zip","shoturl":"","month":"5","year":"2002","review":"We've an absolute corker of a classic game for you this month, courtesy of Software Visions - the company that included such talented ZZTers as Chris Jong (AKA cygnus), Clint Nelson (Monthigos, winner of last month's cGOTM) and treacherous Megazeux-creating turncoat Gregory Janson.\r\n\r\nThe plot then. Or, rather - plots, because much like its bigger brother Code Red, Coolness features multiple endings and plotlines (three in total). You'll find yourself either fighting the usual \"evil aliens\", saving the local swimming pool from a mad bomber, or getting stranded in a space-station. Each one is packed with puzzles, and although they admittedly aren't too difficult, they still provide a bit of a challenge. It's not perfect, and there ARE some curiously random bits (a rocket? In a tree? Eh? And what DOES your dad have to do with the big spooky building behind your house?) but if you just suspend your disebelief and play through the game you'll be entertained.\r\n\r\nThe graphics aren't anything too amazing by today's standards but who cares when the game's this much fun to play? Hell, it deserves a cGOTM award if only for the tremendous Fusebox puzzle.\r\n\r\nTo be honest, there's not much more to say about Coolness. Yes, it's basically Code Red Lite, but it's also a lot less sprawling and frustrating than Janson's game, and certainly deserving of this month's cGOTM award.","reviewer":"Funk","email":"wilko_3000@yahoo.com","awardtype":"cGOTM"}, {"gamefile":"yvs2.zip","shoturl":"","month":"6","year":"2002","review":"Following on from March's Corrupt Mind, You vs. Stupidity is another AKWare classic. As ever, the plot (\"stop the rise of stupidity\") is almost non-existant, and only serves as a flimsy excuse for the game itself. And what a game! Timed missions, shoot-'em-ups, puzzle solving, platform sections, 3D mazes, RPG battles - the gameplay is wonderfully varied and challenging . Better yet it's non-liner, so that whilst you must complete certain sections to complete the game, the order in which you do so is up to you. There are also a few secrets dotted about here and there to encourage replay and exploration. <br><br>\r\n\r\nThe jokes are the usual pop-culture stuff, and admittedly most of the subjects (Space Jam, Men In Black) have grown a little old in the intervening years. Still, they should still raise a little chuckle from you every now and again (although some are a little bit too \"hey I'm crrrrazy!\" for my tastes). <br><br>\r\n\r\nAlthough the graphics swing between 'adequate' and 'excellent' (with the boss battles being particularly pretty), the enclosed font polishes up the presentation no end. Still, so long as you're downloading this for the excellent gameplay then you will NOT be disappointed. <br><br>\r\n\r\nNB: Some Win XP users may not be able to use the .bat file to load the font. This problem is currently unfixable, but does not impact too badly on the game itself. ","reviewer":"Funk","email":"wilko_3000@yahoo.com","awardtype":"cGOTM"}]